[
  {
    "title": "Introduction",
    "url": "https://cses.fi/problemset/text/2433",
    "description": "The CSES Problem Set is a collection of algorithmic programming problems. The goal of the project is to create a comprehensive high quality problem set for learning algorithmic programming. The current collection has 400 problems, and new problems will be gradually added. You can solve problems in several languages, including C++, Java, and Python. More information about available languages is here. In all problems you should read input from standard input and write output to standard output. After solving a problem, you can view the solutions by other users and try to hack them by giving a test case where the solution fails. Then, the new test case can be added to the test data and all submissions will be regraded. You can use the problem set together with recent competitive programming books, listed here. The books discuss techniques and ideas that are useful when solving the problems. The license of the problem set is Creative Commons BY-NC-SA 4.0. If you have feedback on the problem set, you can send a message to ahslaaks@cs.helsinki.fi (Antti Laaksonen)."
  },
  {
    "title": "Create new account",
    "url": "https://cses.fi/register/?open",
    "description": "Username*: Password*: Password again*: Name: Email: Country:\nN/A\nAfghanistan\nAlbania\nAlgeria\nAndorra\nAngola\nAntigua and Barbuda\nArgentina\nArmenia\nAustralia\nAustria\nAzerbaijan\nBahamas\nBahrain\nBangladesh\nBarbados\nBelarus\nBelgium\nBelize\nBenin\nBhutan\nBolivia\nBosnia and Herzegovina\nBotswana\nBrazil\nBrunei\nBulgaria\nBurkina Faso\nBurundi\nCambodia\nCameroon\nCanada\nCape Verde\nCentral African Republic\nChad\nChile\nChina\nColombia\nComoros\nCongo, Republic\nCongo, Democratic Republic\nCosta Rica\nCroatia\nCuba\nCyprus\nCzech Republic\nDenmark\nDjibouti\nDominica\nDominican Republic\nEast Timor\nEcuador\nEgypt\nEl Salvador\nEquatorial Guinea\nEritrea\nEstonia\nEthiopia\nFiji\nFinland\nFrance\nFrench Polynesia\nGabon\nGambia\nGeorgia\nGermany\nGhana\nGreece\nGrenada\nGuatemala\nGuinea\nGuinea-Bissau\nGuyana\nHaiti\nHonduras\nHong Kong\nHungary\nIceland\nIndia\nIndonesia\nIran\nIraq\nIreland\nIsrael\nItaly\nIvory Coast\nJamaica\nJapan\nJordan\nKazakhstan\nKenya\nKiribati\nKorea, North\nKorea, South\nKuwait\nKyrgyzstan\nLaos\nLatvia\nLebanon\nLesotho\nLiberia\nLibya\nLiechtenstein\nLithuania\nLuxembourg\nMacao\nMacedonia\nMadagascar\nMalawi\nMalaysia\nMaldives\nMali\nMalta\nMarshall Islands\nMauritania\nMauritius\nMexico\nMicronesia\nMoldova\nMonaco\nMongolia\nMontenegro\nMorocco\nMozambique\nMyanmar\nNamibia\nNauru\nNepal\nNetherlands\nNew Zealand\nNicaragua\nNiger\nNigeria\nNorway\nOman\nPakistan\nPalau\nPalestine\nPanama\nPapua New Guinea\nParaguay\nPeru\nPhilippines\nPoland\nPortugal\nQatar\nRomania\nRussia\nRwanda\nSaint Kitts and Nevis\nSaint Lucia\nSaint Vincent\nSamoa\nSan Marino\nSao Tome and Principe\nSaudi Arabia\nSenegal\nSerbia\nSeychelles\nSierra Leone\nSingapore\nSlovakia\nSlovenia\nSolomon Islands\nSomalia\nSouth Africa\nSpain\nSri Lanka\nSudan\nSuriname\nSwaziland\nSweden\nSwitzerland\nSyria\nTaiwan\nTajikistan\nTanzania\nThailand\nTogo\nTonga\nTrinidad and Tobago\nTunisia\nTurkey\nTurkmenistan\nTuvalu\nUganda\nUkraine\nUnited Arab Emirates\nUnited Kingdom\nUnited States\nUruguay\nUzbekistan\nVatican City\nVanuatu\nVenezuela\nVietnam\nYemen\nZambia\nZimbabwe"
  },
  {
    "title": "Statistics",
    "url": "https://cses.fi/problemset/stats/",
    "description": ""
  },
  {
    "title": "Weird Algorithm",
    "url": "https://cses.fi/problemset/task/1068",
    "description": "Consider an algorithm that takes as input a positive integer nnn. If nnn is even, the algorithm divides it by two, and if nnn is odd, the algorithm multiplies it by three and adds one. The algorithm repeats this, until nnn is one. For example, the sequence for n=3n=3n=3 is as follows:\n3→10→5→16→8→4→2→1 3 \\rightarrow 10 \\rightarrow 5 \\rightarrow 16 \\rightarrow 8 \\rightarrow 4 \\rightarrow 2 \\rightarrow 13→10→5→16→8→4→2→1\nYour task is to simulate the execution of the algorithm for a given value of nnn. The only input line contains an integer nnn. Print a line that contains all values of nnn during the algorithm. Input: Output:"
  },
  {
    "title": "Missing Number",
    "url": "https://cses.fi/problemset/task/1083",
    "description": "You are given all numbers between 1,2,…,n1,2,\\ldots,n1,2,…,n except one. Your task is to find the missing number. The first input line contains an integer nnn. The second line contains n−1n-1n−1 numbers. Each number is distinct and between 111 and nnn (inclusive). Print the missing number. Input: Output:"
  },
  {
    "title": "Repetitions",
    "url": "https://cses.fi/problemset/task/1069",
    "description": "You are given a DNA sequence: a string consisting of characters A, C, G, and T. Your task is to find the longest repetition in the sequence. This is a maximum-length substring containing only one type of character. The only input line contains a string of nnn characters. Print one integer: the length of the longest repetition. Input: Output:"
  },
  {
    "title": "Increasing Array",
    "url": "https://cses.fi/problemset/task/1094",
    "description": "You are given an array of nnn integers. You want to modify the array so that it is increasing, i.e., every element is at least as large as the previous element. On each move, you may increase the value of any element by one. What is the minimum number of moves required? The first input line contains an integer nnn: the size of the array. Then, the second line contains nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the contents of the array. Print the minimum number of moves. Input: Output:"
  },
  {
    "title": "Permutations",
    "url": "https://cses.fi/problemset/task/1070",
    "description": "A permutation of integers 1,2,…,n1,2,\\ldots,n1,2,…,n is called beautiful if there are no adjacent elements whose difference is 111. Given nnn, construct a beautiful permutation if such a permutation exists. The only input line contains an integer nnn. Print a beautiful permutation of integers 1,2,…,n1,2,\\ldots,n1,2,…,n. If there are several solutions, you may print any of them. If there are no solutions, print \"NO SOLUTION\". Input: Output: Input: Output:"
  },
  {
    "title": "Number Spiral",
    "url": "https://cses.fi/problemset/task/1071",
    "description": "A number spiral is an infinite grid whose upper-left square has number 1. Here are the first five layers of the spiral: The first input line contains an integer ttt: the number of tests. After this, there are ttt lines, each containing integers yyy and xxx. For each test, print the number in row yyy and column xxx. Input: Output:"
  },
  {
    "title": "Two Knights",
    "url": "https://cses.fi/problemset/task/1072",
    "description": "Your task is to count for k=1,2,…,nk=1,2,\\ldots,nk=1,2,…,n the number of ways two knights can be placed on a k×kk \\times kk×k chessboard so that they do not attack each other. The only input line contains an integer nnn. Print nnn integers: the results. Input: Output:"
  },
  {
    "title": "Two Sets",
    "url": "https://cses.fi/problemset/task/1092",
    "description": "Your task is to divide the numbers 1,2,…,n1,2,\\ldots,n1,2,…,n into two sets of equal sum. The only input line contains an integer nnn. Print \"YES\", if the division is possible, and \"NO\" otherwise. After this, if the division is possible, print an example of how to create the sets. First, print the number of elements in the first set followed by the elements themselves in a separate line, and then, print the second set in a similar way. Input: Output: Input: Output:"
  },
  {
    "title": "Bit Strings",
    "url": "https://cses.fi/problemset/task/1617",
    "description": "Your task is to calculate the number of bit strings of length nnn. For example, if n=3n=3n=3, the correct answer is 888, because the possible bit strings are 000, 001, 010, 011, 100, 101, 110, and 111. The only input line has an integer nnn. Print the result modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Trailing Zeros",
    "url": "https://cses.fi/problemset/task/1618",
    "description": "Your task is to calculate the number of trailing zeros in the factorial n!n!n!. For example, 20!=243290200817664000020!=243290200817664000020!=2432902008176640000 and it has 444 trailing zeros. The only input line has an integer nnn. Print the number of trailing zeros in n!n!n!. Input: Output:"
  },
  {
    "title": "Coin Piles",
    "url": "https://cses.fi/problemset/task/1754",
    "description": "You have two coin piles containing aaa and bbb coins. On each move, you can either remove one coin from the left pile and two coins from the right pile, or two coins from the left pile and one coin from the right pile. Your task is to efficiently find out if you can empty both the piles. The first input line has an integer ttt: the number of tests. After this, there are ttt lines, each of which has two integers aaa and bbb: the numbers of coins in the piles. For each test, print \"YES\" if you can empty the piles and \"NO\" otherwise. Input: Output:"
  },
  {
    "title": "Palindrome Reorder",
    "url": "https://cses.fi/problemset/task/1755",
    "description": "Given a string, your task is to reorder its letters in such a way that it becomes a palindrome (i.e., it reads the same forwards and backwards). The only input line has a string of length nnn consisting of characters A–Z. Print a palindrome consisting of the characters of the original string. You may print any valid solution. If there are no solutions, print \"NO SOLUTION\". Input: Output:"
  },
  {
    "title": "Gray Code",
    "url": "https://cses.fi/problemset/task/2205",
    "description": "A Gray code is a list of all 2n2^n2n bit strings of length nnn, where any two successive strings differ in exactly one bit (i.e., their Hamming distance is one). Your task is to create a Gray code for a given length nnn. The only input line has an integer nnn. Print 2n2^n2n lines that describe the Gray code. You can print any valid solution. Input: Output:"
  },
  {
    "title": "Tower of Hanoi",
    "url": "https://cses.fi/problemset/task/2165",
    "description": "The Tower of Hanoi game consists of three stacks (left, middle and right) and nnn round disks of different sizes. Initially, the left stack has all the disks, in increasing order of size from top to bottom. The goal is to move all the disks to the right stack using the middle stack. On each move you can move the uppermost disk from a stack to another stack. In addition, it is not allowed to place a larger disk on a smaller disk. Your task is to find a solution that minimizes the number of moves. The only input line has an integer nnn: the number of disks. First print an integer kkk: the minimum number of moves. After this, print kkk lines that describe the moves. Each line has two integers aaa and bbb: you move a disk from stack aaa to stack bbb. Input: Output:"
  },
  {
    "title": "Creating Strings",
    "url": "https://cses.fi/problemset/task/1622",
    "description": "Given a string, your task is to generate all different strings that can be created using its characters. The only input line has a string of length nnn. Each character is between a–z. First print an integer kkk: the number of strings. Then print kkk lines: the strings in alphabetical order. Input: Output:"
  },
  {
    "title": "Apple Division",
    "url": "https://cses.fi/problemset/task/1623",
    "description": "There are nnn apples with known weights. Your task is to divide the apples into two groups so that the difference between the weights of the groups is minimal. The first input line has an integer nnn: the number of apples. The next line has nnn integers p1,p2,…,pnp_1,p_2,\\dots,p_np1​,p2​,…,pn​: the weight of each apple. Print one integer: the minimum difference between the weights of the groups. Input: Output: Explanation: Group 1 has weights 2, 3 and 4 (total weight 9), and group 2 has weights 1 and 7 (total weight 8)."
  },
  {
    "title": "Chessboard and Queens",
    "url": "https://cses.fi/problemset/task/1624",
    "description": "Your task is to place eight queens on a chessboard so that no two queens are attacking each other. As an additional challenge, each square is either free or reserved, and you can only place queens on the free squares. However, the reserved squares do not prevent queens from attacking each other. How many possible ways are there to place the queens? The input has eight lines, and each of them has eight characters. Each square is either free (.) or reserved (*). Print one integer: the number of ways you can place the queens. Input: Output:"
  },
  {
    "title": "Raab Game I",
    "url": "https://cses.fi/problemset/task/3399",
    "description": "Consider a two player game where each player has nnn cards numbered 1,2,…,n1,2,\\dots,n1,2,…,n. On each turn both players place one of their cards on the table. The player who placed the higher card gets one point. If the cards are equal, neither player gets a point. The game continues until all cards have been played. You are given the number of cards nnn and the players' scores at the end of the game, aaa and bbb. Your task is to give an example of how the game could have played out. The first line contains one integer ttt: the number of tests. Then there are ttt lines, each with three integers nnn, aaa and bbb. For each test case print YES if there is a game with the given outcome and NO otherwise. If the answer is YES, print an example of one possible game. Print two lines representing the order in which the players place their cards. You can give any valid example. Input: Output:"
  },
  {
    "title": "Mex Grid Construction",
    "url": "https://cses.fi/problemset/task/3419",
    "description": "Your task is to construct an n×nn \\times nn×n grid where each square has the smallest nonnegative integer that does not appear to the left on the same row or above on the same column. The only line has an integer nnn. Print the grid according to the example. Input: Output:"
  },
  {
    "title": "Knight Moves Grid",
    "url": "https://cses.fi/problemset/task/3217",
    "description": "There is a knight on an n×nn \\times nn×n chessboard. For each square, print the minimum number of moves the knight needs to do to reach the top-left corner. The only line has an integer nnn. Print the number of moves for each square. Input: Output:"
  },
  {
    "title": "Grid Coloring I",
    "url": "https://cses.fi/problemset/task/3311",
    "description": "You are given an n×mn\\times mn×m grid where each cell contains one character A, B, C or D. For each cell, you must change the character to A, B, C or D. The new character must be different from the old one. Your task is to change the characters in every cell such that no two adjacent cells have the same character. The first line has two integers nnn and mmm: the number of rows and columns. The next nnn lines each have mmm characters: the description of the grid. Print nnn lines each with mmm characters: the description of the final grid. You may print any valid solution. If no solution exists, just print IMPOSSIBLE. Input: Output:"
  },
  {
    "title": "Digit Queries",
    "url": "https://cses.fi/problemset/task/2431",
    "description": "Consider an infinite string that consists of all positive integers in increasing order: 12345678910111213141516171819202122232425... Your task is to process qqq queries of the form: what is the digit at position kkk in the string? The first input line has an integer qqq: the number of queries. After this, there are qqq lines that describe the queries. Each line has an integer kkk: a 111-indexed position in the string. For each query, print the corresponding digit. Input: Output:"
  },
  {
    "title": "String Reorder",
    "url": "https://cses.fi/problemset/task/1743",
    "description": "Your task is to reorder the characters of a string so that no two adjacent characters are the same. What is the lexicographically minimal such string? The only line has a string of length nnn consisting of characters A–Z. Print the lexicographically minimal reordered string where no two adjacent characters are the same. If it is not possible to create such a string, print −1-1−1. Input: Output:"
  },
  {
    "title": "Grid Path Description",
    "url": "https://cses.fi/problemset/task/1625",
    "description": "There are 884188841888418 paths in a 7×77 \\times 77×7 grid from the upper-left square to the lower-left square. Each path corresponds to a 484848-character description consisting of characters D (down), U (up), L (left) and R (right). For example, the path You are given a description of a path which may also contain characters ? (any direction). Your task is to calculate the number of paths that match the description. The only input line has a 484848-character string of characters ?, D, U, L and R. Print one integer: the total number of paths. Input: Output:"
  },
  {
    "title": "Distinct Numbers",
    "url": "https://cses.fi/problemset/task/1621",
    "description": "You are given a list of nnn integers, and your task is to calculate the number of distinct values in the list. The first input line has an integer nnn: the number of values. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​. Print one integers: the number of distinct values. Input: Output:"
  },
  {
    "title": "Apartments",
    "url": "https://cses.fi/problemset/task/1084",
    "description": "There are nnn applicants and mmm free apartments. Your task is to distribute the apartments so that as many applicants as possible will get an apartment. Each applicant has a desired apartment size, and they will accept any apartment whose size is close enough to the desired size. The first input line has three integers nnn, mmm, and kkk: the number of applicants, the number of apartments, and the maximum allowed difference. The next line contains nnn integers a1,a2,…,ana_1, a_2, \\ldots, a_na1​,a2​,…,an​: the desired apartment size of each applicant. If the desired size of an applicant is xxx, they will accept any apartment whose size is between x−kx-kx−k and x+kx+kx+k. The last line contains mmm integers b1,b2,…,bmb_1, b_2, \\ldots, b_mb1​,b2​,…,bm​: the size of each apartment. Print one integer: the number of applicants who will get an apartment. Input: Output:"
  },
  {
    "title": "Ferris Wheel",
    "url": "https://cses.fi/problemset/task/1090",
    "description": "There are nnn children who want to go to a Ferris wheel, and your task is to find a gondola for each child. Each gondola may have one or two children in it, and in addition, the total weight in a gondola may not exceed xxx. You know the weight of every child. What is the minimum number of gondolas needed for the children? The first input line contains two integers nnn and xxx: the number of children and the maximum allowed weight. The next line contains nnn integers p1,p2,…,pnp_1,p_2,\\ldots,p_np1​,p2​,…,pn​: the weight of each child. Print one integer: the minimum number of gondolas. Input: Output:"
  },
  {
    "title": "Concert Tickets",
    "url": "https://cses.fi/problemset/task/1091",
    "description": "There are nnn concert tickets available, each with a certain price. Then, mmm customers arrive, one after another. Each customer announces the maximum price they are willing to pay for a ticket, and after this, they will get a ticket with the nearest possible price such that it does not exceed the maximum price. The first input line contains integers nnn and mmm: the number of tickets and the number of customers. The next line contains nnn integers h1,h2,…,hnh_1,h_2,\\ldots,h_nh1​,h2​,…,hn​: the price of each ticket. The last line contains mmm integers t1,t2,…,tmt_1,t_2,\\ldots,t_mt1​,t2​,…,tm​: the maximum price for each customer in the order they arrive. Print, for each customer, the price that they will pay for their ticket. After this, the ticket cannot be purchased again. If a customer cannot get any ticket, print −1-1−1. Input: Output:"
  },
  {
    "title": "Restaurant Customers",
    "url": "https://cses.fi/problemset/task/1619",
    "description": "You are given the arrival and leaving times of nnn customers in a restaurant. What was the maximum number of customers in the restaurant at any time? The first input line has an integer nnn: the number of customers. After this, there are nnn lines that describe the customers. Each line has two integers aaa and bbb: the arrival and leaving times of a customer. You may assume that all arrival and leaving times are distinct. Print one integer: the maximum number of customers. Input: Output:"
  },
  {
    "title": "Movie Festival",
    "url": "https://cses.fi/problemset/task/1629",
    "description": "In a movie festival nnn movies will be shown. You know the starting and ending time of each movie. What is the maximum number of movies you can watch entirely? The first input line has an integer nnn: the number of movies. After this, there are nnn lines that describe the movies. Each line has two integers aaa and bbb: the starting and ending times of a movie. Print one integer: the maximum number of movies. Input: Output:"
  },
  {
    "title": "Sum of Two Values",
    "url": "https://cses.fi/problemset/task/1640",
    "description": "You are given an array of nnn integers, and your task is to find two values (at distinct positions) whose sum is xxx. The first input line has two integers nnn and xxx: the array size and the target sum. The second line has nnn integers a1,a2,…,ana_1,a_2,\\dots,a_na1​,a2​,…,an​: the array values. Print two integers: the positions of the values. If there are several solutions, you may print any of them. If there are no solutions, print IMPOSSIBLE. Input: Output:"
  },
  {
    "title": "Maximum Subarray Sum",
    "url": "https://cses.fi/problemset/task/1643",
    "description": "Given an array of nnn integers, your task is to find the maximum sum of values in a contiguous, nonempty subarray. The first input line has an integer nnn: the size of the array. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array values. Print one integer: the maximum subarray sum. Input: Output:"
  },
  {
    "title": "Stick Lengths",
    "url": "https://cses.fi/problemset/task/1074",
    "description": "There are nnn sticks with some lengths. Your task is to modify the sticks so that each stick has the same length. You can either lengthen and shorten each stick. Both operations cost xxx where xxx is the difference between the new and original length. What is the minimum total cost? The first input line contains an integer nnn: the number of sticks. Then there are nnn integers: p1,p2,…,pnp_1,p_2,\\ldots,p_np1​,p2​,…,pn​: the lengths of the sticks. Print one integer: the minimum total cost. Input: Output:"
  },
  {
    "title": "Missing Coin Sum",
    "url": "https://cses.fi/problemset/task/2183",
    "description": "You have nnn coins with positive integer values. What is the smallest sum you cannot create using a subset of the coins? The first line has an integer nnn: the number of coins. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the value of each coin. Print one integer: the smallest coin sum. Input: Output:"
  },
  {
    "title": "Collecting Numbers",
    "url": "https://cses.fi/problemset/task/2216",
    "description": "You are given an array that contains each number between 1…n1 \\dots n1…n exactly once. Your task is to collect the numbers from 111 to nnn in increasing order. On each round, you go through the array from left to right and collect as many numbers as possible. What will be the total number of rounds? The first line has an integer nnn: the array size. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the numbers in the array. Print one integer: the number of rounds. Input: Output:"
  },
  {
    "title": "Collecting Numbers II",
    "url": "https://cses.fi/problemset/task/2217",
    "description": "You are given an array that contains each number between 1…n1 \\dots n1…n exactly once. Your task is to collect the numbers from 111 to nnn in increasing order. On each round, you go through the array from left to right and collect as many numbers as possible. Given mmm operations that swap two numbers in the array, your task is to report the number of rounds after each operation. The first line has two integers nnn and mmm: the array size and the number of operations. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the numbers in the array. Finally, there are mmm lines that describe the operations. Each line has two integers aaa and bbb: the numbers at positions aaa and bbb are swapped. Print mmm integers: the number of rounds after each swap. Input: Output:"
  },
  {
    "title": "Playlist",
    "url": "https://cses.fi/problemset/task/1141",
    "description": "You are given a playlist of a radio station since its establishment. The playlist has a total of nnn songs. What is the longest sequence of successive songs where each song is unique? The first input line contains an integer nnn: the number of songs. The next line has nnn integers k1,k2,…,knk_1,k_2,\\ldots,k_nk1​,k2​,…,kn​: the id number of each song. Print the length of the longest sequence of unique songs. Input: Output:"
  },
  {
    "title": "Towers",
    "url": "https://cses.fi/problemset/task/1073",
    "description": "You are given nnn cubes in a certain order, and your task is to build towers using them. Whenever two cubes are one on top of the other, the upper cube must be smaller than the lower cube. You must process the cubes in the given order. You can always either place the cube on top of an existing tower, or begin a new tower. What is the minimum possible number of towers? The first input line contains an integer nnn: the number of cubes. The next line contains nnn integers k1,k2,…,knk_1,k_2,\\ldots,k_nk1​,k2​,…,kn​: the sizes of the cubes. Print one integer: the minimum number of towers. Input: Output:"
  },
  {
    "title": "Traffic Lights",
    "url": "https://cses.fi/problemset/task/1163",
    "description": "There is a street of length xxx whose positions are numbered 0,1,…,x0,1,\\ldots,x0,1,…,x. Initially there are no traffic lights, but nnn sets of traffic lights are added to the street one after another. Your task is to calculate the length of the longest passage without traffic lights after each addition. The first input line contains two integers xxx and nnn: the length of the street and the number of sets of traffic lights. Then, the next line contains nnn integers p1,p2,…,pnp_1,p_2,\\ldots,p_np1​,p2​,…,pn​: the position of each set of traffic lights. Each position is distinct. Print the length of the longest passage without traffic lights after each addition. Input: Output:"
  },
  {
    "title": "Distinct Values Subarrays",
    "url": "https://cses.fi/problemset/task/3420",
    "description": "Given an array of nnn integers, count the number of subarrays where each element is dictinct. The first line has an integer nnn: the array size. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array contents. Print the number of subarrays with distinct elements. Input: Output: Explanation: The subarrays are [1][1][1] (two times), [2][2][2], [3][3][3], [1,2][1,2][1,2], [1,3][1,3][1,3], [2,1][2,1][2,1] and [2,1,3][2,1,3][2,1,3]."
  },
  {
    "title": "Distinct Values Subsequences",
    "url": "https://cses.fi/problemset/task/3421",
    "description": "Given an array of nnn integers, count the number of subsequences where each element is dictinct. A subsequence is a sequence of array elements from left to right that may have gaps. The first line has an integer nnn: the array size. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array contents. Print the number of subsequences with distinct elements. The answer can be large, so print it modulo 109+710^9+7109+7. Input: Output: Explanation: The subsequences are [1][1][1] (two times), [2][2][2], [3][3][3], [1,2][1,2][1,2], [1,3][1,3][1,3] (two times), [2,1][2,1][2,1], [2,3][2,3][2,3], [1,2,3][1,2,3][1,2,3] and [2,1,3][2,1,3][2,1,3]."
  },
  {
    "title": "Josephus Problem I",
    "url": "https://cses.fi/problemset/task/2162",
    "description": "Consider a game where there are nnn children (numbered 1,2,…,n1,2,\\dots,n1,2,…,n) in a circle. During the game, every other child is removed from the circle until there are no children left. In which order will the children be removed? The only input line has an integer nnn. Print nnn integers: the removal order. Input: Output:"
  },
  {
    "title": "Josephus Problem II",
    "url": "https://cses.fi/problemset/task/2163",
    "description": "Consider a game where there are nnn children (numbered 1,2,…,n1,2,\\dots,n1,2,…,n) in a circle. During the game, repeatedly kkk children are skipped and one child is removed from the circle. In which order will the children be removed? The only input line has two integers nnn and kkk. Print nnn integers: the removal order. Input: Output:"
  },
  {
    "title": "Nested Ranges Check",
    "url": "https://cses.fi/problemset/task/2168",
    "description": "Given nnn ranges, your task is to determine for each range if it contains some other range and if some other range contains it. Range [a,b][a,b][a,b] contains range [c,d][c,d][c,d] if a≤ca \\le ca≤c and d≤bd \\le bd≤b. The first input line has an integer nnn: the number of ranges. After this, there are nnn lines that describe the ranges. Each line has two integers xxx and yyy: the range is [x,y][x,y][x,y]. You may assume that no range appears more than once in the input. First print a line that describes for each range (in the input order) if it contains some other range (1) or not (0). Then print a line that describes for each range (in the input order) if some other range contains it (1) or not (0). Input: Output:"
  },
  {
    "title": "Nested Ranges Count",
    "url": "https://cses.fi/problemset/task/2169",
    "description": "Given nnn ranges, your task is to count for each range how many other ranges it contains and how many other ranges contain it. Range [a,b][a,b][a,b] contains range [c,d][c,d][c,d] if a≤ca \\le ca≤c and d≤bd \\le bd≤b. The first input line has an integer nnn: the number of ranges. After this, there are nnn lines that describe the ranges. Each line has two integers xxx and yyy: the range is [x,y][x,y][x,y]. You may assume that no range appears more than once in the input. First print a line that describes for each range (in the input order) how many other ranges it contains. Then print a line that describes for each range (in the input order) how many other ranges contain it. Input: Output:"
  },
  {
    "title": "Room Allocation",
    "url": "https://cses.fi/problemset/task/1164",
    "description": "There is a large hotel, and nnn customers will arrive soon. Each customer wants to have a single room. You know each customer's arrival and departure day. Two customers can stay in the same room if the departure day of the first customer is earlier than the arrival day of the second customer. What is the minimum number of rooms that are needed to accommodate all customers? And how can the rooms be allocated? The first input line contains an integer nnn: the number of customers. Then there are nnn lines, each of which describes one customer. Each line has two integers aaa and bbb: the arrival and departure day. Print first an integer kkk: the minimum number of rooms required. After that, print a line that contains the room number of each customer in the same order as in the input. The rooms are numbered 1,2,…,k1,2,\\ldots,k1,2,…,k. You can print any valid solution. Input: Output:"
  },
  {
    "title": "Factory Machines",
    "url": "https://cses.fi/problemset/task/1620",
    "description": "A factory has nnn machines which can be used to make products. Your goal is to make a total of ttt products. For each machine, you know the number of seconds it needs to make a single product. The machines can work simultaneously, and you can freely decide their schedule. What is the shortest time needed to make ttt products? The first input line has two integers nnn and ttt: the number of machines and products. The next line has nnn integers k1,k2,…,knk_1,k_2,\\dots,k_nk1​,k2​,…,kn​: the time needed to make a product using each machine. Print one integer: the minimum time needed to make ttt products. Input: Output: Explanation: Machine 1 makes two products, machine 2 makes four products and machine 3 makes one product."
  },
  {
    "title": "Tasks and Deadlines",
    "url": "https://cses.fi/problemset/task/1630",
    "description": "You have to process nnn tasks. Each task has a duration and a deadline, and you will process the tasks in some order one after another. Your reward for a task is d−fd-fd−f where ddd is its deadline and fff is your finishing time. (The starting time is 000, and you have to process all tasks even if a task would yield negative reward.) What is your maximum reward if you act optimally? The first input line has an integer nnn: the number of tasks. After this, there are nnn lines that describe the tasks. Each line has two integers aaa and ddd: the duration and deadline of the task. Print one integer: the maximum reward. Input: Output:"
  },
  {
    "title": "Reading Books",
    "url": "https://cses.fi/problemset/task/1631",
    "description": "There are nnn books, and Kotivalo and Justiina are going to read them all. For each book, you know the time it takes to read it. They both read each book from beginning to end, and they cannot read a book at the same time. What is the minimum total time required? The first input line has an integer nnn: the number of books. The second line has nnn integers t1,t2,…,tnt_1,t_2,\\dots,t_nt1​,t2​,…,tn​: the time required to read each book. Print one integer: the minimum total time. Input: Output:"
  },
  {
    "title": "Sum of Three Values",
    "url": "https://cses.fi/problemset/task/1641",
    "description": "You are given an array of nnn integers, and your task is to find three values (at distinct positions) whose sum is xxx. The first input line has two integers nnn and xxx: the array size and the target sum. The second line has nnn integers a1,a2,…,ana_1,a_2,\\dots,a_na1​,a2​,…,an​: the array values. Print three integers: the positions of the values. If there are several solutions, you may print any of them. If there are no solutions, print IMPOSSIBLE. Input: Output:"
  },
  {
    "title": "Sum of Four Values",
    "url": "https://cses.fi/problemset/task/1642",
    "description": "You are given an array of nnn integers, and your task is to find four values (at distinct positions) whose sum is xxx. The first input line has two integers nnn and xxx: the array size and the target sum. The second line has nnn integers a1,a2,…,ana_1,a_2,\\dots,a_na1​,a2​,…,an​: the array values. Print four integers: the positions of the values. If there are several solutions, you may print any of them. If there are no solutions, print IMPOSSIBLE. Input: Output:"
  },
  {
    "title": "Nearest Smaller Values",
    "url": "https://cses.fi/problemset/task/1645",
    "description": "Given an array of nnn integers, your task is to find for each array position the nearest position to its left having a smaller value. The first input line has an integer nnn: the size of the array. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array values. Print nnn integers: for each array position the nearest position with a smaller value. If there is no such position, print 000. Input: Output:"
  },
  {
    "title": "Subarray Sums I",
    "url": "https://cses.fi/problemset/task/1660",
    "description": "Given an array of nnn positive integers, your task is to count the number of subarrays having sum xxx. The first input line has two integers nnn and xxx: the size of the array and the target sum xxx. The next line has nnn integers a1,a2,…,ana_1,a_2,\\dots,a_na1​,a2​,…,an​: the contents of the array. Print one integer: the required number of subarrays. Input: Output:"
  },
  {
    "title": "Subarray Sums II",
    "url": "https://cses.fi/problemset/task/1661",
    "description": "Given an array of nnn integers, your task is to count the number of subarrays having sum xxx. The first input line has two integers nnn and xxx: the size of the array and the target sum xxx. The next line has nnn integers a1,a2,…,ana_1,a_2,\\dots,a_na1​,a2​,…,an​: the contents of the array. Print one integer: the required number of subarrays. Input: Output:"
  },
  {
    "title": "Subarray Divisibility",
    "url": "https://cses.fi/problemset/task/1662",
    "description": "Given an array of nnn integers, your task is to count the number of subarrays where the sum of values is divisible by nnn. The first input line has an integer nnn: the size of the array. The next line has nnn integers a1,a2,…,ana_1,a_2,\\dots,a_na1​,a2​,…,an​: the contents of the array. Print one integer: the required number of subarrays. Input: Output:"
  },
  {
    "title": "Distinct Values Subarrays II",
    "url": "https://cses.fi/problemset/task/2428",
    "description": "Given an array of nnn integers, your task is to calculate the number of subarrays that have at most kkk distinct values. The first input line has two integers nnn and kkk. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the contents of the array. Print one integer: the number of subarrays. Input: Output:"
  },
  {
    "title": "Array Division",
    "url": "https://cses.fi/problemset/task/1085",
    "description": "You are given an array containing nnn positive integers. Your task is to divide the array into kkk subarrays so that the maximum sum in a subarray is as small as possible. The first input line contains two integers nnn and kkk: the size of the array and the number of subarrays in the division. The next line contains nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the contents of the array. Print one integer: the maximum sum in a subarray in the optimal division. Input: Output: Explanation: An optimal division is [2,4],[7],[3,5][2,4],[7],[3,5][2,4],[7],[3,5] where the sums of the subarrays are 6,7,86,7,86,7,8. The largest sum is the last sum 888."
  },
  {
    "title": "Movie Festival II",
    "url": "https://cses.fi/problemset/task/1632",
    "description": "In a movie festival, nnn movies will be shown. Syrjälä's movie club consists of kkk members, who will be all attending the festival. You know the starting and ending time of each movie. What is the maximum total number of movies the club members can watch entirely if they act optimally? The first input line has two integers nnn and kkk: the number of movies and club members. After this, there are nnn lines that describe the movies. Each line has two integers aaa and bbb: the starting and ending time of a movie. Print one integer: the maximum total number of movies. Input: Output:"
  },
  {
    "title": "Maximum Subarray Sum II",
    "url": "https://cses.fi/problemset/task/1644",
    "description": "Given an array of nnn integers, your task is to find the maximum sum of values in a contiguous subarray with length between aaa and bbb. The first input line has three integers nnn, aaa and bbb: the size of the array and the minimum and maximum subarray length. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array values. Print one integer: the maximum subarray sum. Input: Output:"
  },
  {
    "title": "Dice Combinations",
    "url": "https://cses.fi/problemset/task/1633",
    "description": "Your task is to count the number of ways to construct sum nnn by throwing a dice one or more times. Each throw produces an outcome between 111 and  666. For example, if n=3n=3n=3, there are 444 ways: The only input line has an integer nnn. Print the number of ways modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Minimizing Coins",
    "url": "https://cses.fi/problemset/task/1634",
    "description": "Consider a money system consisting of nnn coins. Each coin has a positive integer value. Your task is to produce a sum of money xxx using the available coins in such a way that the number of coins is minimal. For example, if the coins are {1,5,7}\\{1,5,7\\}{1,5,7} and the desired sum is 111111, an optimal solution is 5+5+15+5+15+5+1 which requires 333 coins. The first input line has two integers nnn and xxx: the number of coins and the desired sum of money. The second line has nnn distinct integers c1,c2,…,cnc_1,c_2,\\dots,c_nc1​,c2​,…,cn​: the value of each coin. Print one integer: the minimum number of coins. If it is not possible to produce the desired sum, print −1-1−1. Input: Output:"
  },
  {
    "title": "Coin Combinations I",
    "url": "https://cses.fi/problemset/task/1635",
    "description": "Consider a money system consisting of nnn coins. Each coin has a positive integer value. Your task is to calculate the number of distinct ways you can produce a money sum xxx using the available coins. For example, if the coins are {2,3,5}\\{2,3,5\\}{2,3,5} and the desired sum is 999, there are 888 ways: The first input line has two integers nnn and xxx: the number of coins and the desired sum of money. The second line has nnn distinct integers c1,c2,…,cnc_1,c_2,\\dots,c_nc1​,c2​,…,cn​: the value of each coin. Print one integer: the number of ways modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Coin Combinations II",
    "url": "https://cses.fi/problemset/task/1636",
    "description": "Consider a money system consisting of nnn coins. Each coin has a positive integer value. Your task is to calculate the number of distinct ordered ways you can produce a money sum xxx using the available coins. For example, if the coins are {2,3,5}\\{2,3,5\\}{2,3,5} and the desired sum is 999, there are 333 ways: The first input line has two integers nnn and xxx: the number of coins and the desired sum of money. The second line has nnn distinct integers c1,c2,…,cnc_1,c_2,\\dots,c_nc1​,c2​,…,cn​: the value of each coin. Print one integer: the number of ways modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Removing Digits",
    "url": "https://cses.fi/problemset/task/1637",
    "description": "You are given an integer nnn. On each step, you may subtract one of the digits from the number. How many steps are required to make the number equal to 000? The only input line has an integer nnn. Print one integer: the minimum number of steps. Input: Output: Explanation: An optimal solution is 27→20→18→10→9→027 \\rightarrow 20 \\rightarrow 18 \\rightarrow 10 \\rightarrow 9 \\rightarrow 027→20→18→10→9→0."
  },
  {
    "title": "Grid Paths I",
    "url": "https://cses.fi/problemset/task/1638",
    "description": "Consider an n×nn \\times nn×n grid whose squares may have traps. It is not allowed to move to a square with a trap. Your task is to calculate the number of paths from the upper-left square to the lower-right square. You can only move right or down. The first input line has an integer nnn: the size of the grid. After this, there are nnn lines that describe the grid. Each line has nnn characters: . denotes an empty cell, and * denotes a trap. Print the number of paths modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Book Shop",
    "url": "https://cses.fi/problemset/task/1158",
    "description": "You are in a book shop which sells nnn different books. You know the price and number of pages of each book. You have decided that the total price of your purchases will be at most xxx. What is the maximum number of pages you can buy? You can buy each book at most once. The first input line contains two integers nnn and xxx: the number of books and the maximum total price. The next line contains nnn integers h1,h2,…,hnh_1,h_2,\\ldots,h_nh1​,h2​,…,hn​: the price of each book. The last line contains nnn integers s1,s2,…,sns_1,s_2,\\ldots,s_ns1​,s2​,…,sn​: the number of pages of each book. Print one integer: the maximum number of pages. Input: Output: Explanation: You can buy books 1 and 3. Their price is 4+5=94+5=94+5=9 and the number of pages is 5+8=135+8=135+8=13."
  },
  {
    "title": "Array Description",
    "url": "https://cses.fi/problemset/task/1746",
    "description": "You know that an array has nnn integers between 111 and  mmm, and the absolute difference between two adjacent values is at most 111. Given a description of the array where some values may be unknown, your task is to count the number of arrays that match the description. The first input line has two integers nnn and mmm: the array size and the upper bound for each value. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the contents of the array. Value 000 denotes an unknown value. Print one integer: the number of arrays modulo 109+710^9+7109+7. Input: Output: Explanation: The arrays [2,1,2][2,1,2][2,1,2], [2,2,2][2,2,2][2,2,2] and [2,3,2][2,3,2][2,3,2] match the description."
  },
  {
    "title": "Counting Towers",
    "url": "https://cses.fi/problemset/task/2413",
    "description": "Your task is to build a tower whose width is 222 and height is nnn. You have an unlimited supply of blocks whose width and height are integers. For example, here are some possible solutions for n=6n=6n=6: The first input line contains an integer ttt: the number of tests. After this, there are ttt lines, and each line contains an integer nnn: the height of the tower. For each test, print the number of towers modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Edit Distance",
    "url": "https://cses.fi/problemset/task/1639",
    "description": "The edit distance between two strings is the minimum number of operations required to transform one string into the other. The allowed operations are: For example, the edit distance between LOVE and MOVIE is 2, because you can first replace L with M, and then add I. Your task is to calculate the edit distance between two strings. The first input line has a string that contains nnn characters between A–Z. The second input line has a string that contains mmm characters between A–Z. Print one integer: the edit distance between the strings. Input: Output:"
  },
  {
    "title": "Longest Common Subsequence",
    "url": "https://cses.fi/problemset/task/3403",
    "description": "Given two arrays of integers, find their longest common subsequence. A subsequence is a sequence of array elements from left to right that can contain gaps. A common subsequence is a subsequence that appears in both arrays. The first line has two integers nnn and mmm: the sizes of the arrays. The second line has nnn integers a1,a2,…,ana_1,a_2,\\dots,a_na1​,a2​,…,an​: the contents of the first array. The third line has mmm integers b1,b2,…,bmb_1,b_2,\\dots,b_mb1​,b2​,…,bm​: the contents of the second array. First print the length of the longest common subsequence. After that, print an example of such a sequence. If there are several solutions, you can print any of them. Input: Output:"
  },
  {
    "title": "Rectangle Cutting",
    "url": "https://cses.fi/problemset/task/1744",
    "description": "Given an a×ba \\times ba×b rectangle, your task is to cut it into squares. On each move you can select a rectangle and cut it into two rectangles in such a way that all side lengths remain integers. What is the minimum possible number of moves? The only input line has two integers aaa and bbb. Print one integer: the minimum number of moves. Input: Output:"
  },
  {
    "title": "Minimal Grid Path",
    "url": "https://cses.fi/problemset/task/3359",
    "description": "You are given an n×nn \\times nn×n grid whose each square contains a letter. You should move from the upper-left square to the lower-right square. You can only move right or down. What is the lexicographically minimal string you can construct? The first line has an integer nnn: the size of the grid. After this, there are nnn lines that describe the grid. Each line has nnn letters between A and Z. Print the lexicographically minimal string. Input: Output:"
  },
  {
    "title": "Money Sums",
    "url": "https://cses.fi/problemset/task/1745",
    "description": "You have nnn coins with certain values. Your task is to find all money sums you can create using these coins. The first input line has an integer nnn: the number of coins. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the values of the coins. First print an integer kkk: the number of distinct money sums. After this, print all possible sums in increasing order. Input: Output:"
  },
  {
    "title": "Removal Game",
    "url": "https://cses.fi/problemset/task/1097",
    "description": "There is a list of nnn numbers and two players who move alternately. On each move, a player removes either the first or last number from the list, and their score increases by that number. Both players try to maximize their scores. What is the maximum possible score for the first player when both players play optimally? The first input line contains an integer nnn: the size of the list. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the contents of the list. Print the maximum possible score for the first player. Input: Output:"
  },
  {
    "title": "Two Sets II",
    "url": "https://cses.fi/problemset/task/1093",
    "description": "Your task is to count the number of ways numbers 1,2,…,n1,2,\\ldots,n1,2,…,n can be divided into two sets of equal sum. For example, if n=7n=7n=7, there are four solutions: The only input line contains an integer nnn. Print the answer modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Mountain Range",
    "url": "https://cses.fi/problemset/task/3314",
    "description": "There are nnn mountains in a row, each with a specific height. You begin your hang gliding route from some mountain. You can glide from mountain aaa to mountain bbb if mountain aaa is taller than mountain bbb and all mountains between aaa and bbb. What is the maximum number of mountains you can visit on your route? The first line has an integer nnn: the number of mountains. The next line has nnn integers h1,h2,…,hnh_1, h_2,\\dots, h_nh1​,h2​,…,hn​: the heights of the mountains. Print one integer: the maximum number of mountains. Input: Output:"
  },
  {
    "title": "Increasing Subsequence",
    "url": "https://cses.fi/problemset/task/1145",
    "description": "You are given an array containing nnn integers. Your task is to determine the longest increasing subsequence in the array, i.e., the longest subsequence where every element is larger than the previous one. A subsequence is a sequence that can be derived from the array by deleting some elements without changing the order of the remaining elements. The first line contains an integer nnn: the size of the array. After this there are nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the contents of the array. Print the length of the longest increasing subsequence. Input: Output:"
  },
  {
    "title": "Projects",
    "url": "https://cses.fi/problemset/task/1140",
    "description": "There are nnn projects you can attend. For each project, you know its starting and ending days and the amount of money you would get as reward. You can only attend one project during a day. What is the maximum amount of money you can earn? The first input line contains an integer nnn: the number of projects. After this, there are nnn lines. Each such line has three integers aia_iai​, bib_ibi​, and pip_ipi​: the starting day, the ending day, and the reward. Print one integer: the maximum amount of money you can earn. Input: Output:"
  },
  {
    "title": "Elevator Rides",
    "url": "https://cses.fi/problemset/task/1653",
    "description": "There are nnn people who want to get to the top of a building which has only one elevator. You know the weight of each person and the maximum allowed weight in the elevator. What is the minimum number of elevator rides? The first input line has two integers nnn and xxx: the number of people and the maximum allowed weight in the elevator. The second line has nnn integers w1,w2,…,wnw_1,w_2,\\dots,w_nw1​,w2​,…,wn​: the weight of each person. Print one integer: the minimum number of rides. Input: Output:"
  },
  {
    "title": "Counting Tilings",
    "url": "https://cses.fi/problemset/task/2181",
    "description": "Your task is to count the number of ways you can fill an n×mn \\times mn×m grid using 1×21 \\times 21×2 and 2×12 \\times 12×1 tiles. The only input line has two integers nnn and mmm. Print one integer: the number of ways modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Counting Numbers",
    "url": "https://cses.fi/problemset/task/2220",
    "description": "Your task is to count the number of integers between aaa and bbb where no two adjacent digits are the same. The only input line has two integers aaa and bbb. Print one integer: the answer to the problem. Input: Output:"
  },
  {
    "title": "Increasing Subsequence II",
    "url": "https://cses.fi/problemset/task/1748",
    "description": "Given an array of nnn integers, your task is to calculate the number of increasing subsequences it contains. If two subsequences have the same values but in different positions in the array, they are counted separately. The first input line has an integer nnn: the size of the array. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the contents of the array. Print one integer: the number of increasing subsequences modulo 109+710^9+7109+7. Input: Output: Explanation: The increasing subsequences are [2][2][2], [1][1][1], [3][3][3], [2,3][2,3][2,3] and [1,3][1,3][1,3]."
  },
  {
    "title": "Counting Rooms",
    "url": "https://cses.fi/problemset/task/1192",
    "description": "You are given a map of a building, and your task is to count the number of its rooms. The size of the map is n×mn \\times mn×m squares, and each square is either floor or wall. You can walk left, right, up, and down through the floor squares. The first input line has two integers nnn and mmm: the height and width of the map. Then there are nnn lines of mmm characters describing the map. Each character is either . (floor) or # (wall). Print one integer: the number of rooms. Input: Output:"
  },
  {
    "title": "Labyrinth",
    "url": "https://cses.fi/problemset/task/1193",
    "description": "You are given a map of a labyrinth, and your task is to find a path from start to end. You can walk left, right, up and down. The first input line has two integers nnn and mmm: the height and width of the map. Then there are nnn lines of mmm characters describing the labyrinth. Each character is . (floor), # (wall), A (start), or B (end). There is exactly one A and one B in the input. First print \"YES\", if there is a path, and \"NO\" otherwise. If there is a path, print the length of the shortest such path and its description as a string consisting of characters L (left), R (right), U (up), and D (down). You can print any valid solution. Input: Output:"
  },
  {
    "title": "Building Roads",
    "url": "https://cses.fi/problemset/task/1666",
    "description": "Byteland has nnn cities, and mmm roads between them. The goal is to construct new roads so that there is a route between any two cities. Your task is to find out the minimum number of roads required, and also determine which roads should be built. The first input line has two integers nnn and mmm: the number of cities and roads. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After that, there are mmm lines describing the roads. Each line has two integers aaa and bbb: there is a road between those cities. A road always connects two different cities, and there is at most one road between any two cities. First print an integer kkk: the number of required roads. Then, print kkk lines that describe the new roads. You can print any valid solution. Input: Output:"
  },
  {
    "title": "Message Route",
    "url": "https://cses.fi/problemset/task/1667",
    "description": "Syrjälä's network has nnn computers and mmm connections. Your task is to find out if Uolevi can send a message to Maija, and if it is possible, what is the minimum number of computers on such a route. The first input line has two integers nnn and mmm: the number of computers and connections. The computers are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Uolevi's computer is 111 and Maija's computer is nnn. Then, there are mmm lines describing the connections. Each line has two integers aaa and bbb: there is a connection between those computers. Every connection is between two different computers, and there is at most one connection between any two computers. If it is possible to send a message, first print kkk: the minimum number of computers on a valid route. After this, print an example of such a route. You can print any valid solution. If there are no routes, print \"IMPOSSIBLE\". Input: Output:"
  },
  {
    "title": "Building Teams",
    "url": "https://cses.fi/problemset/task/1668",
    "description": "There are nnn pupils in Uolevi's class, and mmm friendships between them. Your task is to divide the pupils into two teams in such a way that no two pupils in a team are friends. You can freely choose the sizes of the teams. The first input line has two integers nnn and mmm: the number of pupils and friendships. The pupils are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Then, there are mmm lines describing the friendships. Each line has two integers aaa and bbb: pupils aaa and bbb are friends. Every friendship is between two different pupils. You can assume that there is at most one friendship between any two pupils. Print an example of how to build the teams. For each pupil, print \"1\" or \"2\" depending on to which team the pupil will be assigned. You can print any valid team. If there are no solutions, print \"IMPOSSIBLE\". Input: Output:"
  },
  {
    "title": "Round Trip",
    "url": "https://cses.fi/problemset/task/1669",
    "description": "Byteland has nnn cities and mmm roads between them. Your task is to design a round trip that begins in a city, goes through two or more other cities, and finally returns to the starting city. Every intermediate city on the route has to be distinct. The first input line has two integers nnn and mmm: the number of cities and roads. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Then, there are mmm lines describing the roads. Each line has two integers aaa and bbb: there is a road between those cities. Every road is between two different cities, and there is at most one road between any two cities. First print an integer kkk: the number of cities on the route. Then print kkk cities in the order they will be visited. You can print any valid solution. If there are no solutions, print \"IMPOSSIBLE\". Input: Output:"
  },
  {
    "title": "Monsters",
    "url": "https://cses.fi/problemset/task/1194",
    "description": "You and some monsters are in a labyrinth. When taking a step to some direction in the labyrinth, each monster may simultaneously take one as well. Your goal is to reach one of the boundary squares without ever sharing a square with a monster. Your task is to find out if your goal is possible, and if it is, print a path that you can follow. Your plan has to work in any situation; even if the monsters know your path beforehand. The first input line has two integers nnn and mmm: the height and width of the map. After this there are nnn lines of mmm characters describing the map. Each character is . (floor), # (wall), A (start), or M (monster). There is exactly one A in the input. First print \"YES\" if your goal is possible, and \"NO\" otherwise. If your goal is possible, also print an example of a valid path (the length of the path and its description using characters D, U, L, and R). You can print any path, as long as its length is at most n⋅mn \\cdot mn⋅m steps. Input: Output:"
  },
  {
    "title": "Shortest Routes I",
    "url": "https://cses.fi/problemset/task/1671",
    "description": "There are nnn cities and mmm flight connections between them. Your task is to determine the length of the shortest route from Syrjälä to every city. The first input line has two integers nnn and mmm: the number of cities and flight connections. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n, and city 111 is Syrjälä. After that, there are mmm lines describing the flight connections. Each line has three integers aaa, bbb and ccc: a flight begins at city aaa, ends at city bbb, and its length is ccc. Each flight is a one-way flight. You can assume that it is possible to travel from Syrjälä to all other cities. Print nnn integers: the shortest route lengths from Syrjälä to cities 1,2,…,n1,2,\\dots,n1,2,…,n. Input: Output:"
  },
  {
    "title": "Shortest Routes II",
    "url": "https://cses.fi/problemset/task/1672",
    "description": "There are nnn cities and mmm roads between them. Your task is to process qqq queries where you have to determine the length of the shortest route between two given cities. The first input line has three integers nnn, mmm and qqq: the number of cities, roads, and queries. Then, there are mmm lines describing the roads. Each line has three integers aaa, bbb and ccc: there is a road between cities aaa and bbb whose length is ccc. All roads are two-way roads. Finally, there are qqq lines describing the queries. Each line has two integers aaa and bbb: determine the length of the shortest route between cities aaa and bbb. Print the length of the shortest route for each query. If there is no route, print −1-1−1 instead. Input: Output:"
  },
  {
    "title": "High Score",
    "url": "https://cses.fi/problemset/task/1673",
    "description": "You play a game consisting of nnn rooms and mmm tunnels. Your initial score is 000, and each tunnel increases your score by xxx where xxx may be both positive or negative. You may go through a tunnel several times. Your task is to walk from room 111 to room nnn. What is the maximum score you can get? The first input line has two integers nnn and mmm: the number of rooms and tunnels. The rooms are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Then, there are mmm lines describing the tunnels. Each line has three integers aaa, bbb and xxx: the tunnel starts at room aaa, ends at room bbb, and it increases your score by xxx. All tunnels are one-way tunnels. You can assume that it is possible to get from room 111 to room nnn. Print one integer: the maximum score you can get. However, if you can get an arbitrarily large score, print −1-1−1. Input: Output:"
  },
  {
    "title": "Flight Discount",
    "url": "https://cses.fi/problemset/task/1195",
    "description": "Your task is to find a minimum-price flight route from Syrjälä to Metsälä. You have one discount coupon, using which you can halve the price of any single flight during the route. However, you can only use the coupon once. When you use the discount coupon for a flight whose price is xxx, its price becomes ⌊x/2⌋\\lfloor x/2 \\rfloor⌊x/2⌋ (it is rounded down to an integer). The first input line has two integers nnn and mmm: the number of cities and flight connections. The cities are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. City 1 is Syrjälä, and city nnn is Metsälä. After this there are mmm lines describing the flights. Each line has three integers aaa, bbb, and ccc: a flight begins at city aaa, ends at city bbb, and its price is ccc. Each flight is unidirectional. You can assume that it is always possible to get from Syrjälä to Metsälä. Print one integer: the price of the cheapest route from Syrjälä to Metsälä. Input: Output:"
  },
  {
    "title": "Cycle Finding",
    "url": "https://cses.fi/problemset/task/1197",
    "description": "You are given a directed graph, and your task is to find out if it contains a negative cycle, and also give an example of such a cycle. The first input line has two integers nnn and mmm: the number of nodes and edges. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. After this, the input has mmm lines describing the edges. Each line has three integers aaa, bbb, and ccc: there is an edge from node aaa to node bbb whose length is ccc. If the graph contains a negative cycle, print first \"YES\", and then the nodes in the cycle in their correct order. If there are several negative cycles, you can print any of them. If there are no negative cycles, print \"NO\". Input: Output:"
  },
  {
    "title": "Flight Routes",
    "url": "https://cses.fi/problemset/task/1196",
    "description": "Your task is to find the kkk shortest flight routes from Syrjälä to Metsälä. A route can visit the same city several times. Note that there can be several routes with the same price and each of them should be considered (see the example). The first input line has three integers nnn, mmm, and kkk: the number of cities, the number of flights, and the parameter kkk. The cities are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. City 1 is Syrjälä, and city nnn is Metsälä. After this, the input has mmm lines describing the flights. Each line has three integers aaa, bbb, and ccc: a flight begins at city aaa, ends at city bbb, and its price is ccc. All flights are one-way flights. You may assume that there are at least kkk distinct routes from Syrjälä to Metsälä. Print kkk integers: the prices of the kkk cheapest routes sorted according to their prices. Input: Output: Explanation: The cheapest routes are 1→3→41 \\rightarrow 3 \\rightarrow 41→3→4 (price 444), 1→2→3→41 \\rightarrow 2 \\rightarrow 3 \\rightarrow 41→2→3→4 (price 444) and 1→2→41 \\rightarrow 2 \\rightarrow 41→2→4 (price 777)."
  },
  {
    "title": "Round Trip II",
    "url": "https://cses.fi/problemset/task/1678",
    "description": "Byteland has nnn cities and mmm flight connections. Your task is to design a round trip that begins in a city, goes through one or more other cities, and finally returns to the starting city. Every intermediate city on the route has to be distinct. The first input line has two integers nnn and mmm: the number of cities and flights. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Then, there are mmm lines describing the flights. Each line has two integers aaa and bbb: there is a flight connection from city aaa to city bbb. All connections are one-way flights from a city to another city. First print an integer kkk: the number of cities on the route. Then print kkk cities in the order they will be visited. You can print any valid solution. If there are no solutions, print \"IMPOSSIBLE\". Input: Output:"
  },
  {
    "title": "Course Schedule",
    "url": "https://cses.fi/problemset/task/1679",
    "description": "You have to complete nnn courses. There are mmm requirements of the form \"course aaa has to be completed before course bbb\". Your task is to find an order in which you can complete the courses. The first input line has two integers nnn and mmm: the number of courses and requirements. The courses are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines describing the requirements. Each line has two integers aaa and bbb: course aaa has to be completed before course bbb. Print an order in which you can complete the courses. You can print any valid order that includes all the courses. If there are no solutions, print \"IMPOSSIBLE\". Input: Output:"
  },
  {
    "title": "Longest Flight Route",
    "url": "https://cses.fi/problemset/task/1680",
    "description": "Uolevi has won a contest, and the prize is a free flight trip that can consist of one or more flights through cities. Of course, Uolevi wants to choose a trip that has as many cities as possible. Uolevi wants to fly from Syrjälä to Lehmälä so that he visits the maximum number of cities. You are given the list of possible flights, and you know that there are no directed cycles in the flight network. The first input line has two integers nnn and mmm: the number of cities and flights. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. City 111 is Syrjälä, and city nnn is Lehmälä. After this, there are mmm lines describing the flights. Each line has two integers aaa and bbb: there is a flight from city aaa to city bbb. Each flight is a one-way flight. First print the maximum number of cities on the route. After this, print the cities in the order they will be visited. You can print any valid solution. If there are no solutions, print \"IMPOSSIBLE\". Input: Output:"
  },
  {
    "title": "Game Routes",
    "url": "https://cses.fi/problemset/task/1681",
    "description": "A game has nnn levels, connected by mmm teleporters, and your task is to get from level 111 to level nnn. The game has been designed so that there are no directed cycles in the underlying graph. In how many ways can you complete the game? The first input line has two integers nnn and mmm: the number of levels and teleporters. The levels are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines describing the teleporters. Each line has two integers aaa and bbb: there is a teleporter from level aaa to level bbb. Print one integer: the number of ways you can complete the game. Since the result may be large, print it modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Investigation",
    "url": "https://cses.fi/problemset/task/1202",
    "description": "You are going to travel from Syrjälä to Lehmälä by plane. You would like to find answers to the following questions: The first input line contains two integers nnn and mmm: the number of cities and the number of flights. The cities are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. City 1 is Syrjälä, and city nnn is Lehmälä. After this, there are mmm lines describing the flights. Each line has three integers aaa, bbb, and ccc: there is a flight from city aaa to city bbb with price ccc. All flights are one-way flights. You may assume that there is a route from Syrjälä to Lehmälä. Print four integers according to the problem statement. Input: Output:"
  },
  {
    "title": "Planets Queries I",
    "url": "https://cses.fi/problemset/task/1750",
    "description": "You are playing a game consisting of nnn planets. Each planet has a teleporter to another planet (or the planet itself). Your task is to process qqq queries of the form: when you begin on planet xxx and travel through kkk teleporters, which planet will you reach? The first input line has two integers nnn and qqq: the number of planets and queries. The planets are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The second line has nnn integers t1,t2,…,tnt_1,t_2,\\dots,t_nt1​,t2​,…,tn​: for each planet, the destination of the teleporter. It is possible that ti=it_i=iti​=i. Finally, there are qqq lines describing the queries. Each line has two integers xxx and kkk: you start on planet xxx and travel through kkk teleporters. Print the answer to each query. Input: Output:"
  },
  {
    "title": "Planets Queries II",
    "url": "https://cses.fi/problemset/task/1160",
    "description": "You are playing a game consisting of n planets. Each planet has a teleporter to another planet (or the planet itself). You have to process qqq queries of the form: You are now on planet aaa and want to reach planet bbb. What is the minimum number of teleportations? The first input line contains two integers nnn and qqq: the number of planets and queries. The planets are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. The second line contains nnn integers t1,t2,…,tnt_1,t_2,\\ldots,t_nt1​,t2​,…,tn​: for each planet, the destination of the teleporter. Finally, there are qqq lines describing the queries. Each line has two integers aaa and bbb: you are now on planet aaa and want to reach planet bbb. For each query, print the minimum number of teleportations. If it is not possible to reach the destination, print −1-1−1. Input: Output:"
  },
  {
    "title": "Planets Cycles",
    "url": "https://cses.fi/problemset/task/1751",
    "description": "You are playing a game consisting of nnn planets. Each planet has a teleporter to another planet (or the planet itself). You start on a planet and then travel through teleporters until you reach a planet that you have already visited before. Your task is to calculate for each planet the number of teleportations there would be if you started on that planet. The first input line has an integer nnn: the number of planets. The planets are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The second line has nnn integers t1,t2,…,tnt_1,t_2,\\dots,t_nt1​,t2​,…,tn​: for each planet, the destination of the teleporter. It is possible that ti=it_i=iti​=i. Print nnn integers according to the problem statement. Input: Output:"
  },
  {
    "title": "Road Reparation",
    "url": "https://cses.fi/problemset/task/1675",
    "description": "There are nnn cities and mmm roads between them. Unfortunately, the condition of the roads is so poor that they cannot be used. Your task is to repair some of the roads so that there will be a decent route between any two cities. For each road, you know its reparation cost, and you should find a solution where the total cost is as small as possible. The first input line has two integers nnn and mmm: the number of cities and roads. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Then, there are mmm lines describing the roads. Each line has three integers aaa, bbb and ccc: there is a road between cities aaa and bbb, and its reparation cost is ccc. All roads are two-way roads. Every road is between two different cities, and there is at most one road between two cities. Print one integer: the minimum total reparation cost. However, if there are no solutions, print \"IMPOSSIBLE\". Input: Output:"
  },
  {
    "title": "Road Construction",
    "url": "https://cses.fi/problemset/task/1676",
    "description": "There are nnn cities and initially no roads between them. However, every day a new road will be constructed, and there will be a total of mmm roads. A component is a group of cities where there is a route between any two cities using the roads. After each day, your task is to find the number of components and the size of the largest component. The first input line has two integers nnn and mmm: the number of cities and roads. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Then, there are mmm lines describing the new roads. Each line has two integers aaa and bbb: a new road is constructed between cities aaa and bbb. You may assume that every road will be constructed between two different cities. Print mmm lines: the required information after each day. Input: Output:"
  },
  {
    "title": "Flight Routes Check",
    "url": "https://cses.fi/problemset/task/1682",
    "description": "There are nnn cities and mmm flight connections. Your task is to check if you can travel from any city to any other city using the available flights. The first input line has two integers nnn and mmm: the number of cities and flights. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines describing the flights. Each line has two integers aaa and bbb: there is a flight from city aaa to city bbb. All flights are one-way flights. Print \"YES\" if all routes are possible, and \"NO\" otherwise. In the latter case also print two cities aaa and bbb such that you cannot travel from city aaa to city bbb. If there are several possible solutions, you can print any of them. Input: Output:"
  },
  {
    "title": "Planets and Kingdoms",
    "url": "https://cses.fi/problemset/task/1683",
    "description": "A game has nnn planets, connected by mmm teleporters. Two planets aaa and bbb belong to the same kingdom exactly when there is a route both from aaa to bbb and from bbb to aaa. Your task is to determine for each planet its kingdom. The first input line has two integers nnn and mmm: the number of planets and teleporters. The planets are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines describing the teleporters. Each line has two integers aaa and bbb: you can travel from planet aaa to planet bbb through a teleporter. First print an integer kkk: the number of kingdoms. After this, print for each planet a kingdom label between 111 and kkk. You can print any valid solution. Input: Output:"
  },
  {
    "title": "Giant Pizza",
    "url": "https://cses.fi/problemset/task/1684",
    "description": "Uolevi's family is going to order a large pizza and eat it together. A total of nnn family members will join the order, and there are mmm possible toppings. The pizza may have any number of toppings. Each family member gives two wishes concerning the toppings of the pizza. The wishes are of the form \"topping xxx is good/bad\". Your task is to choose the toppings so that at least one wish from everybody becomes true (a good topping is included in the pizza or a bad topping is not included). The first input line has two integers nnn and mmm: the number of family members and toppings. The toppings are numbered 1,2,…,m1,2,\\dots,m1,2,…,m. After this, there are nnn lines describing the wishes. Each line has two wishes of the form \"+ xxx\" (topping xxx is good) or \"- xxx\" (topping xxx is bad). Print a line with mmm symbols: for each topping \"+\" if it is included and \"-\" if it is not included. You can print any valid solution. If there are no valid solutions, print \"IMPOSSIBLE\". Input: Output:"
  },
  {
    "title": "Coin Collector",
    "url": "https://cses.fi/problemset/task/1686",
    "description": "A game has nnn rooms and mmm tunnels between them. Each room has a certain number of coins. What is the maximum number of coins you can collect while moving through the tunnels when you can freely choose your starting and ending room? The first input line has two integers nnn and mmm: the number of rooms and tunnels. The rooms are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Then, there are nnn integers k1,k2,…,knk_1,k_2,\\ldots,k_nk1​,k2​,…,kn​: the number of coins in each room. Finally, there are mmm lines describing the tunnels. Each line has two integers aaa and bbb: there is a tunnel from room aaa to room bbb. Each tunnel is a one-way tunnel. Print one integer: the maximum number of coins you can collect. Input: Output:"
  },
  {
    "title": "Mail Delivery",
    "url": "https://cses.fi/problemset/task/1691",
    "description": "Your task is to deliver mail to the inhabitants of a city. For this reason, you want to find a route whose starting and ending point are the post office, and that goes through every street exactly once. The first input line has two integers nnn and mmm: the number of crossings and streets. The crossings are numbered 1, 2,…, n1,\\,2,\\ldots,\\,n1,2,…,n, and the post office is located at crossing 111. After that, there are m lines describing the streets. Each line has two integers aaa and bbb: there is a street between crossings aaa and bbb. All streets are two-way streets. Every street is between two different crossings, and there is at most one street between two crossings. Print all the crossings on the route in the order you will visit them. You can print any valid solution. If there are no solutions, print \"IMPOSSIBLE\". 2≤n≤1052\\leq n\\leq 10^52≤n≤105\n1≤m≤2⋅1051\\leq m\\leq 2 \\cdot 10^51≤m≤2⋅105\n1≤a, b≤n1\\leq a,\\,b\\leq n1≤a,b≤n Input: Output:"
  },
  {
    "title": "De Bruijn Sequence",
    "url": "https://cses.fi/problemset/task/1692",
    "description": "Your task is to construct a minimum-length bit string that contains all possible substrings of length nnn. For example, when n=2n=2n=2, the string 00110 is a valid solution, because its substrings of length 222 are 00, 01, 10 and 11. The only input line has an integer nnn. Print a minimum-length bit string that contains all substrings of length nnn. You can print any valid solution. Input: Output:"
  },
  {
    "title": "Teleporters Path",
    "url": "https://cses.fi/problemset/task/1693",
    "description": "A game has nnn levels and mmm teleportes between them. You win the game if you move from level 111 to level nnn using every teleporter exactly once. Can you win the game, and what is a possible way to do it? The first input line has two integers nnn and mmm: the number of levels and teleporters. The levels are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Then, there are mmm lines describing the teleporters. Each line has two integers aaa and bbb: there is a teleporter from level aaa to level bbb. You can assume that each pair (a,b)(a,b)(a,b) in the input is distinct. Print m+1m+1m+1 integers: the sequence in which you visit the levels during the game. You can print any valid solution. If there are no solutions, print \"IMPOSSIBLE\". Input: Output:"
  },
  {
    "title": "Hamiltonian Flights",
    "url": "https://cses.fi/problemset/task/1690",
    "description": "There are nnn cities and mmm flight connections between them. You want to travel from Syrjälä to Lehmälä so that you visit each city exactly once. How many possible routes are there? The first input line has two integers nnn and mmm: the number of cities and flights. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. City 111 is Syrjälä, and city nnn is Lehmälä. Then, there are mmm lines describing the flights. Each line has two integers aaa and bbb: there is a flight from city aaa to city bbb. All flights are one-way flights. Print one integer: the number of routes modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Knight's Tour",
    "url": "https://cses.fi/problemset/task/1689",
    "description": "Given a starting position of a knight on an 8×88 \\times 88×8 chessboard, your task is to find a sequence of moves such that it visits every square exactly once. On each move, the knight may either move two steps horizontally and one step vertically, or one step horizontally and two steps vertically. The only line has two integers xxx and yyy: the knight's starting position. Print a grid that shows how the knight moves (according to the example). You can print any valid solution. Input: Output:"
  },
  {
    "title": "Download Speed",
    "url": "https://cses.fi/problemset/task/1694",
    "description": "Consider a network consisting of nnn computers and mmm connections. Each connection specifies how fast a computer can send data to another computer. Kotivalo wants to download some data from a server. What is the maximum speed he can do this, using the connections in the network? The first input line has two integers nnn and mmm: the number of computers and connections. The computers are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Computer 111 is the server and computer nnn is Kotivalo's computer. After this, there are mmm lines describing the connections. Each line has three integers aaa, bbb and ccc: computer aaa can send data to computer bbb at speed ccc. Print one integer: the maximum speed Kotivalo can download data. Input: Output:"
  },
  {
    "title": "Police Chase",
    "url": "https://cses.fi/problemset/task/1695",
    "description": "Kaaleppi has just robbed a bank and is now heading to the harbor. However, the police wants to stop him by closing some streets of the city. What is the minimum number of streets that should be closed so that there is no route between the bank and the harbor? The first input line has two integers nnn and mmm: the number of crossings and streets. The crossings are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The bank is located at crossing 111, and the harbor is located at crossing nnn. After this, there are mmm lines that describing the streets. Each line has two integers aaa and bbb: there is a street between crossings aaa and bbb. All streets are two-way streets, and there is at most one street between two crossings. First print an integer kkk: the minimum number of streets that should be closed. After this, print kkk lines describing the streets. You can print any valid solution. Input: Output:"
  },
  {
    "title": "School Dance",
    "url": "https://cses.fi/problemset/task/1696",
    "description": "There are nnn boys and mmm girls in a school. Next week a school dance will be organized. A dance pair consists of a boy and a girl, and there are kkk potential pairs. Your task is to find out the maximum number of dance pairs and show how this number can be achieved. The first input line has three integers nnn, mmm and kkk: the number of boys, girls, and potential pairs. The boys are numbered 1,2,…,n1,2,\\dots,n1,2,…,n, and the girls are numbered 1,2,…,m1,2,\\dots,m1,2,…,m. After this, there are kkk lines describing the potential pairs. Each line has two integers aaa and bbb: boy aaa and girl bbb are willing to dance together. First print one integer rrr: the maximum number of dance pairs. After this, print rrr lines describing the pairs. You can print any valid solution. Input: Output:"
  },
  {
    "title": "Distinct Routes",
    "url": "https://cses.fi/problemset/task/1711",
    "description": "A game consists of nnn rooms and mmm teleporters. At the beginning of each day, you start in room 111 and you have to reach room nnn. You can use each teleporter at most once during the game. How many days can you play if you choose your routes optimally? The first input line has two integers nnn and mmm: the number of rooms and teleporters. The rooms are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines describing the teleporters. Each line has two integers aaa and bbb: there is a teleporter from room aaa to room bbb. There are no two teleporters whose starting and ending room are the same. First print an integer kkk: the maximum number of days you can play the game. Then, print kkk route descriptions according to the example. You can print any valid solution. Input: Output:"
  },
  {
    "title": "Static Range Sum Queries",
    "url": "https://cses.fi/problemset/task/1646",
    "description": "Given an array of nnn integers, your task is to process qqq queries of the form: what is the sum of values in range [a,b][a,b][a,b]? The first input line has two integers nnn and qqq: the number of values and queries. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array values. Finally, there are qqq lines describing the queries. Each line has two integers aaa and bbb: what is the sum of values in range [a,b][a,b][a,b]? Print the result of each query. Input: Output:"
  },
  {
    "title": "Static Range Minimum Queries",
    "url": "https://cses.fi/problemset/task/1647",
    "description": "Given an array of nnn integers, your task is to process qqq queries of the form: what is the minimum value in range [a,b][a,b][a,b]? The first input line has two integers nnn and qqq: the number of values and queries. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array values. Finally, there are qqq lines describing the queries. Each line has two integers aaa and bbb: what is the minimum value in range [a,b][a,b][a,b]? Print the result of each query. Input: Output:"
  },
  {
    "title": "Dynamic Range Sum Queries",
    "url": "https://cses.fi/problemset/task/1648",
    "description": "Given an array of nnn integers, your task is to process qqq queries of the following types: The first input line has two integers nnn and qqq: the number of values and queries. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array values. Finally, there are qqq lines describing the queries. Each line has three integers: either \"111 kkk uuu\" or \"222 aaa bbb\". Print the result of each query of type 2. Input: Output:"
  },
  {
    "title": "Dynamic Range Minimum Queries",
    "url": "https://cses.fi/problemset/task/1649",
    "description": "Given an array of nnn integers, your task is to process qqq queries of the following types: The first input line has two integers nnn and qqq: the number of values and queries. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array values. Finally, there are qqq lines describing the queries. Each line has three integers: either \"111 kkk uuu\" or \"222 aaa bbb\". Print the result of each query of type 2. Input: Output:"
  },
  {
    "title": "Range Xor Queries",
    "url": "https://cses.fi/problemset/task/1650",
    "description": "Given an array of nnn integers, your task is to process qqq queries of the form: what is the xor sum of values in range [a,b][a,b][a,b]? The first input line has two integers nnn and qqq: the number of values and queries. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array values. Finally, there are qqq lines describing the queries. Each line has two integers aaa and bbb: what is the xor sum of values in range [a,b][a,b][a,b]? Print the result of each query. Input: Output:"
  },
  {
    "title": "Range Update Queries",
    "url": "https://cses.fi/problemset/task/1651",
    "description": "Given an array of nnn integers, your task is to process qqq queries of the following types: The first input line has two integers nnn and qqq: the number of values and queries. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array values. Finally, there are qqq lines describing the queries. Each line has three integers: either \"111 aaa bbb uuu\" or \"222 kkk\". Print the result of each query of type 2. Input: Output:"
  },
  {
    "title": "Forest Queries",
    "url": "https://cses.fi/problemset/task/1652",
    "description": "You are given an n×nn \\times nn×n grid representing the map of a forest. Each square is either empty or contains a tree. The upper-left square has coordinates (1,1)(1,1)(1,1), and the lower-right square has coordinates (n,n)(n,n)(n,n). Your task is to process qqq queries of the form: how many trees are inside a given rectangle in the forest? The first input line has two integers nnn and qqq: the size of the forest and the number of queries. Then, there are nnn lines describing the forest. Each line has nnn characters: . is an empty square and * is a tree. Finally, there are qqq lines describing the queries. Each line has four integers y1y_1y1​, x1x_1x1​, y2y_2y2​, x2x_2x2​ corresponding to the corners of a rectangle. Print the number of trees inside each rectangle. Input: Output:"
  },
  {
    "title": "Hotel Queries",
    "url": "https://cses.fi/problemset/task/1143",
    "description": "There are nnn hotels on a street. For each hotel you know the number of free rooms. Your task is to assign hotel rooms for groups of tourists. All members of a group want to stay in the same hotel. The groups will come to you one after another, and you know for each group the number of rooms it requires. You always assign a group to the first hotel having enough rooms. After this, the number of free rooms in the hotel decreases. The first input line contains two integers nnn and mmm: the number of hotels and the number of groups. The hotels are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. The next line contains nnn integers h1,h2,…,hnh_1,h_2,\\ldots,h_nh1​,h2​,…,hn​: the number of free rooms in each hotel. The last line contains mmm integers r1,r2,…,rmr_1,r_2,\\ldots,r_mr1​,r2​,…,rm​: the number of rooms each group requires. Print the assigned hotel for each group. If a group cannot be assigned a hotel, print 0 instead. Input: Output:"
  },
  {
    "title": "List Removals",
    "url": "https://cses.fi/problemset/task/1749",
    "description": "You are given a list consisting of nnn integers. Your task is to remove elements from the list at given positions, and report the removed elements. The first input line has an integer nnn: the initial size of the list. During the process, the elements are numbered 1,2,…,k1,2,\\dots,k1,2,…,k where kkk is the current size of the list. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the contents of the list. The last line has nnn integers p1,p2,…,pnp_1,p_2,\\dots,p_np1​,p2​,…,pn​: the positions of the elements to be removed. Print the elements in the order they are removed. Input: Output: Explanation: The contents of the list are [2,6,1,4,2][2,6,1,4,2][2,6,1,4,2], [2,6,4,2][2,6,4,2][2,6,4,2], [6,4,2][6,4,2][6,4,2], [6,4][6,4][6,4], [4][4][4] and [][][]."
  },
  {
    "title": "Salary Queries",
    "url": "https://cses.fi/problemset/task/1144",
    "description": "A company has nnn employees with certain salaries. Your task is to keep track of the salaries and process queries. The first input line contains two integers nnn and qqq: the number of employees and queries. The employees are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. The next line has nnn integers p1,p2,…,pnp_1,p_2,\\ldots,p_np1​,p2​,…,pn​: each employee's salary. After this, there are qqq lines describing the queries. Each line has one of the following forms: Print the answer to each ? query. Input: Output:"
  },
  {
    "title": "Prefix Sum Queries",
    "url": "https://cses.fi/problemset/task/2166",
    "description": "Given an array of nnn integers, your task is to process qqq queries of the following types: The first input line has two integers nnn and qqq: the number of values and queries. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array values. Finally, there are qqq lines describing the queries. Each line has three integers: either \"111 kkk uuu\" or \"222 aaa bbb\". Print the result of each query of type 2. Input: Output:"
  },
  {
    "title": "Pizzeria Queries",
    "url": "https://cses.fi/problemset/task/2206",
    "description": "There are nnn buildings on a street, numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Each building has a pizzeria and an apartment. The pizza price in building kkk is pkp_kpk​. If you order a pizza from building aaa to building bbb, its price (with delivery) is pa+∣a−b∣p_a+|a-b|pa​+∣a−b∣. Your task is to process two types of queries: The first input line has two integers nnn and qqq: the number of buildings and queries. The second line has nnn integers p1,p2,…,pnp_1,p_2,\\dots,p_np1​,p2​,…,pn​: the initial pizza price in each building. Finally, there are qqq lines that describe the queries. Each line is either \"1 kkk xxx\" or \"2 kkk\". Print the answer for each query of type 2. Input: Output:"
  },
  {
    "title": "Visible Buildings Queries",
    "url": "https://cses.fi/problemset/task/3304",
    "description": "There are nnn buildings in a row numbered 1,2,…,n1, 2,\\dots, n1,2,…,n from left to right. You are standing to the left of the first building. You can see a building if it is taller than any building to its left. Your task is to process qqq queries: If only buildings in range [a,b][a, b][a,b] existed, how many buildings would you see? The first line has two integers nnn and qqq: the number of buildings and queries. The second line has nnn integers h1,h2,…,hnh_1, h_2, \\dots, h_nh1​,h2​,…,hn​: the heights of the buildings. Finally, there are qqq lines describing the queries. Each line has two integers aaa and bbb. For each query, print one integer: the number of visible buildings. Input: Output:"
  },
  {
    "title": "Range Interval Queries",
    "url": "https://cses.fi/problemset/task/3163",
    "description": "Given an array xxx of nnn integers, your task is to process qqq queries of the form: how many integers iii satisfy a≤i≤ba \\le i \\le ba≤i≤b and c≤xi≤dc \\le x_i \\le dc≤xi​≤d? The first line has two integers nnn and qqq: the number of values and queries. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array values. Finally, there are qqq lines describing the queries. Each line has four integers aaa, bbb, ccc and ddd: how many integers iii satisfy a≤i≤ba \\le i \\le ba≤i≤b and c≤xi≤dc \\le x_i \\le dc≤xi​≤d? Print the result of each query. Input: Output:"
  },
  {
    "title": "Subarray Sum Queries",
    "url": "https://cses.fi/problemset/task/1190",
    "description": "There is an array consisting of nnn integers. Some values of the array will be updated, and after each update, your task is to report the maximum subarray sum in the array. The first input line contains integers nnn and mmm: the size of the array and the number of updates. The array is indexed 1,2,…,n1,2,\\ldots,n1,2,…,n. The next line has nnn integers: x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the initial contents of the array. Then there are mmm lines describing the changes. Each line has two integers kkk and xxx: the value at position kkk becomes xxx. After each update, print the maximum subarray sum. Empty subarrays (with sum 000) are allowed. Input: Output:"
  },
  {
    "title": "Subarray Sum Queries II",
    "url": "https://cses.fi/problemset/task/3226",
    "description": "You are given an array of nnn integers and qqq queries. In each query, your task is to calculate the maximum subarray sum in the range [a,b][a,b][a,b]. Empty subarrays (with sum 000) are allowed. The first line contains two integers nnn and qqq: the number of elements and the number of queries. Then there are nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the contents of the array. Finally there are qqq lines that describe the queries. Each line has two integers aaa and bbb. Print the answer for each query. Input: Output:"
  },
  {
    "title": "Distinct Values Queries",
    "url": "https://cses.fi/problemset/task/1734",
    "description": "You are given an array of nnn integers and qqq queries of the form: how many distinct values are there in a range [a,b][a,b][a,b]? The first input line has two integers nnn and qqq: the array size and number of queries. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array values. Finally, there are qqq lines describing the queries. Each line has two integers aaa and bbb. For each query, print the number of distinct values in the range. Input: Output:"
  },
  {
    "title": "Distinct Values Queries II",
    "url": "https://cses.fi/problemset/task/3356",
    "description": "Given an array of nnn integers, your task is to process qqq queries of the following types: The first line has two integers nnn and qqq: the number of values and queries. The second line has nnn integers x1,x2,…,xnx_1, x_2,\\dots, x_nx1​,x2​,…,xn​: the array values. Finally, there are qqq lines describing the queries. Each line has three integers: either \"111 kkk uuu\" or \"222 aaa bbb\". For each query of type 2, print YES if every value in the range is distinct and NO otherwise. Input: Output:"
  },
  {
    "title": "Increasing Array Queries",
    "url": "https://cses.fi/problemset/task/2416",
    "description": "You are given an array that consists of nnn integers. The array elements are indexed 1,2,…,n1,2,\\dots,n1,2,…,n. You can modify the array using the following operation: choose an array element and increase its value by one. Your task is to process qqq queries of the form: when we consider a subarray from position aaa to position bbb, what is the minimum number of operations after which the subarray is increasing? An array is increasing if each element is greater than or equal with the previous element. The first input line has two integers nnn and qqq: the size of the array and the number of queries. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the contents of the array. Finally, there are qqq lines that describe the queries. Each line has two integers aaa and bbb: the starting and ending position of a subarray. For each query, print the minimum number of operations. Input: Output:"
  },
  {
    "title": "Movie Festival Queries",
    "url": "https://cses.fi/problemset/task/1664",
    "description": "In a movie festival, nnn movies will be shown. You know the starting and ending time of each movie. Your task is to process qqq queries of the form: if you arrive and leave the festival at specific times, what is the maximum number of movies you can watch? You can watch two movies if the first movie ends before or exactly when the second movie starts. You can start the first movie exactly when you arrive and leave exactly when the last movie ends. The first input line has two integers nnn and qqq: the number of movies and queries. After this, there are nnn lines describing the movies. Each line has two integers aaa and bbb: the starting and ending time of a movie. Finally, there are qqq lines describing the queries. Each line has two integers aaa and bbb: your arrival and leaving time. Print the maximum number of movies for each query. Input: Output:"
  },
  {
    "title": "Forest Queries II",
    "url": "https://cses.fi/problemset/task/1739",
    "description": "You are given an n×nn \\times nn×n grid representing the map of a forest. Each square is either empty or has a tree. Your task is to process qqq queries of the following types: The first input line has two integers nnn and qqq: the size of the forest and the number of queries. Then, there are nnn lines describing the forest. Each line has nnn characters: . is an empty square and * is a tree. Finally, there are qqq lines describing the queries. The format of each line is either \"111 yyy xxx\" or \"2 y1y_1y1​ x1x_1x1​ y2y_2y2​ x2x_2x2​\". Print the answer to each query of the second type. Input: Output:"
  },
  {
    "title": "Range Updates and Sums",
    "url": "https://cses.fi/problemset/task/1735",
    "description": "Your task is to maintain an array of nnn values and efficiently process the following types of queries: The first input line has two integers nnn and qqq: the array size and the number of queries. The next line has nnn values t1,t2,…,tnt_1,t_2,\\dots,t_nt1​,t2​,…,tn​: the initial contents of the array. Finally, there are qqq lines describing the queries. The format of each line is one of the following: \"1 aaa bbb xxx\",  \"2 aaa bbb xxx\", or \"3 aaa bbb\". Print the answer to each sum query. Input: Output:"
  },
  {
    "title": "Polynomial Queries",
    "url": "https://cses.fi/problemset/task/1736",
    "description": "Your task is to maintain an array of nnn values and efficiently process the following types of queries: The first input line has two integers nnn and qqq: the size of the array and the number of queries. The next line has nnn values t1,t2,…,tnt_1,t_2,\\dots,t_nt1​,t2​,…,tn​: the initial contents of the array. Finally, there are qqq lines describing the queries. The format of each line is either \"1 aaa bbb\" or \"2 aaa bbb\". Print the answer to each sum query. Input: Output:"
  },
  {
    "title": "Range Queries and Copies",
    "url": "https://cses.fi/problemset/task/1737",
    "description": "Your task is to maintain a list of arrays which initially has a single array. You have to process the following types of queries: The first input line has two integers nnn and qqq: the array size and the number of queries. The next line has nnn integers t1,t2,…,tnt_1,t_2,\\ldots,t_nt1​,t2​,…,tn​: the initial contents of the array. Finally, there are qqq lines describing the queries. The format of each line is one of the following: \"1 kkk aaa xxx\", \"2 kkk aaa bbb\" or \"3 kkk\". Print the answer to each sum query. Input: Output:"
  },
  {
    "title": "Missing Coin Sum Queries",
    "url": "https://cses.fi/problemset/task/2184",
    "description": "You have nnn coins with positive integer values. The coins are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Your task is to process qqq queries of the form: \"if you can use coins a…ba \\dots ba…b, what is the smallest sum you cannot produce?\" The first input line has two integers nnn and qqq: the number of coins and queries. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the value of each coin. Finally, there are qqq lines that describe the queries. Each line has two values aaa and bbb: you can use coins a…ba \\dots ba…b. Print the answer for each query. Input: Output: Explanation: First you can use coins [9,1,2][9,1,2][9,1,2], then coins [2][2][2] and finally coins [2,9,1,2,7][2,9,1,2,7][2,9,1,2,7]."
  },
  {
    "title": "Subordinates",
    "url": "https://cses.fi/problemset/task/1674",
    "description": "Given the structure of a company, your task is to calculate for each employee the number of their subordinates. The first input line has an integer nnn: the number of employees. The employees are numbered 1,2,…,n1,2,\\dots,n1,2,…,n, and employee 111 is the general director of the company. After this, there are n−1n-1n−1 integers: for each employee 2,3,…,n2,3,\\dots,n2,3,…,n their direct boss in the company. Print nnn integers: for each employee 1,2,…,n1,2,\\dots,n1,2,…,n the number of their subordinates. Input: Output:"
  },
  {
    "title": "Tree Matching",
    "url": "https://cses.fi/problemset/task/1130",
    "description": "You are given a tree consisting of nnn nodes. A matching is a set of edges where each node is an endpoint of at most one edge. What is the maximum number of edges in a matching? The first input line contains an integer nnn: the number of nodes. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. Then there are n−1n-1n−1 lines describing the edges. Each line contains two integers aaa and bbb: there is an edge between nodes aaa and bbb. Print one integer: the maximum number of pairs. Input: Output: Explanation: One possible matching is (1,2)(1,2)(1,2) and (3,4)(3,4)(3,4)."
  },
  {
    "title": "Tree Diameter",
    "url": "https://cses.fi/problemset/task/1131",
    "description": "You are given a tree consisting of nnn nodes. The diameter of a tree is the maximum distance between two nodes. Your task is to determine the diameter of the tree. The first input line contains an integer nnn: the number of nodes. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. Then there are n−1n-1n−1 lines describing the edges. Each line contains two integers aaa and bbb: there is an edge between nodes aaa and bbb. Print one integer: the diameter of the tree. Input: Output: Explanation: The diameter corresponds to the path 2→1→3→52 \\rightarrow 1 \\rightarrow 3 \\rightarrow 52→1→3→5."
  },
  {
    "title": "Tree Distances I",
    "url": "https://cses.fi/problemset/task/1132",
    "description": "You are given a tree consisting of nnn nodes. Your task is to determine for each node the maximum distance to another node. The first input line contains an integer nnn: the number of nodes. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. Then there are n−1n-1n−1 lines describing the edges. Each line contains two integers aaa and bbb: there is an edge between nodes aaa and bbb. Print nnn integers: for each node 1,2,…,n1,2,\\ldots,n1,2,…,n, the maximum distance to another node. Input: Output:"
  },
  {
    "title": "Tree Distances II",
    "url": "https://cses.fi/problemset/task/1133",
    "description": "You are given a tree consisting of nnn nodes. Your task is to determine for each node the sum of the distances from the node to all other nodes. The first input line contains an integer nnn: the number of nodes. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. Then there are n−1n-1n−1 lines describing the edges. Each line contains two integers aaa and bbb: there is an edge between nodes aaa and bbb. Print nnn integers: for each node 1,2,…,n1,2,\\ldots,n1,2,…,n, the sum of the distances. Input: Output:"
  },
  {
    "title": "Company Queries I",
    "url": "https://cses.fi/problemset/task/1687",
    "description": "A company has nnn employees, who form a tree hierarchy where each employee has a boss, except for the general director. Your task is to process qqq queries of the form: who is employee xxx's boss kkk levels higher up in the hierarchy? The first input line has two integers nnn and qqq: the number of employees and queries. The employees are numbered 1,2,…,n1,2,\\dots,n1,2,…,n, and employee 111 is the general director. The next line has n−1n-1n−1 integers e2,e3,…,ene_2,e_3,\\dots,e_ne2​,e3​,…,en​: for each employee 2,3,…,n2,3,\\dots,n2,3,…,n their boss. Finally, there are qqq lines describing the queries. Each line has two integers xxx and kkk: who is employee xxx's boss kkk levels higher up? Print the answer for each query. If such a boss does not exist, print −1-1−1. Input: Output:"
  },
  {
    "title": "Company Queries II",
    "url": "https://cses.fi/problemset/task/1688",
    "description": "A company has nnn employees, who form a tree hierarchy where each employee has a boss, except for the general director. Your task is to process qqq queries of the form: who is the lowest common boss of employees aaa and bbb in the hierarchy? The first input line has two integers nnn and qqq: the number of employees and queries. The employees are numbered 1,2,…,n1,2,\\dots,n1,2,…,n, and employee 111 is the general director. The next line has n−1n-1n−1 integers e2,e3,…,ene_2,e_3,\\dots,e_ne2​,e3​,…,en​: for each employee 2,3,…,n2,3,\\dots,n2,3,…,n their boss. Finally, there are qqq lines describing the queries. Each line has two integers aaa and bbb: who is the lowest common boss of employees aaa and bbb? Print the answer for each query. Input: Output:"
  },
  {
    "title": "Distance Queries",
    "url": "https://cses.fi/problemset/task/1135",
    "description": "You are given a tree consisting of nnn nodes. Your task is to process qqq queries of the form: what is the distance between nodes aaa and bbb? The first input line contains two integers nnn and qqq: the number of nodes and queries. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. Then there are n−1n-1n−1 lines describing the edges. Each line contains two integers aaa and bbb: there is an edge between nodes aaa and bbb. Finally, there are qqq lines describing the queries. Each line contains two integer aaa and bbb: what is the distance between nodes aaa and bbb? Print qqq integers: the answer to each query. Input: Output:"
  },
  {
    "title": "Counting Paths",
    "url": "https://cses.fi/problemset/task/1136",
    "description": "You are given a tree consisting of nnn nodes, and mmm paths in the tree. Your task is to calculate for each node the number of paths containing that node. The first input line contains integers nnn and mmm: the number of nodes and paths. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. Then there are n−1n-1n−1 lines describing the edges. Each line contains two integers aaa and bbb: there is an edge between nodes aaa and bbb. Finally, there are mmm lines describing the paths. Each line contains two integers aaa and bbb: there is a path between nodes aaa and bbb. Print nnn integers: for each node 1,2,…,n1,2,\\ldots,n1,2,…,n, the number of paths containing that node. Input: Output:"
  },
  {
    "title": "Subtree Queries",
    "url": "https://cses.fi/problemset/task/1137",
    "description": "You are given a rooted tree consisting of nnn nodes. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n, and node 111 is the root. Each node has a value. Your task is to process following types of queries: The first input line contains two integers nnn and qqq: the number of nodes and queries. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. The next line has nnn integers v1,v2,…,vnv_1,v_2,\\ldots,v_nv1​,v2​,…,vn​: the value of each node. Then there are n−1n-1n−1 lines describing the edges. Each line contans two integers aaa and bbb: there is an edge between nodes aaa and bbb. Finally, there are qqq lines describing the queries. Each query is either of the form \"1 sss xxx\" or \"2 sss\". Print the answer to each query of type 2. Input: Output:"
  },
  {
    "title": "Path Queries",
    "url": "https://cses.fi/problemset/task/1138",
    "description": "You are given a rooted tree consisting of nnn nodes. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n, and node 111 is the root. Each node has a value. Your task is to process following types of queries: The first input line contains two integers nnn and qqq: the number of nodes and queries. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. The next line has nnn integers v1,v2,…,vnv_1,v_2,\\ldots,v_nv1​,v2​,…,vn​: the value of each node. Then there are n−1n-1n−1 lines describing the edges. Each line contains two integers aaa and bbb: there is an edge between nodes aaa and bbb. Finally, there are qqq lines describing the queries. Each query is either of the form \"1 sss xxx\" or \"2 sss\". Print the answer to each query of type 2. Input: Output:"
  },
  {
    "title": "Path Queries II",
    "url": "https://cses.fi/problemset/task/2134",
    "description": "You are given a tree consisting of nnn nodes. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. Each node has a value. Your task is to process following types of queries: The first input line contains two integers nnn and qqq: the number of nodes and queries. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. The next line has nnn integers v1,v2,…,vnv_1,v_2,\\ldots,v_nv1​,v2​,…,vn​: the value of each node. Then there are n−1n-1n−1 lines describing the edges. Each line contains two integers aaa and bbb: there is an edge between nodes aaa and bbb. Finally, there are qqq lines describing the queries. Each query is either of the form \"1 sss xxx\" or \"2 aaa bbb\". Print the answer to each query of type 2. Input: Output:"
  },
  {
    "title": "Distinct Colors",
    "url": "https://cses.fi/problemset/task/1139",
    "description": "You are given a rooted tree consisting of nnn nodes. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n, and node 111 is the root. Each node has a color. Your task is to determine for each node the number of distinct colors in the subtree of the node. The first input line contains an integer nnn: the number of nodes. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. The next line consists of nnn integers c1,c2,…,cnc_1,c_2,\\ldots,c_nc1​,c2​,…,cn​: the color of each node. Then there are n−1n-1n−1 lines describing the edges. Each line contains two integers aaa and bbb: there is an edge between nodes aaa and bbb. Print nnn integers: for each node 1,2,…,n1,2,\\ldots,n1,2,…,n, the number of distinct colors. Input: Output:"
  },
  {
    "title": "Finding a Centroid",
    "url": "https://cses.fi/problemset/task/2079",
    "description": "Given a tree of nnn nodes, your task is to find a centroid, i.e., a node such that when it is appointed the root of the tree, each subtree has at most ⌊n/2⌋\\lfloor n/2 \\rfloor⌊n/2⌋ nodes. The first input line contains an integer nnn: the number of nodes. The nodes are numbered 1,2,…,n1,2,…,n1,2,…,n. Then there are n−1n-1n−1 lines describing the edges. Each line contains two integers aaa and bbb: there is an edge between nodes aaa and bbb. Print one integer: a centroid node. If there are several possibilities, you can choose any of them. Input: Output:"
  },
  {
    "title": "Fixed-Length Paths I",
    "url": "https://cses.fi/problemset/task/2080",
    "description": "Given a tree of nnn nodes, your task is to count the number of distinct paths that consist of exactly kkk edges. The first input line contains two integers nnn and kkk: the number of nodes and the path length. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. Then there are n−1n-1n−1 lines describing the edges. Each line contains two integers aaa and bbb: there is an edge between nodes aaa and bbb. Print one integer: the number of paths. Input: Output:"
  },
  {
    "title": "Fixed-Length Paths II",
    "url": "https://cses.fi/problemset/task/2081",
    "description": "Given a tree of nnn nodes, your task is to count the number of distinct paths that have at least k1k_1k1​ and at most k2k_2k2​ edges. The first input line contains three integers nnn, k1k_1k1​ and k2k_2k2​: the number of nodes and the path lengths. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. Then there are n−1n-1n−1 lines describing the edges. Each line contains two integers aaa and bbb: there is an edge between nodes aaa and bbb. Print one integer: the number of paths. Input: Output:"
  },
  {
    "title": "Josephus Queries",
    "url": "https://cses.fi/problemset/task/2164",
    "description": "Consider a game where there are nnn children (numbered 1,2,…,n1,2,\\dots,n1,2,…,n) in a circle. During the game, every second child is removed from the circle, until there are no children left. Your task is to process qqq queries of the form: \"when there are nnn children, who is the kkkth child that will be removed?\" The first input line has an integer qqq: the number of queries. After this, there are qqq lines that describe the queries. Each line has two integers nnn and kkk: the number of children and the position of the child. Print qqq integers: the answer for each query. Input: Output:"
  },
  {
    "title": "Exponentiation",
    "url": "https://cses.fi/problemset/task/1095",
    "description": "Your task is to efficiently calculate values aba^bab modulo 109+710^9+7109+7. Note that in this task we assume that 00=10^0=100=1. The first input line contains an integer nnn: the number of calculations. After this, there are nnn lines, each containing two integers aaa and bbb. Print each value aba^bab modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Exponentiation II",
    "url": "https://cses.fi/problemset/task/1712",
    "description": "Your task is to efficiently calculate values abca^{b^c}abc modulo 109+710^9+7109+7. Note that in this task we assume that 00=10^0=100=1. The first input line has an integer nnn: the number of calculations. After this, there are nnn lines, each containing three integers aaa, bbb and ccc. Print each value abca^{b^c}abc modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Counting Divisors",
    "url": "https://cses.fi/problemset/task/1713",
    "description": "Given nnn integers, your task is to report for each integer the number of its divisors. For example, if x=18x=18x=18, the correct answer is 666 because its divisors are 1,2,3,6,9,181,2,3,6,9,181,2,3,6,9,18. The first input line has an integer nnn: the number of integers. After this, there are nnn lines, each containing an integer xxx. For each integer, print the number of its divisors. Input: Output:"
  },
  {
    "title": "Common Divisors",
    "url": "https://cses.fi/problemset/task/1081",
    "description": "You are given an array of nnn positive integers. Your task is to find two integers such that their greatest common divisor is as large as possible. The first input line has an integer nnn: the size of the array. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the contents of the array. Print the maximum greatest common divisor. Input: Output:"
  },
  {
    "title": "Sum of Divisors",
    "url": "https://cses.fi/problemset/task/1082",
    "description": "Let σ(n)\\sigma(n)σ(n) denote the sum of divisors of an integer nnn. For example, σ(12)=1+2+3+4+6+12=28\\sigma(12)=1+2+3+4+6+12=28σ(12)=1+2+3+4+6+12=28. Your task is to calculate the sum ∑i=1nσ(i)\\sum_{i=1}^n \\sigma(i)∑i=1n​σ(i) modulo 109+710^9+7109+7. The only input line has an integer nnn. Print ∑i=1nσ(i)\\sum_{i=1}^n \\sigma(i)∑i=1n​σ(i) modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Divisor Analysis",
    "url": "https://cses.fi/problemset/task/2182",
    "description": "Given an integer, your task is to find the number, sum and product of its divisors. As an example, let us consider the number 121212: Since the input number may be large, it is given as a prime factorization. The first line has an integer nnn: the number of parts in the prime factorization. After this, there are nnn lines that describe the factorization. Each line has two numbers xxx and kkk where xxx is a prime and kkk is its power. Print three integers modulo 109+710^9+7109+7: the number, sum and product of the divisors. Input: Output:"
  },
  {
    "title": "Prime Multiples",
    "url": "https://cses.fi/problemset/task/2185",
    "description": "You are given kkk distinct prime numbers a1,a2,…,aka_1,a_2,\\ldots,a_ka1​,a2​,…,ak​ and an integer nnn. Your task is to calculate how many of the first nnn positive integers are divisible by at least one of the given prime numbers. The first input line has two integers nnn and kkk. The second line has kkk prime numbers a1,a2,…,aka_1,a_2,\\ldots,a_ka1​,a2​,…,ak​. Print one integer: the number integers within the interval 1,2,…,n1,2,\\ldots,n1,2,…,n that are divisible by at least one of the prime numbers. Input: Output: Explanation: the 121212 numbers are 2,4,5,6,8,10,12,14,15,16,18,202,4,5,6,8,10,12,14,15,16,18,202,4,5,6,8,10,12,14,15,16,18,20."
  },
  {
    "title": "Counting Coprime Pairs",
    "url": "https://cses.fi/problemset/task/2417",
    "description": "Given a list of nnn positive integers, your task is to count the number of pairs of integers that are coprime (i.e., their greatest common divisor is one). The first input line has an integer nnn: the number of elements. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the contents of the list. Print one integer: the answer for the task. Input: Output:"
  },
  {
    "title": "Next Prime",
    "url": "https://cses.fi/problemset/task/3396",
    "description": "Given a positive integer nnn, find the next prime number after it. The first line has an integer ttt: the number of tests. After that, each line has a positive integer nnn. For each test, print the next prime after nnn. Input: Output:"
  },
  {
    "title": "Binomial Coefficients",
    "url": "https://cses.fi/problemset/task/1079",
    "description": "Your task is to calculate nnn binomial coefficients modulo 109+710^9+7109+7. A binomial coefficient (ab){a \\choose b}(ba​) can be calculated using the formula a!b!(a−b)!\\frac{a!}{b!(a-b)!}b!(a−b)!a!​. We assume that aaa and bbb are integers and 0≤b≤a0 \\le b \\le a0≤b≤a. The first input line contains an integer nnn: the number of calculations. After this, there are nnn lines, each of which contains two integers aaa and bbb. Print each binomial coefficient modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Creating Strings II",
    "url": "https://cses.fi/problemset/task/1715",
    "description": "Given a string, your task is to calculate the number of different strings that can be created using its characters. The only input line has a string of length nnn. Each character is between a–z. Print the number of different strings modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Distributing Apples",
    "url": "https://cses.fi/problemset/task/1716",
    "description": "There are nnn children and mmm apples that will be distributed to them. Your task is to count the number of ways this can be done. For example, if n=3n=3n=3 and m=2m=2m=2, there are 666 ways: [0,0,2][0,0,2][0,0,2], [0,1,1][0,1,1][0,1,1], [0,2,0][0,2,0][0,2,0], [1,0,1][1,0,1][1,0,1], [1,1,0][1,1,0][1,1,0] and [2,0,0][2,0,0][2,0,0]. The only input line has two integers nnn and mmm. Print the number of ways modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Christmas Party",
    "url": "https://cses.fi/problemset/task/1717",
    "description": "There are nnn children at a Christmas party, and each of them has brought a gift. The idea is that everybody will get a gift brought by someone else. In how many ways can the gifts be distributed? The only input line has an integer nnn: the number of children. Print the number of ways modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Permutation Order",
    "url": "https://cses.fi/problemset/task/3397",
    "description": "Let p(n,k)p(n,k)p(n,k) denote the kkkth permutation (in lexicographical order) of 1…n1 \\dots n1…n. For example, p(4,1)=[1,2,3,4]p(4,1)=[1,2,3,4]p(4,1)=[1,2,3,4] and p(4,2)=[1,2,4,3]p(4,2)=[1,2,4,3]p(4,2)=[1,2,4,3]. Your task is to process two types of tests: The first line has an integer ttt: the number of tests. Each test is either \"1 nnn kkk\" or \"2 nnn p(n,k)p(n,k)p(n,k)\". For each test, print the answer according to the example. Input: Output:"
  },
  {
    "title": "Permutation Rounds",
    "url": "https://cses.fi/problemset/task/3398",
    "description": "There is a sorted array [1,2,…,n][1,2,\\dots,n][1,2,…,n] and a permutation p1,p2,…,pnp_1,p_2,\\dots,p_np1​,p2​,…,pn​. On each round, all elements move according to the permutation: the element at position iii moves to position pip_ipi​. After how many rounds is the array sorted again for the first time? The first line has an integer nnn. The next line contains nnn integers p1,p2,…,pnp_1,p_2,\\dots,p_np1​,p2​,…,pn​. Print the number of rounds modulo 109+710^9+7109+7. Input: Output: Explanation: The array changes as follows after the rounds:"
  },
  {
    "title": "Bracket Sequences I",
    "url": "https://cses.fi/problemset/task/2064",
    "description": "Your task is to calculate the number of valid bracket sequences of length nnn. For example, when n=6n=6n=6, there are 555 sequences: The only input line has an integer nnn. Print the number of sequences modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Bracket Sequences II",
    "url": "https://cses.fi/problemset/task/2187",
    "description": "Your task is to calculate the number of valid bracket sequences of length nnn when a prefix of the sequence is given. The first input line has an integer nnn. The second line has a string of kkk characters: the prefix of the sequence. Print the number of sequences modulo 109+710^9+7109+7. Input: Output: Explanation: There are two possible sequences: (())() and (()())."
  },
  {
    "title": "Counting Necklaces",
    "url": "https://cses.fi/problemset/task/2209",
    "description": "Your task is to count the number of different necklaces that consist of nnn pearls and each pearl has mmm possible colors. Two necklaces are considered to be different if it is not possible to rotate one of them so that they look the same. The only input line has two numbers nnn and mmm: the number of pearls and colors. Print one integer: the number of different necklaces modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Counting Grids",
    "url": "https://cses.fi/problemset/task/2210",
    "description": "Your task is to count the number of different n×nn \\times nn×n grids whose each square is black or white. Two grids are considered to be different if it is not possible to rotate one of them so that they look the same. The only input line has an integer nnn: the size of the grid. Print one integer: the number of grids modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Fibonacci Numbers",
    "url": "https://cses.fi/problemset/task/1722",
    "description": "The Fibonacci numbers can be defined as follows: Your task is to calculate the value of FnF_nFn​ for a given nnn. The only input line has an integer nnn. Print the value of FnF_nFn​ modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Throwing Dice",
    "url": "https://cses.fi/problemset/task/1096",
    "description": "Your task is to calculate the number of ways to get a sum nnn by throwing dice. Each throw yields an integer between 1…61 \\ldots 61…6. For example, if n=10n=10n=10, some possible ways are 3+3+43+3+43+3+4, 1+4+1+41+4+1+41+4+1+4 and 1+1+6+1+11+1+6+1+11+1+6+1+1. The only input line contains an integer nnn. Print the number of ways modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Graph Paths I",
    "url": "https://cses.fi/problemset/task/1723",
    "description": "Consider a directed graph that has nnn nodes and mmm edges. Your task is to count the number of paths from node 111 to node nnn with exactly kkk edges. The first input line contains three integers nnn, mmm and kkk: the number of nodes and edges, and the length of the path. The nodes are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Then, there are mmm lines describing the edges. Each line contains two integers aaa and bbb: there is an edge from node aaa to node bbb. Print the number of paths modulo 109+710^9+7109+7. Input: Output: Explanation: The paths are 1→2→3→1→2→3→1→2→31 \\rightarrow 2 \\rightarrow 3 \\rightarrow 1 \\rightarrow 2 \\rightarrow 3 \\rightarrow 1 \\rightarrow 2 \\rightarrow 31→2→3→1→2→3→1→2→3 and 1→2→3→2→3→2→3→2→31 \\rightarrow 2 \\rightarrow 3 \\rightarrow 2 \\rightarrow 3 \\rightarrow 2 \\rightarrow 3 \\rightarrow 2 \\rightarrow 31→2→3→2→3→2→3→2→3."
  },
  {
    "title": "Graph Paths II",
    "url": "https://cses.fi/problemset/task/1724",
    "description": "Consider a directed weighted graph having nnn nodes and mmm edges. Your task is to calculate the minimum path length from node 111 to node nnn with exactly kkk edges. The first input line contains three integers nnn, mmm and kkk: the number of nodes and edges, and the length of the path. The nodes are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Then, there are m lines describing the edges. Each line contains three integers aaa, bbb and ccc: there is an edge from node aaa to node bbb with weight ccc. Print the minimum path length. If there are no such paths, print −1-1−1. Input: Output:"
  },
  {
    "title": "System of Linear Equations",
    "url": "https://cses.fi/problemset/task/3154",
    "description": "You are given n⋅(m+1)n\\cdot(m+1)n⋅(m+1) coefficients ai,ja_{i,j}ai,j​ and bib_ibi​ which form the following nnn linear equations: Your task is to find any mmm integers x1,x2,…,xmx_1, x_2, \\dots, x_mx1​,x2​,…,xm​  that satisfy the given equations. The first line has two integers nnn and mmm: the number of equations and variables. The next nnn lines each have m+1m+1m+1 integers ai,1,ai,2,…,ai,m,bia_{i,1}, a_{i,2}, \\dots, a_{i,m}, b_iai,1​,ai,2​,…,ai,m​,bi​: the coefficients of the iii-th equation. Print mmm integers x1,x2,…,xmx_1, x_2,\\dots, x_mx1​,x2​,…,xm​: the values of the variables that satisfy the equations. The values must also satisfy 0≤xi<109+70 \\le x_i < 10^9 + 70≤xi​<109+7. You can print any valid solution. If no solution exists print only −1-1−1. Input: Output:"
  },
  {
    "title": "Sum of Four Squares",
    "url": "https://cses.fi/problemset/task/3355",
    "description": "A well known result in number theory is that every non-negative integer can be represented as the sum of four squares of non-negative integers. You are given a non-negative integer nnn. Your task is to find four non-negative integers aaa, bbb, ccc and ddd such that n=a2+b2+c2+d2n = a^2 + b^2 + c^2 + d^2n=a2+b2+c2+d2. The first line has an integer ttt: the number of test cases. Each of the next ttt lines has an integer nnn. For each test case, print four non-negative integers aaa, bbb, ccc and ddd that satisfy n=a2+b2+c2+d2n = a^2 + b^2 + c^2 + d^2n=a2+b2+c2+d2. Input: Output:"
  },
  {
    "title": "Triangle Number Sums",
    "url": "https://cses.fi/problemset/task/3406",
    "description": "A triangle number is a positive integer of the form 1+2+⋯+k1+2+\\dots+k1+2+⋯+k. The first triangle numbers are 111, 333, 666, 101010 and 151515. Every positive integer can be represented as a sum of triangle numbers. For example, 42=21+2142=21+2142=21+21 and 1337=1326+10+11337=1326+10+11337=1326+10+1. Given a positive integer nnn, determine the smallest number of triangle numbers that sum to nnn. The first line has an integer ttt: the number of tests. After that, each line has a positive integer nnn. For each test, print the smallest number of triangle numbers. Input: Output:"
  },
  {
    "title": "Dice Probability",
    "url": "https://cses.fi/problemset/task/1725",
    "description": "You throw a dice nnn times, and every throw produces an outcome between 111 and 666. What is the probability that the sum of outcomes is between aaa and bbb? The only input line contains three integers nnn, aaa and bbb. Print the probability rounded to six decimal places (rounding half to even). Input: Output:"
  },
  {
    "title": "Moving Robots",
    "url": "https://cses.fi/problemset/task/1726",
    "description": "Each square of an 8×88 \\times 88×8 chessboard has a robot. Each robot independently moves kkk steps, and there can be many robots on the same square. On each turn, a robot moves one step left, right, up or down, but not outside the board. It randomly chooses a direction among those where it can move. Your task is to calculate the expected number of empty squares after kkk turns. The only input line has an integer kkk. Print the expected number of empty squares rounded to six decimal places (rounding half to even). Input: Output:"
  },
  {
    "title": "Candy Lottery",
    "url": "https://cses.fi/problemset/task/1727",
    "description": "There are nnn children, and each of them independently gets a random integer number of candies between 111 and kkk. What is the expected maximum number of candies a child gets? The only input line contains two integers nnn and kkk. Print the expected number rounded to six decimal places (rounding half to even). Input: Output:"
  },
  {
    "title": "Inversion Probability",
    "url": "https://cses.fi/problemset/task/1728",
    "description": "An array has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​, and each of them has been randomly chosen between 111 and rir_iri​. An inversion is a pair (a,b)(a,b)(a,b) where a<ba<ba<b and xa>xbx_a>x_bxa​>xb​. What is the expected number of inversions in the array? The first input line contains an integer nnn: the size of the array. The second line contains nnn integers r1,r2,…,rnr_1,r_2,\\dots,r_nr1​,r2​,…,rn​: the range of possible values for each array position. Print the expected number of inversions rounded to six decimal places (rounding half to even). Input: Output:"
  },
  {
    "title": "Stick Game",
    "url": "https://cses.fi/problemset/task/1729",
    "description": "Consider a game where two players remove sticks from a heap. The players move alternately, and the player who removes the last stick wins the game. A set P={p1,p2,…,pk}P=\\{p_1,p_2,\\ldots,p_k\\}P={p1​,p2​,…,pk​} determines the allowed moves. For example, if P={1,3,4}P=\\{1,3,4\\}P={1,3,4}, a player may remove 111, 333 or 444 sticks. Your task is find out for each number of sticks 1,2,…,n1,2,\\dots,n1,2,…,n if the first player has a winning or losing position. The first input line has two integers nnn and kkk: the number of sticks and moves. The next line has kkk integers p1,p2,…,pkp_1,p_2,\\dots,p_kp1​,p2​,…,pk​ that describe the allowed moves. All integers are distinct, and one of them is 111. Print a string containing nnn characters: W means a winning position, and L means a losing position. Input: Output:"
  },
  {
    "title": "Nim Game I",
    "url": "https://cses.fi/problemset/task/1730",
    "description": "There are nnn heaps of sticks and two players who move alternately. On each move, a player chooses a non-empty heap and removes any number of sticks. The player who removes the last stick wins the game. Your task is to find out who wins if both players play optimally. The first input line contains an integer ttt: the number of tests. After this, ttt test cases are described: The first line contains an integer nnn: the number of heaps. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the number of sticks in each heap. For each test case, print \"first\" if the first player wins the game and \"second\" if the second player wins the game. Input: Output:"
  },
  {
    "title": "Nim Game II",
    "url": "https://cses.fi/problemset/task/1098",
    "description": "There are nnn heaps of sticks and two players who move alternately. On each move, a player chooses a non-empty heap and removes 111, 222, or 333 sticks. The player who removes the last stick wins the game. Your task is to find out who wins if both players play optimally. The first input line contains an integer ttt: the number of tests. After this, ttt test cases are described: The first line contains an integer nnn: the number of heaps. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the number of sticks in each heap. For each test case, print \"first\" if the first player wins the game and \"second\" if the second player wins the game. Input: Output:"
  },
  {
    "title": "Stair Game",
    "url": "https://cses.fi/problemset/task/1099",
    "description": "There is a staircase consisting of nnn stairs, numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. Initially, each stair has some number of balls. There are two players who move alternately. On each move, a player chooses a stair kkk where k≠1k \\neq 1k=1 and it has at least one ball. Then, the player moves any number of balls from stair kkk to stair k−1k-1k−1. The player who moves last wins the game. Your task is to find out who wins the game when both players play optimally. Note that if there are no possible moves at all, the second player wins. The first input line has an integer ttt: the number of tests. After this, ttt test cases are described: The first line contains an integer nnn: the number of stairs. The next line has nnn integers p1,p2,…,pnp_1,p_2,\\ldots,p_np1​,p2​,…,pn​: the initial number of balls on each stair. For each test, print \"first\" if the first player wins the game and \"second\" if the second player wins the game. Input: Output:"
  },
  {
    "title": "Grundy's Game",
    "url": "https://cses.fi/problemset/task/2207",
    "description": "There is a heap of nnn coins and two players who move alternately. On each move, a player chooses a heap and divides into two nonempty heaps that have a different number of coins. The player who makes the last move wins the game. Your task is to find out who wins if both players play optimally. The first input line contains an integer ttt: the number of tests. After this, there are ttt lines that describe the tests. Each line has an integer nnn: the number of coins in the initial heap. For each test case, print \"first\" if the first player wins the game and \"second\" if the second player wins the game. Input: Output:"
  },
  {
    "title": "Another Game",
    "url": "https://cses.fi/problemset/task/2208",
    "description": "There are nnn heaps of coins and two players who move alternately. On each move, a player selects some of the nonempty heaps and removes one coin from each heap. The player who removes the last coin wins the game. Your task is to find out who wins if both players play optimally. The first input line contains an integer ttt: the number of tests. After this, ttt test cases are described: The first line contains an integer nnn: the number of heaps. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the number of coins in each heap. For each test case, print \"first\" if the first player wins the game and \"second\" if the second player wins the game. Input: Output:"
  },
  {
    "title": "Word Combinations",
    "url": "https://cses.fi/problemset/task/1731",
    "description": "You are given a string of length nnn and a dictionary containing kkk words. In how many ways can you create the string using the words? The first input line has a string containing nnn characters between a–z. The second line has an integer kkk: the number of words in the dictionary. Finally there are kkk lines describing the words. Each word is unique and consists of characters a–z. Print the number of ways modulo 109+710^9+7109+7. Input: Output: Explanation: The possible ways are ab+ab+c and abab+c."
  },
  {
    "title": "String Matching",
    "url": "https://cses.fi/problemset/task/1753",
    "description": "Given a string and a pattern, your task is to count the number of positions where the pattern occurs in the string. The first input line has a string of length nnn, and the second input line has a pattern of length mmm. Both of them consist of characters a–z. Print one integer: the number of occurrences. Input: Output:"
  },
  {
    "title": "Finding Borders",
    "url": "https://cses.fi/problemset/task/1732",
    "description": "A border of a string is a prefix that is also a suffix of the string but not the whole string. For example, the borders of abcababcab are ab and abcab. Your task is to find all border lengths of a given string. The only input line has a string of length nnn consisting of characters a–z. Print all border lengths of the string in increasing order. Input: Output:"
  },
  {
    "title": "Finding Periods",
    "url": "https://cses.fi/problemset/task/1733",
    "description": "A period of a string is a prefix that can be used to generate the whole string by repeating the prefix. The last repetition may be partial. For example, the periods of abcabca are abc, abcabc and abcabca. Your task is to find all period lengths of a string. The only input line has a string of length nnn consisting of characters a–z. Print all period lengths in increasing order. Input: Output:"
  },
  {
    "title": "Minimal Rotation",
    "url": "https://cses.fi/problemset/task/1110",
    "description": "A rotation of a string can be generated by moving characters one after another from beginning to end. For example, the rotations of acab are acab, caba, abac, and baca. Your task is to determine the lexicographically minimal rotation of a string. The only input line contains a string of length nnn. Each character is one of a–z. Print the lexicographically minimal rotation. Input: Output:"
  },
  {
    "title": "Longest Palindrome",
    "url": "https://cses.fi/problemset/task/1111",
    "description": "Given a string, your task is to determine the longest palindromic substring of the string. For example, the longest palindrome in aybabtu is bab. The only input line contains a string of length nnn. Each character is one of a–z. Print the longest palindrome in the string. If there are several solutions, you may print any of them. Input: Output:"
  },
  {
    "title": "All Palindromes",
    "url": "https://cses.fi/problemset/task/3138",
    "description": "Given a string, calculate for each position the length of the longest palindrome that ends at that position. The only line contains a string of length nnn. Each character is one of a–z. Print nnn numbers: the length of each palindrome. Input: Output:"
  },
  {
    "title": "Required Substring",
    "url": "https://cses.fi/problemset/task/1112",
    "description": "Your task is to calculate the number of strings of length nnn having a given pattern of length mmm as their substring. All strings consist of characters A–Z. The first input line has an integer nnn: the length of the final string. The second line has a pattern of length mmm. Print the number of strings modulo 109+710^9+7109+7. Input: Output: Explanation: The final string will be of the form ABCDBxxx or xxxABCDB where xxx is any character between A–Z."
  },
  {
    "title": "Palindrome Queries",
    "url": "https://cses.fi/problemset/task/2420",
    "description": "You are given a string that consists of nnn characters between a–z. The positions of the string are indexed 1,2,…,n1,2,\\dots,n1,2,…,n. Your task is to process mmm operations of the following types: The first input line has two integers nnn and mmm: the length of the string and the number of operations. The next line has a string that consists of nnn characters. Finally, there are mmm lines that describe the operations. Each line is of the form \"1 kkk xxx\" or \"2 aaa bbb\". For each operation 2, print YES if the substring is a palindrome and NO otherwise. Input: Output:"
  },
  {
    "title": "Finding Patterns",
    "url": "https://cses.fi/problemset/task/2102",
    "description": "Given a string and patterns, check for each pattern if it appears in the string. The first input line has a string of length nnn. The next input line has an integer kkk: the number of patterns. Finally, there are kkk lines that describe the patterns. The string and the patterns consist of characters a–z. For each pattern, print \"YES\" if it appears in the string and \"NO\" otherwise. Input: Output:"
  },
  {
    "title": "Counting Patterns",
    "url": "https://cses.fi/problemset/task/2103",
    "description": "Given a string and patterns, count for each pattern the number of positions where it appears in the string. The first input line has a string of length nnn. The next input line has an integer kkk: the number of patterns. Finally, there are kkk lines that describe the patterns. The string and the patterns consist of characters a–z. For each pattern, print the number of positions. Input: Output:"
  },
  {
    "title": "Pattern Positions",
    "url": "https://cses.fi/problemset/task/2104",
    "description": "Given a string and patterns, find for each pattern the first position (1-indexed) where it appears in the string. The first input line has a string of length nnn. The next input line has an integer kkk: the number of patterns. Finally, there are kkk lines that describe the patterns. The string and the patterns consist of characters a–z. Print the first position for each pattern (or −1-1−1 if it does not appear at all). Input: Output:"
  },
  {
    "title": "Distinct Substrings",
    "url": "https://cses.fi/problemset/task/2105",
    "description": "Count the number of distinct substrings that appear in a string. The only input line has a string of length nnn that consists of characters a–z. Print one integer: the number of substrings. Input: Output: Explanation: the substrings are a, b, aa, ab, ba, aba, baa and abaa."
  },
  {
    "title": "Distinct Subsequences",
    "url": "https://cses.fi/problemset/task/1149",
    "description": "You are given a string. You can remove any number of characters from it, but you cannot change the order of the remaining characters. How many different strings can you generate? The first input line contains a string of size nnn. Each character is one of a–z. Print one integer: the number of strings modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Repeating Substring",
    "url": "https://cses.fi/problemset/task/2106",
    "description": "A repeating substring is a substring that occurs in two (or more) locations in the string. Your task is to find the longest repeating substring in a given string. The only input line has a string of length nnn that consists of characters a–z. Print the longest repeating substring. If there are several possibilities, you can print any of them. If there is no repeating substring, print −1-1−1. Input: Output:"
  },
  {
    "title": "String Functions",
    "url": "https://cses.fi/problemset/task/2107",
    "description": "We consider a string of nnn characters, indexed 1,2,…,n1,2,\\dots,n1,2,…,n. Your task is to calculate all values of the following functions: Note that the function zzz is used in the Z-algorithm, and the function π\\piπ is used in the KMP algorithm. The only input line has a string of length nnn. Each character is between a–z. Print two lines: first the values of the zzz function, and then the values of the π\\piπ function. Input: Output:"
  },
  {
    "title": "Inverse Suffix Array",
    "url": "https://cses.fi/problemset/task/3225",
    "description": "Given a suffix array of a string, your task is to reconstruct the string. The suffix array of a string of length nnn is a permutation of numbers 1,2,…,n1,2,\\dots,n1,2,…,n that presents the lexicographical order of the suffixes. The first line has an integer nnn: the length of the string. The next line has nnn integers: the suffix array. Print a string that corresponds to the suffix array. The string must consist of characters a–z. If there are several possible strings, you can print any of them. If no string corresponds to the suffix array, print −1-1−1. Input: Output:"
  },
  {
    "title": "String Transform",
    "url": "https://cses.fi/problemset/task/1113",
    "description": "Consider the following string transformation: For example, the string babc becomes babc#. Then, the sorted list of rotations is #babc, abc#b, babc#, bc#ba, and c#bab. This yields a string cb#ab. The only input line contains the transformed string of length n+1n+1n+1. Each character of the original string is one of a–z. Print the original string of length nnn. Input: Output:"
  },
  {
    "title": "Substring Order I",
    "url": "https://cses.fi/problemset/task/2108",
    "description": "You are given a string of length nnn. If all of its distinct substrings are ordered lexicographically, what is the kkkth smallest of them? The first input line has a string of length nnn that consists of characters a–z. The second input line has an integer kkk. Print the kkkth smallest distinct substring in lexicographical order. Input: Output: Explanation: The 10 smallest distinct substrings in order are a, aa, aab, aac, aacb, aacba, aacbaa, aacbaab, ab, and aba."
  },
  {
    "title": "Substring Order II",
    "url": "https://cses.fi/problemset/task/2109",
    "description": "You are given a string of length nnn. If all of its substrings (not necessarily distinct) are ordered lexicographically, what is the kkkth smallest of them? The first input line has a string of length nnn that consists of characters a–z. The second input line has an integer kkk. Print the kkkth smallest substring in lexicographical order. Input: Output: Explanation: The 10 smallest substrings in order are a, a, a, a, aa, aa, aab, aaba, aabaa, and ab."
  },
  {
    "title": "Substring Distribution",
    "url": "https://cses.fi/problemset/task/2110",
    "description": "You are given a string of length nnn. For every integer between 1…n1 \\ldots n1…n you need to print the number of distinct substrings of that length. The only input line has a string of length nnn that consists of characters a–z. For each integer between 1…n1 \\ldots n1…n print the number of distinct substrings of that length. Input: Output:"
  },
  {
    "title": "Point Location Test",
    "url": "https://cses.fi/problemset/task/2189",
    "description": "There is a line that goes through the points p1=(x1,y1)p_1=(x_1,y_1)p1​=(x1​,y1​) and p2=(x2,y2)p_2=(x_2,y_2)p2​=(x2​,y2​). There is also a point p3=(x3,y3)p_3=(x_3,y_3)p3​=(x3​,y3​). Your task is to determine whether p3p_3p3​ is located on the left or right side of the line or if it touches the line when we are looking from p1p_1p1​ to p2p_2p2​. The first input line has an integer ttt: the number of tests. After this, there are ttt lines that describe the tests. Each line has six integers: x1x_1x1​, y1y_1y1​, x2x_2x2​, y2y_2y2​, x3x_3x3​ and y3y_3y3​. For each test, print \"LEFT\", \"RIGHT\" or \"TOUCH\". Input: Output:"
  },
  {
    "title": "Line Segment Intersection",
    "url": "https://cses.fi/problemset/task/2190",
    "description": "There are two line segments: the first goes through the points (x1,y1)(x_1,y_1)(x1​,y1​) and (x2,y2)(x_2,y_2)(x2​,y2​), and the second goes through the points (x3,y3)(x_3,y_3)(x3​,y3​) and (x4,y4)(x_4,y_4)(x4​,y4​). Your task is to determine if the line segments intersect, i.e., they have at least one common point. The first input line has an integer ttt: the number of tests. After this, there are ttt lines that describe the tests. Each line has eight integers x1x_1x1​, y1y_1y1​, x2x_2x2​, y2y_2y2​, x3x_3x3​, y3y_3y3​, x4x_4x4​ and y4y_4y4​. For each test, print \"YES\" if the line segments intersect and \"NO\" otherwise. Input: Output:"
  },
  {
    "title": "Polygon Area",
    "url": "https://cses.fi/problemset/task/2191",
    "description": "Your task is to calculate the area of a given polygon. The polygon consists of nnn vertices (x1,y1),(x2,y2),…,(xn,yn)(x_1,y_1),(x_2,y_2),\\dots,(x_n,y_n)(x1​,y1​),(x2​,y2​),…,(xn​,yn​). The vertices (xi,yi)(x_i,y_i)(xi​,yi​) and (xi+1,yi+1)(x_{i+1},y_{i+1})(xi+1​,yi+1​) are adjacent for i=1,2,…,n−1i=1,2,\\dots,n-1i=1,2,…,n−1, and the vertices (x1,y1)(x_1,y_1)(x1​,y1​) and (xn,yn)(x_n,y_n)(xn​,yn​) are also adjacent. The first input line has an integer nnn: the number of vertices. After this, there are nnn lines that describe the vertices. The iiith such line has two integers xix_ixi​ and yiy_iyi​. You may assume that the polygon is simple, i.e., it does not intersect itself. Print one integer: 2a2a2a where the area of the polygon is aaa (this ensures that the result is an integer). Input: Output:"
  },
  {
    "title": "Point in Polygon",
    "url": "https://cses.fi/problemset/task/2192",
    "description": "You are given a polygon of nnn vertices and a list of mmm points. Your task is to determine for each point if it is inside, outside or on the boundary of the polygon. The polygon consists of nnn vertices (x1,y1),(x2,y2),…,(xn,yn)(x_1,y_1),(x_2,y_2),\\dots,(x_n,y_n)(x1​,y1​),(x2​,y2​),…,(xn​,yn​). The vertices (xi,yi)(x_i,y_i)(xi​,yi​) and (xi+1,yi+1)(x_{i+1},y_{i+1})(xi+1​,yi+1​) are adjacent for i=1,2,…,n−1i=1,2,\\dots,n-1i=1,2,…,n−1, and the vertices (x1,y1)(x_1,y_1)(x1​,y1​) and (xn,yn)(x_n,y_n)(xn​,yn​) are also adjacent. The first input line has two integers nnn and mmm: the number of vertices in the polygon and the number of points. After this, there are nnn lines that describe the polygon. The iiith such line has two integers xix_ixi​ and yiy_iyi​. You may assume that the polygon is simple, i.e., it does not intersect itself. Finally, there are mmm lines that describe the points. Each line has two integers xxx and yyy. For each point, print \"INSIDE\", \"OUTSIDE\" or \"BOUNDARY\". Input: Output:"
  },
  {
    "title": "Polygon Lattice Points",
    "url": "https://cses.fi/problemset/task/2193",
    "description": "Given a polygon, your task is to calculate the number of lattice points inside the polygon and on its boundary. A lattice point is a point whose coordinates are integers. The polygon consists of nnn vertices (x1,y1),(x2,y2),…,(xn,yn)(x_1,y_1),(x_2,y_2),\\dots,(x_n,y_n)(x1​,y1​),(x2​,y2​),…,(xn​,yn​). The vertices (xi,yi)(x_i,y_i)(xi​,yi​) and (xi+1,yi+1)(x_{i+1},y_{i+1})(xi+1​,yi+1​) are adjacent for i=1,2,…,n−1i=1,2,\\dots,n-1i=1,2,…,n−1, and the vertices (x1,y1)(x_1,y_1)(x1​,y1​) and (xn,yn)(x_n,y_n)(xn​,yn​) are also adjacent. The first input line has an integer nnn: the number of vertices. After this, there are nnn lines that describe the vertices. The iiith such line has two integers xix_ixi​ and yiy_iyi​. You may assume that the polygon is simple, i.e., it does not intersect itself. Print two integers: the number of lattice points inside the polygon and on its boundary. Input: Output:"
  },
  {
    "title": "Minimum Euclidean Distance",
    "url": "https://cses.fi/problemset/task/2194",
    "description": "Given a set of points in the two-dimensional plane, your task is to find the minimum Euclidean distance between two distinct points. The Euclidean distance of points (x1,y1)(x_1,y_1)(x1​,y1​) and (x2,y2)(x_2,y_2)(x2​,y2​) is (x1−x2)2+(y1−y2)2\\sqrt{(x_1-x_2)^2+(y_1-y_2)^2}(x1​−x2​)2+(y1​−y2​)2​. The first input line has an integer nnn: the number of points. After this, there are nnn lines that describe the points. Each line has two integers xxx and yyy. You may assume that each point is distinct. Print one integer: d2d^2d2 where ddd is the minimum Euclidean distance (this ensures that the result is an integer). Input: Output:"
  },
  {
    "title": "Convex Hull",
    "url": "https://cses.fi/problemset/task/2195",
    "description": "Given a set of nnn points in the two-dimensional plane, your task is to determine the convex hull of the points. The first input line has an integer nnn: the number of points. After this, there are nnn lines that describe the points. Each line has two integers xxx and yyy: the coordinates of a point. You may assume that each point is distinct, and the area of the hull is positive. First print an integer kkk: the number of points in the convex hull. After this, print kkk lines that describe the points. You can print the points in any order. Print all points that lie on the convex hull. Input: Output:"
  },
  {
    "title": "Maximum Manhattan Distances",
    "url": "https://cses.fi/problemset/task/3410",
    "description": "A set is initially empty and nnn points are added to it. Calculate the maximum Manhattan distance of two points after each addition. The first line has an integer nnn: the number of points. The following nnn lines describe the points. Each line has two integers xxx and yyy. You can assume that each point is distinct. After each addition, print the maximum distance. Input: Output:"
  },
  {
    "title": "All Manhattan Distances",
    "url": "https://cses.fi/problemset/task/3411",
    "description": "Given a set of points, calculate the sum of all Manhattan distances between two point pairs. The first line has an integer nnn: the number of points. The following nnn lines describe the points. Each line has two integers xxx and yyy. You can assume that each point is distinct. Print the sum of all Manhattan distances. Input: Output:"
  },
  {
    "title": "Intersection Points",
    "url": "https://cses.fi/problemset/task/1740",
    "description": "Given nnn horizontal and vertical line segments, your task is to calculate the number of their intersection points. You can assume that no parallel line segments intersect, and no endpoint of a line segment is an intersection point. The first line has an integer nnn: the number of line segments. Then there are nnn lines describing the line segments. Each line has four integers: x1x_1x1​, y1y_1y1​, x2x_2x2​ and y2y_2y2​: a line segment begins at point (x1,y1)(x_1,y_1)(x1​,y1​) and ends at point (x2,y2)(x_2,y_2)(x2​,y2​). Print the number of intersection points. Input: Output:"
  },
  {
    "title": "Line Segments Trace I",
    "url": "https://cses.fi/problemset/task/3427",
    "description": "There are nnn line segments whose endpoints have integer coordinates. The left x-coordinate of each segment is 000 and the right x-coordinate is mmm. The slope of each segment is an integer. For each x-coordinate 0,1,…,m0,1,\\dots,m0,1,…,m, find the maximum point in any line segment. The first line has two integers nnn and mmm: the number of line segments and the maximum x-coordinate. The next nnn lines describe the line segments. Each line has two integers y1y_1y1​ and y2y_2y2​: there is a line segment between points (0,y1)(0,y_1)(0,y1​) and (m,y2)(m,y_2)(m,y2​). Print m+1m+1m+1 integers: the maximum points for x=0,1,…,mx=0,1,\\dots,mx=0,1,…,m. Input: Output:"
  },
  {
    "title": "Line Segments Trace II",
    "url": "https://cses.fi/problemset/task/3428",
    "description": "There are nnn line segments whose endpoints have integer coordinates. Each x-coordinate is between 000 and mmm. The slope of each segment is an integer. For each x-coordinate 0,1,…,m0,1,\\dots,m0,1,…,m, find the maximum point in any line segment. If there is no segment at some point, the maximum is −1-1−1. The first line has two integers nnn and mmm: the number of line segments and the maximum x-coordinate. The next nnn lines describe the line segments. Each line has four integers x1x_1x1​, y1y_1y1​, x2x_2x2​ and y2y_2y2​: there is a line segment between points (x1,y1)(x_1,y_1)(x1​,y1​) and (x2,y2)(x_2,y_2)(x2​,y2​). Print m+1m+1m+1 integers: the maximum points for x=0,1,…,mx=0,1,\\dots,mx=0,1,…,m. Input: Output:"
  },
  {
    "title": "Lines and Queries I",
    "url": "https://cses.fi/problemset/task/3429",
    "description": "Your task is to efficiently process the following types of queries: The first line has an integer nnn: the number of queries. The following nnn lines describe the queries. The format of each line is either \"1 aaa bbb\" or \"2 xxx\". You may assume that the first query is of type 1. Print the answer for each query of type 2. Input: Output:"
  },
  {
    "title": "Lines and Queries II",
    "url": "https://cses.fi/problemset/task/3430",
    "description": "Your task is to efficiently process the following types of queries: The first line has an integer nnn: the number of queries. The following nnn lines describe the queries. The format of each line is either \"1 aaa bbb lll rrr\" or \"2 xxx\". Print the answer for each query of type 2. If no line is active, print NO. Input: Output:"
  },
  {
    "title": "Area of Rectangles",
    "url": "https://cses.fi/problemset/task/1741",
    "description": "Given nnn rectangles, your task is to determine the total area of their union. The first line has an integer nnn: the number of rectangles. After that, there are nnn lines describing the rectangles. Each line has four integers x1x_1x1​, y1y_1y1​, x2x_2x2​ and y2y_2y2​: a rectangle begins at point (x1,y1)(x_1,y_1)(x1​,y1​) and ends at point (x2,y2)(x_2,y_2)(x2​,y2​). Print the total area covered by the rectangles. Input: Output:"
  },
  {
    "title": "Robot Path",
    "url": "https://cses.fi/problemset/task/1742",
    "description": "You are given a description of a robot's path. The robot begins at point (0,0)(0,0)(0,0) and performs nnn commands. Each command moves the robot some distance up, down, left or right. The robot will stop when it has performed all commands, or immediately when it returns to a point that it has already visited. Your task is to calculate the total distance the robot moves. The first line has an integer nnn: the number of commands. After that, there are nnn lines describing the commands. Each line has a character ddd and an integer xxx: the robot moves the distance  xxx to the direction ddd. Each direction is U (up), D (down), L (left), or R (right). Print the total distance the robot moves. Input: Output:"
  },
  {
    "title": "Meet in the Middle",
    "url": "https://cses.fi/problemset/task/1628",
    "description": "You are given an array of nnn numbers. In how many ways can you choose a subset of the numbers with sum xxx? The first input line has two numbers nnn and xxx: the array size and the required sum. The second line has nnn integers t1,t2,…,tnt_1,t_2,\\dots,t_nt1​,t2​,…,tn​: the numbers in the array. Print the number of ways you can create the sum xxx. Input: Output:"
  },
  {
    "title": "Hamming Distance",
    "url": "https://cses.fi/problemset/task/2136",
    "description": "The Hamming distance between two strings aaa and bbb of equal length is the number of positions where the strings differ. You are given nnn bit strings, each of length kkk and your task is to calculate the minimum Hamming distance between two strings. The first input line has two integers nnn and kkk: the number of bit strings and their length. Then there are nnn lines each consisting of one bit string of length kkk. Print the minimum Hamming distance between two strings. Input: Output: Explanation: The strings 101000 and 001000 differ only at the first position."
  },
  {
    "title": "Corner Subgrid Check",
    "url": "https://cses.fi/problemset/task/3360",
    "description": "You are given a grid of letters. Your task is to find subgrids whose height and width is at least two and all the corners have the same letter. For each letter, check if there is a valid subgrid whose corners have that letter. The first line has two integers nnn and kkk: the size of the grid and the number of letters. The letters are the first kkk uppercase letters. After this, there are nnn lines that describe the grid. Each line has nnn letters. Print kkk lines: for each letter, YES if there is a valid subgrid and NO otherwise. Input: Output:"
  },
  {
    "title": "Corner Subgrid Count",
    "url": "https://cses.fi/problemset/task/2137",
    "description": "You are given an n×nn \\times nn×n grid whose each square is either black or white. A subgrid is called beautiful if its height and width is at least two and all of its corners are black. How many beautiful subgrids are there within the given grid? The first input line has an integer nnn: the size of the grid. Then there are nnn lines describing the grid: 1 means that a square is black and 0 means it is white. Print the number of beautiful subgrids. Input: Output:"
  },
  {
    "title": "Reachable Nodes",
    "url": "https://cses.fi/problemset/task/2138",
    "description": "A directed acyclic graph consists of nnn nodes and mmm edges. The nodes are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Calculate for each node the number of nodes you can reach from that node (including the node itself). The first input line has two integers nnn and mmm: the number of nodes and edges. Then there are mmm lines describing the edges. Each line has two distinct integers aaa and bbb: there is an edge from node aaa to node bbb. Print nnn integers: for each node the number of reachable nodes. Input: Output:"
  },
  {
    "title": "Reachability Queries",
    "url": "https://cses.fi/problemset/task/2143",
    "description": "A directed graph consists of nnn nodes and mmm edges. The edges are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Your task is to answer qqq queries of the form \"can you reach node bbb from node aaa?\" The first input line has three integers nnn, mmm and qqq: the number of nodes, edges and queries. Then there are mmm lines describing the edges. Each line has two distinct integers aaa and bbb: there is an edge from node aaa to node bbb. Finally there are qqq lines describing the queries. Each line consists of two integers aaa and bbb: \"can you reach node bbb from node aaa?\" Print the answer for each query: either \"YES\" or \"NO\". Input: Output:"
  },
  {
    "title": "Cut and Paste",
    "url": "https://cses.fi/problemset/task/2072",
    "description": "Given a string, your task is to process operations where you cut a substring and paste it to the end of the string. What is the final string after all the operations? The first input line has two integers nnn and mmm: the length of the string and the number of operations. The characters of the string are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The next line has a string of length nnn that consists of characters A–Z. Finally, there are mmm lines that describe the operations. Each line has two integers aaa and bbb: you cut a substring from position aaa to position bbb. Print the final string after all the operations. Input: Output:"
  },
  {
    "title": "Substring Reversals",
    "url": "https://cses.fi/problemset/task/2073",
    "description": "Given a string, your task is to process operations where you reverse a substring of the string. What is the final string after all the operations? The first input line has two integers nnn and mmm: the length of the string and the number of operations. The characters of the string are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The next line has a string of length nnn that consists of characters A–Z. Finally, there are mmm lines that describe the operations. Each line has two integers aaa and bbb: you reverse a substring from position aaa to position bbb. Print the final string after all the operations. Input: Output:"
  },
  {
    "title": "Reversals and Sums",
    "url": "https://cses.fi/problemset/task/2074",
    "description": "Given an array of nnn integers, you have to process following operations: The first input line has two integers nnn and mmm: the size of the array and the number of operations. The array elements are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The next line as nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the contents of the array. Finally, there are mmm lines that describe the operations. Each line has three integers ttt, aaa and bbb. If t=1t=1t=1, you should reverse a subarray from aaa to bbb. If t=2t=2t=2, you should calculate the sum of values from aaa to bbb. Print the answer to each operation where t=2t=2t=2. Input: Output:"
  },
  {
    "title": "Necessary Roads",
    "url": "https://cses.fi/problemset/task/2076",
    "description": "There are nnn cities and mmm roads between them. There is a route between any two cities. A road is called necessary if there is no route between some two cities after removing that road. Your task is to find all necessary roads. The first input line has two integers nnn and mmm: the number of cities and roads. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines that describe the roads. Each line has two integers aaa and bbb: there is a road between cities aaa and bbb. There is at most one road between two cities, and every road connects two distinct cities. First print an integer kkk: the number of necessary roads. After that, print kkk lines that describe the roads. You may print the roads in any order. Input: Output:"
  },
  {
    "title": "Necessary Cities",
    "url": "https://cses.fi/problemset/task/2077",
    "description": "There are nnn cities and mmm roads between them. There is a route between any two cities. A city is called necessary if there is no route between some other two cities after removing that city (and adjacent roads). Your task is to find all necessary cities. The first input line has two integers nnn and mmm: the number of cities and roads. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines that describe the roads. Each line has two integers aaa and bbb: there is a road between cities aaa and bbb. There is at most one road between two cities, and every road connects two distinct cities. First print an integer kkk: the number of necessary cities. After that, print a list of kkk cities. You may print the cities in any order. Input: Output:"
  },
  {
    "title": "Eulerian Subgraphs",
    "url": "https://cses.fi/problemset/task/2078",
    "description": "You are given an undirected graph that has nnn nodes and mmm edges. We consider subgraphs that have all nodes of the original graph and some of its edges. A subgraph is called Eulerian if each node has even degree. Your task is to count the number of Eulerian subgraphs modulo 109+710^9+7109+7. The first input line has two integers nnn and mmm: the number of nodes and edges. The nodes are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines that describe the edges. Each line has two integers aaa and bbb: there is an edge between nodes aaa and bbb. There is at most one edge between two nodes, and each edge connects two distinct nodes. Print the number of Eulerian subgraphs modulo 109+710^9+7109+7. Input: Output: Explanation: You can either keep or remove all edges, so there are two possible Eulerian subgraphs."
  },
  {
    "title": "Monster Game I",
    "url": "https://cses.fi/problemset/task/2084",
    "description": "You are playing a game that consists of nnn levels. Each level has a monster. On levels 1,2,…,n−11,2,\\dots,n-11,2,…,n−1, you can either kill or escape the monster. However, on level nnn you must kill the final monster to win the game. Killing a monster takes sfsfsf time where sss is the monster's strength and fff is your skill factor (lower skill factor is better). After killing a monster, you get a new skill factor. What is the minimum total time in which you can win the game? The first input line has two integers nnn and xxx: the number of levels and your initial skill factor. The second line has nnn integers s1,s2,…,sns_1,s_2,\\dots,s_ns1​,s2​,…,sn​: each monster's strength. The third line has nnn integers f1,f2,…,fnf_1,f_2,\\dots,f_nf1​,f2​,…,fn​: your new skill factor after killing a monster. Print one integer: the minimum total time to win the game. Input: Output: Explanation: The best way to play is to kill the third and fifth monster."
  },
  {
    "title": "Monster Game II",
    "url": "https://cses.fi/problemset/task/2085",
    "description": "You are playing a game that consists of nnn levels. Each level has a monster. On levels 1,2,…,n−11,2,\\dots,n-11,2,…,n−1, you can either kill or escape the monster. However, on level nnn you must kill the final monster to win the game. Killing a monster takes sfsfsf time where sss is the monster's strength and fff is your skill factor. After killing a monster, you get a new skill factor  (lower skill factor is better). What is the minimum total time in which you can win the game? The first input line has two integers nnn and xxx: the number of levels and your initial skill factor. The second line has nnn integers s1,s2,…,sns_1,s_2,\\dots,s_ns1​,s2​,…,sn​: each monster's strength. The third line has nnn integers f1,f2,…,fnf_1,f_2,\\dots,f_nf1​,f2​,…,fn​: your new skill factor after killing a monster. Print one integer: the minimum total time to win the game. Input: Output: Explanation: The best way to play is to kill the second and fifth monster."
  },
  {
    "title": "Subarray Squares",
    "url": "https://cses.fi/problemset/task/2086",
    "description": "Given an array of nnn elements, your task is to divide into kkk subarrays. The cost of each subarray is the square of the sum of the values in the subarray. What is the minimum total cost if you act optimally? The first input line has two integers nnn and kkk: the array elements and the number of subarrays. The array elements are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the contents of the array. Print one integer: the minimum total cost. Input: Output: Explanation: An optimal solution is [2,3,1][2,3,1][2,3,1], [2,2,3][2,2,3][2,2,3], [4,1][4,1][4,1], whose cost is (2+3+1)2+(2+2+3)2+(4+1)2=110(2+3+1)^2+(2+2+3)^2+(4+1)^2=110(2+3+1)2+(2+2+3)2+(4+1)2=110."
  },
  {
    "title": "Houses and Schools",
    "url": "https://cses.fi/problemset/task/2087",
    "description": "There are nnn houses on a street, numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The distance of houses aaa and bbb is ∣a−b∣|a-b|∣a−b∣. You know the number of children in each house. Your task is to establish kkk schools in such a way that each school is in some house. Then, each child goes to the nearest school. What is the minimum total walking distance of the children if you act optimally? The first input line has two integers nnn and kkk: the number of houses and the number of schools. The houses are numbered 1,2…,n1,2\\dots,n1,2…,n. After this, there are nnn integers c1,c2,…,cnc_1,c_2,\\dots,c_nc1​,c2​,…,cn​: the number of children in each house. Print the minimum total distance. Input: Output: Explanation: Houses 2 and 5 will have schools."
  },
  {
    "title": "Knuth Division",
    "url": "https://cses.fi/problemset/task/2088",
    "description": "Given an array of nnn numbers, your task is to divide it into nnn subarrays, each of which has a single element. On each move, you may choose any subarray and split it into two subarrays. The cost of such a move is the sum of values in the chosen subarray. What is the minimum total cost if you act optimally? The first input line has an integer nnn: the array size. The array elements are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the contents of the array. Print one integer: the minimum total cost. Input: Output:"
  },
  {
    "title": "Apples and Bananas",
    "url": "https://cses.fi/problemset/task/2111",
    "description": "There are nnn apples and mmm bananas, and each of them has an integer weight between 1…k1 \\ldots k1…k. Your task is to calculate, for each weight www between 2…2k2 \\dots 2k2…2k, the number of ways we can choose an apple and a banana whose combined weight is www. The first input line contains three integers kkk, nnn and mmm: the number kkk, the number of apples and the number of bananas. The next line contains nnn integers a1,a2,…,ana_1,a_2,\\ldots,a_na1​,a2​,…,an​: weight of each apple. The last line contains mmm integers b1,b2,…,bmb_1,b_2,\\ldots,b_mb1​,b2​,…,bm​: weight of each banana. For each integer www between 2…2k2 \\ldots 2k2…2k print the number of ways to choose an apple and a banana whose combined weight is www. Input: Output: Explanation: For example for www = 888 there are 444 different ways: we can pick an apple of weight 555 in two different ways and a banana of weight 333 in two different ways."
  },
  {
    "title": "One Bit Positions",
    "url": "https://cses.fi/problemset/task/2112",
    "description": "You are given a binary string of length nnn. Your task is to calculate, for every kkk between 1…n−11 \\ldots n-11…n−1, the number of ways we can choose two positions iii and jjj such that i−j=ki-j=ki−j=k and there is a one-bit at both positions. The only input line has a string that consists only of characters 000 and 111. For every distance kkk between 1…n−11\\ldots n-11…n−1 print the number of ways we can choose two such positions. Input: Output:"
  },
  {
    "title": "Signal Processing",
    "url": "https://cses.fi/problemset/task/2113",
    "description": "You are given two integer sequences: a signal and a mask. Your task is to process the signal by moving the mask through the signal from left to right. At each mask position calculate the sum of products of aligned signal and mask values in the part where the signal and the mask overlap. The first input line consists of two integers nnn and mmm: the length of the signal and the length of the mask. The next line consists of nnn integers a1,a2,…,ana_1,a_2,\\ldots,a_na1​,a2​,…,an​ defining the signal. The last line consists of mmm integers b1,b2,…,bmb_1,b_2,\\ldots,b_mb1​,b2​,…,bm​ defining the mask. Print n+m−1n+m-1n+m−1 integers: the sum of products of aligned values at each mask position from left to right. Input: Output: Explanation: For example, at the second mask position the sum of aligned products is 2⋅1+3⋅3=112 \\cdot 1 + 3 \\cdot 3 = 112⋅1+3⋅3=11."
  },
  {
    "title": "New Roads Queries",
    "url": "https://cses.fi/problemset/task/2101",
    "description": "There are nnn cities in Byteland but no roads between them. However, each day, a new road will be built. There will be a total of mmm roads. Your task is to process qqq queries of the form: \"after how many days can we travel from city aaa to city bbb for the first time?\" The first input line has three integers nnn, mmm and qqq: the number of cities, roads and queries. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines that describe the roads in the order they are built. Each line has two integers aaa and bbb: there will be a road between cities aaa and bbb. Finally, there are qqq lines that describe the queries. Each line has two integers aaa and bbb: we want to travel from city aaa to city bbb. For each query, print the number of days, or −1-1−1 if it is never possible. Input: Output:"
  },
  {
    "title": "Dynamic Connectivity",
    "url": "https://cses.fi/problemset/task/2133",
    "description": "Consider an undirected graph that consists of nnn nodes and mmm edges. There are two types of events that can happen: Your task is to report the number of components after every event. The first input line has three integers nnn, mmm and kkk: the number of nodes, edges and events. After this there are mmm lines describing the edges. Each line has two integers aaa and bbb: there is an edge between nodes aaa and bbb. There is at most one edge between any pair of nodes. Then there are kkk lines describing the events. Each line has the form \"ttt aaa bbb\" where ttt is 1 (create a new edge) or 2 (remove an edge). A new edge is always created between two nodes that do not already have an edge between them, and only existing edges can get removed. Print k+1k+1k+1 integers: first the number of components before the first event, and after this the new number of components after each event. Input: Output:"
  },
  {
    "title": "Parcel Delivery",
    "url": "https://cses.fi/problemset/task/2121",
    "description": "There are nnn cities and mmm routes through which parcels can be carried from one city to another city. For each route, you know the maximum number of parcels and the cost of a single parcel. You want to send kkk parcels from Syrjälä to Lehmälä. What is the cheapest way to do that? The first input line has three integers nnn, mmm and kkk: the number of cities, routes and parcels. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. City 111 is Syrjälä and city nnn is Lehmälä. After this, there are mmm lines that describe the routes. Each line has four integers aaa, bbb, rrr and ccc: there is a route from city aaa to city bbb, at most rrr parcels can be carried through the route, and the cost of each parcel is ccc. Print one integer: the minimum total cost or −1-1−1 if there are no solutions. Input: Output: Explanation: One parcel is delivered through route 1→2→41 \\rightarrow 2 \\rightarrow 41→2→4 (cost 1⋅450=4501 \\cdot 450=4501⋅450=450) and two parcels are delivered through route 1→3→41 \\rightarrow 3 \\rightarrow 41→3→4 (cost 2⋅150=3002 \\cdot 150=3002⋅150=300)."
  },
  {
    "title": "Task Assignment",
    "url": "https://cses.fi/problemset/task/2129",
    "description": "A company has nnn employees and there are nnn tasks that need to be done. We know for each employee the cost of carrying out each task. Every employee should be assigned to exactly one task. What is the minimum total cost if we assign the tasks optimally and how could they be assigned? The first input line has one integer nnn: the number of employees and the number of tasks that need to be done. After this, there are nnn lines each consisting of nnn integers. The iiith line consists of integers ci1,ci2,…,cinc_{i1},c_{i2},\\ldots,c_{in}ci1​,ci2​,…,cin​: the cost of each task when it is assigned to the iiith employee. First print the minimum total cost. Then print nnn lines each consisting of two integers aaa and bbb: you assign the bbbth task to the aaath employee. If there are multiple solutions you can print any of them. Input: Output: Explanation: The minimum total cost is 333333. We can reach this by assigning employee 1 task 4, employee 2 task 1, employee 3 task 3 and employee 4 task 2. This will cost 9+7+10+7=339 + 7 + 10 + 7 = 339+7+10+7=33."
  },
  {
    "title": "Distinct Routes II",
    "url": "https://cses.fi/problemset/task/2130",
    "description": "A game consists of nnn rooms and mmm teleporters. At the beginning of each day, you start in room 111 and you have to reach room nnn. You can use each teleporter at most once during the game. You want to play the game for exactly kkk days. Every time you use any teleporter you have to pay one coin. What is the minimum number of coins you have to pay during kkk days if you play optimally? The first input line has three integers nnn, mmm and kkk: the number of rooms, the number of teleporters and the number of days you play the game. The rooms are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines describing the teleporters. Each line has two integers aaa and bbb: there is a teleporter from room aaa to room bbb. There are no two teleporters whose starting and ending room are the same. First print one integer: the minimum number of coins you have to pay if you play optimally. Then, print kkk route descriptions according to the example. You can print any valid solution. If it is not possible to play the game for kkk days, print only -1. Input: Output:"
  },
  {
    "title": "Sliding Window Sum",
    "url": "https://cses.fi/problemset/task/3220",
    "description": "You are given an array of nnn integers. Your task is to calculate the sum of each window of kkk elements, from left to right. In this problem the input data is large and it is created using a generator. The first line contains two integers nnn and kkk: the number of elements and the size of the window. The next line contains four integers xxx, aaa, bbb and ccc: the input generator parameters. The input is generated as follows: Print the xor of all window sums. Input: Output: Explanation: The input array is [3,0,1,8,2,4,7,6][3,0,1,8,2,4,7,6][3,0,1,8,2,4,7,6]. The windows are [3,0,1,8,2][3,0,1,8,2][3,0,1,8,2], [0,1,8,2,4][0,1,8,2,4][0,1,8,2,4], [1,8,2,4,7][1,8,2,4,7][1,8,2,4,7] and [8,2,4,7,6][8,2,4,7,6][8,2,4,7,6], and their sums are 141414, 151515, 222222 and 272727. Thus, the answer is 14⊕15⊕22⊕27=1214 \\oplus 15 \\oplus 22 \\oplus 27 = 1214⊕15⊕22⊕27=12."
  },
  {
    "title": "Sliding Window Minimum",
    "url": "https://cses.fi/problemset/task/3221",
    "description": "You are given an array of nnn integers. Your task is to calculate the minimum of each window of kkk elements, from left to right. In this problem the input data is large and it is created using a generator. The first line contains two integers nnn and kkk: the number of elements and the size of the window. The next line contains four integers xxx, aaa, bbb and ccc: the input generator parameters. The input is generated as follows: Print the xor of all window minimums. Input: Output: Explanation: The input array is [3,0,1,8,2,4,7,6][3,0,1,8,2,4,7,6][3,0,1,8,2,4,7,6]. The windows are [3,0,1,8,2][3,0,1,8,2][3,0,1,8,2], [0,1,8,2,4][0,1,8,2,4][0,1,8,2,4], [1,8,2,4,7][1,8,2,4,7][1,8,2,4,7] and [8,2,4,7,6][8,2,4,7,6][8,2,4,7,6], and their minimums are 000, 000, 111 and 222. Thus, the answer is 0⊕0⊕1⊕2=30 \\oplus 0 \\oplus 1 \\oplus 2 = 30⊕0⊕1⊕2=3."
  },
  {
    "title": "Sliding Window Xor",
    "url": "https://cses.fi/problemset/task/3426",
    "description": "You are given an array of nnn integers. Your task is to calculate the bitwise xor of each window of kkk elements, from left to right. In this problem the input data is large and it is created using a generator. The first line contains two integers nnn and kkk: the number of elements and the size of the window. The next line contains four integers xxx, aaa, bbb and ccc: the input generator parameters. The input is generated as follows: Print the xor of all window xors. Input: Output: Explanation: The input array is [3,0,1,8,2,4,7,6][3,0,1,8,2,4,7,6][3,0,1,8,2,4,7,6]. The windows are [3,0,1,8,2][3,0,1,8,2][3,0,1,8,2], [0,1,8,2,4][0,1,8,2,4][0,1,8,2,4], [1,8,2,4,7][1,8,2,4,7][1,8,2,4,7] and [8,2,4,7,6][8,2,4,7,6][8,2,4,7,6], and their xors are 888, 151515, 888 and 151515. Thus, the answer is 8⊕15⊕8⊕15=08 \\oplus 15 \\oplus 8 \\oplus 15 = 08⊕15⊕8⊕15=0."
  },
  {
    "title": "Sliding Window Or",
    "url": "https://cses.fi/problemset/task/3405",
    "description": "You are given an array of nnn integers. Your task is to calculate the bitwise or of each window of kkk elements, from left to right. In this problem the input data is large and it is created using a generator. The first line contains two integers nnn and kkk: the number of elements and the size of the window. The next line contains four integers xxx, aaa, bbb and ccc: the input generator parameters. The input is generated as follows: Print the xor of all window ors. Input: Output: Explanation: The input array is [3,0,1,8,2,4,7,6][3,0,1,8,2,4,7,6][3,0,1,8,2,4,7,6]. The windows are [3,0,1,8,2][3,0,1,8,2][3,0,1,8,2], [0,1,8,2,4][0,1,8,2,4][0,1,8,2,4], [1,8,2,4,7][1,8,2,4,7][1,8,2,4,7] and [8,2,4,7,6][8,2,4,7,6][8,2,4,7,6], and their ors are 111111, 151515, 151515 and 151515. Thus, the answer is 11⊕15⊕15⊕15=411 \\oplus 15 \\oplus 15 \\oplus 15 = 411⊕15⊕15⊕15=4."
  },
  {
    "title": "Sliding Window Distinct Values",
    "url": "https://cses.fi/problemset/task/3222",
    "description": "You are given an array of nnn integers. Your task is to calculate the number of distinct values in each window of kkk elements, from left to right. The first line contains two integers nnn and kkk: the number of elements and the size of the window. Then there are nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the contents of the array. Print n−k+1n-k+1n−k+1 values: the numbers of distinct values. Input: Output:"
  },
  {
    "title": "Sliding Window Mode",
    "url": "https://cses.fi/problemset/task/3224",
    "description": "You are given an array of nnn integers. Your task is to calculate the mode each window of kkk elements, from left to right. The mode is the most frequent element in an array. If there are several possible modes, choose the smallest of them. The first line contains two integers nnn and kkk: the number of elements and the size of the window. Then there are nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the contents of the array. Print n−k+1n-k+1n−k+1 values: the modes. Input: Output:"
  },
  {
    "title": "Sliding Window Mex",
    "url": "https://cses.fi/problemset/task/3219",
    "description": "You are given an array of nnn integers. Your task is to calculate the mex of each window of kkk elements, from left to right. The mex is the smallest nonnegative integer that does not appear in the array. For example, the mex for [3,1,4,3,0,5][3,1,4,3,0,5][3,1,4,3,0,5] is 222. The first line contains two integers nnn and kkk: the number of elements and the size of the window. Then there are nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the contents of the array. Print n−k+1n-k+1n−k+1 values: the mex values. Input: Output:"
  },
  {
    "title": "Sliding Window Median",
    "url": "https://cses.fi/problemset/task/1076",
    "description": "You are given an array of nnn integers. Your task is to calculate the median of each window of kkk elements, from left to right. The median is the middle element when the elements are sorted. If the number of elements is even, there are two possible medians and we assume that the median is the smaller of them. The first line contains two integers nnn and kkk: the number of elements and the size of the window. Then there are nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the contents of the array. Print n−k+1n-k+1n−k+1 values: the medians. Input: Output:"
  },
  {
    "title": "Sliding Window Cost",
    "url": "https://cses.fi/problemset/task/1077",
    "description": "You are given an array of nnn integers. Your task is to calculate for each window of kkk elements, from left to right, the minimum total cost of making all elements equal. You can increase or decrease each element with cost xxx where xxx is the difference between the new and the original value. The total cost is the sum of such costs. The first line contains two integers nnn and kkk: the number of elements and the size of the window. Then there are nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the contents of the array. Output n−k+1n-k+1n−k+1 values: the costs. Input: Output:"
  },
  {
    "title": "Sliding Window Inversions",
    "url": "https://cses.fi/problemset/task/3223",
    "description": "You are given an array of nnn integers. Your task is to calculate the number of inversions in each window of kkk elements, from left to right. An inversion is a pair of elements where the left element is larger than the right element. The first line contains two integers nnn and kkk: the number of elements and the size of the window. Then there are nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the contents of the array. Print n−k+1n-k+1n−k+1 values: the numbers of inversions. Input: Output:"
  },
  {
    "title": "Sliding Window Advertisement",
    "url": "https://cses.fi/problemset/task/3227",
    "description": "A fence consists of nnn vertical boards. The width of each board is 1 and their heights may vary. You want to attach a rectangular advertisement to the fence. Your task is to calculate the maximum area of such an advertisement in each window of kkk vertical boards, from left to right. The first line contains two integers nnn and kkk: the width of the fence and the size of the window. After this, there are nnn integers x1,x2,…,xnx_1, x_2, \\dots, x_nx1​,x2​,…,xn​: the height of each board. Print n−k+1n - k + 1n−k+1 integers: the maximum areas of the advertisements. Input: Output:"
  },
  {
    "title": "Hidden Integer",
    "url": "https://cses.fi/problemset/task/3112",
    "description": "There is a hidden integer xxx. Your task is to find the value of xxx. To do this, you can ask questions: you can choose an integer yyy and you will be told if y<xy < xy<x. This is an interactive problem. Your code will interact with the grader using standard input and output. You can start asking questions right away. On your turn, you can print one of the following: Each line should be followed by a line break. You must make sure the output gets flushed after printing each line."
  },
  {
    "title": "Hidden Permutation",
    "url": "https://cses.fi/problemset/task/3139",
    "description": "There is a hidden permutation a1,a2,…,ana_1, a_2,\\dots, a_na1​,a2​,…,an​ of integers 1,2,…,n1, 2,\\dots, n1,2,…,n. Your task is to find this permutation. To do this, you can ask questions: you can choose two indices iii and jjj and you will be told if ai<aja_i < a_jai​<aj​. This is an interactive problem. Your code will interact with the grader using standard input and output. You should start by reading a single integer nnn: the length of the permutation. On your turn, you can print one of the following: Each line should be followed by a line break. You must make sure the output gets flushed after printing each line. Explanation: The hidden permutation is [3,1,2][3, 1, 2][3,1,2]. The first question asks if a3<a2a_3 < a_2a3​<a2​ which is false, so the answer is NO. The second question asks if a3<a1a_3 < a_1a3​<a1​ which is true, so the answer is YES."
  },
  {
    "title": "K-th Highest Score",
    "url": "https://cses.fi/problemset/task/3305",
    "description": "There were nnn coders from Finland and nnn coders from Sweden in a programming contest. It turned out that after the contest, each coder had a distinct score. Your task is to find the kkk-th highest score in the contest. To do this, you can ask questions: you can choose a country (Finland or Sweden) and an integer iii and you will be told the iii-th highest score for the chosen country. This is an interactive problem. Your code will interact with the grader using standard input and output. You should start by reading two integers nnn and kkk. On your turn, you can print one of the following: Each line should be followed by a line break. You must make sure the output gets flushed after printing each line. Explanation: The scores for Finland are [9,4,3][9, 4, 3][9,4,3] and the scores for Sweden are [8,6,1][8, 6, 1][8,6,1]. Since k=1k = 1k=1, the task is to find the highest score overall, which in this case is 999."
  },
  {
    "title": "Permuted Binary Strings",
    "url": "https://cses.fi/problemset/task/3228",
    "description": "There is a hidden permutation a1,a2,…,ana_1, a_2,\\dots, a_na1​,a2​,…,an​ of integers 1,2,…,n1, 2,\\dots, n1,2,…,n. Your task is to find this permutation. To do this, you can ask questions: you can choose a binary string b1b2…bnb_1b_2\\dots b_nb1​b2​…bn​ and you will receive the binary string ba1ba2…banb_{a_1}b_{a_2}\\dots b_{a_n}ba1​​ba2​​…ban​​. This is an interactive problem. Your code will interact with the grader using standard input and output. You should start by reading a single integer nnn: the length of the permutation. On your turn, you can print one of the following: Each line should be followed by a line break. You must make sure the output gets flushed after printing each line. Explanation: The hidden permutation is [1,3,2][1, 3, 2][1,3,2]. In the first question b1b2b3=100b_1b_2b_3 = 100b1​b2​b3​=100 and the grader returns ba1ba2ba3=b1b3b2=100b_{a_1}b_{a_2}b_{a_3} = b_1b_3b_2 = 100ba1​​ba2​​ba3​​=b1​b3​b2​=100. In the second question b1b2b3=010b_1b_2b_3 = 010b1​b2​b3​=010 and the grader returns b1b3b2=001b_1b_3b_2 = 001b1​b3​b2​=001."
  },
  {
    "title": "Colored Chairs",
    "url": "https://cses.fi/problemset/task/3273",
    "description": "There are nnn chairs arranged in a circle. Each chair is either red or blue. The chairs are numbered 1,2,…,n1, 2,\\dots, n1,2,…,n; chairs iii and i+1i+1i+1 are next to each other for all 1≤i≤n1 \\le i \\le n1≤i≤n. Here chair n+1n+1n+1 refers to chair 111. Your task is to find two chairs that have the same color and are next to each other. To do this, you can ask questions: you can choose a chair and you will be told the color of that chair. This is an interactive problem. Your code will interact with the grader using standard input and output. You should start by reading a single integer nnn: the number of chairs. On your turn, you can print one of the following: Each line should be followed by a line break. You must make sure the output gets flushed after printing each line."
  },
  {
    "title": "Inversion Sorting",
    "url": "https://cses.fi/problemset/task/3140",
    "description": "There is a hidden permutation a1,a2,…,ana_1, a_2,\\dots, a_na1​,a2​,…,an​ of integers 1,2,…,n1, 2,\\dots, n1,2,…,n. Your task is to sort the permutation by reversing subarrays. On each turn, you can reverse a subarray of the permutation. After that, you will be reported the number of inversions in the permutation. If the number of inversions is 000 (i.e., the permutation is sorted), you win. This is an interactive problem. Your code will interact with the grader using standard input and output. You should start by reading a single integer nnn: the length of the permutation. On your turn, print two integers iii and jjj: reverse the subarray between indices iii and jjj. After this, the next input line has a single integer: the number of inversions after the operation. If the number is 000, you win and your program must terminate after this. Explanation: Here the initial permutation is [3,1,2][3,1,2][3,1,2]. After the first operation the permutation is [1,3,2][1,3,2][1,3,2] and the number of inversions is 111. After the second operation the permutation is [1,2,3][1,2,3][1,2,3] and the number of inversions is 000."
  },
  {
    "title": "Counting Bits",
    "url": "https://cses.fi/problemset/task/1146",
    "description": "Your task is to count the number of one bits in the binary representations of integers between 111 and nnn. The only input line has an integer nnn. Print the number of one bits in the binary representations of integers between 111 and nnn. Input: Output: Explanation: The binary representations of 1…71 \\ldots 71…7 are 1, 10, 11, 100, 101, 110, and 111, so there are a total of 12 one bits."
  },
  {
    "title": "Maximum Xor Subarray",
    "url": "https://cses.fi/problemset/task/1655",
    "description": "Given an array of nnn integers, your task is to find the maximum xor sum of a subarray. The first line has an integer nnn: the size of the array. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the contents of the array. Print one integer: the maximum xor sum in a subarray. Input: Output:"
  },
  {
    "title": "Maximum Xor Subset",
    "url": "https://cses.fi/problemset/task/3191",
    "description": "Given an array of nnn integers, your task is to find the maximum xor sum of a subset. The first line has an integer nnn: the size of the array. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the contents of the array. Print one integer: the maximum xor sum of a subset. Input: Output:"
  },
  {
    "title": "Number of Subset Xors",
    "url": "https://cses.fi/problemset/task/3211",
    "description": "Given an array of nnn integers, your task is to find the number of different subset xors. The first line has an integer nnn: the size of the array. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the contents of the array. Print one integer: the number of different subset xors. Input: Output: Explanation: The following values can be the xor of a subset: In this case, no other values can be the xor of a subset."
  },
  {
    "title": "K Subset Xors",
    "url": "https://cses.fi/problemset/task/3192",
    "description": "You are given an array of nnn integers. Consider the xors of all 2n2^n2n subsets of the array (including the empty subset with xor equal to zero). Your task is to find the kkk smallest subset xors. The first line has two integers nnn and kkk: the size of the array and the number of subset xors kkk. The next line has nnn integers x1,x2,…,xnx_1, x_2,\\dots, x_nx1​,x2​,…,xn​: the contents of the array. Print kkk integers: the kkk smallest subset xors in increasing order. Input: Output:"
  },
  {
    "title": "All Subarray Xors",
    "url": "https://cses.fi/problemset/task/3233",
    "description": "Given an array of nnn integers, your task is to find all integers that are the xor sum in some subarray. The first line has an integer nnn: the size of the array. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the contents of the array. First print an integer kkk: the number of distinct integers that are the xor sum in some subarray. After this print kkk integers: the xor sums in increasing order. Input: Output:"
  },
  {
    "title": "Xor Pyramid Peak",
    "url": "https://cses.fi/problemset/task/2419",
    "description": "Consider a xor pyramid where each number is the xor of lower-left and lower-right numbers. Here is an example pyramid: The first line has an integer nnn: the size of the pyramid. The next line has nnn integers a1,a2,…,ana_1,a_2,\\dots,a_na1​,a2​,…,an​: the bottom row of the pyramid. Print one integer: the topmost number. Input: Output:"
  },
  {
    "title": "Xor Pyramid Diagonal",
    "url": "https://cses.fi/problemset/task/3194",
    "description": "Consider a xor pyramid where each number is the xor of lower-left and lower-right numbers. Here is an example pyramid: The first line has an integer nnn: the size of the pyramid. The next line has nnn integers a1,a2,…,ana_1,a_2,\\dots,a_na1​,a2​,…,an​: the bottom row of the pyramid. Print nnn integers: the leftmost numbers of the rows from bottom to top. Input: Output:"
  },
  {
    "title": "Xor Pyramid Row",
    "url": "https://cses.fi/problemset/task/3195",
    "description": "Consider a xor pyramid where each number is the xor of lower-left and lower-right numbers. Here is an example pyramid: The first line has two integers nnn and kkk: the size of the pyramid and the given row. The next line has nnn integers a1,a2,…,ana_1,a_2,\\dots,a_na1​,a2​,…,an​: the bottom row of the pyramid. Print kkk integers: the numbers on the kkk-th row from the top. Input: Output:"
  },
  {
    "title": "SOS Bit Problem",
    "url": "https://cses.fi/problemset/task/1654",
    "description": "Given a list of nnn integers, your task is to calculate for each element xxx: The first line has an integer nnn: the size of the list. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the elements of the list. Print nnn lines: for each element the required values. Input: Output:"
  },
  {
    "title": "And Subset Count",
    "url": "https://cses.fi/problemset/task/3141",
    "description": "You are given an array of nnn integers. Your task is to calculate the number of non-empty subsets whose elements' bitwise and is equal to kkk for each k=0,1,…,nk = 0, 1,\\dots, nk=0,1,…,n. The first line has an integer nnn: the size of the array. The next line has nnn integers a1,a2,…,ana_1, a_2,\\dots, a_na1​,a2​,…,an​: the contents of the array. Print n+1n + 1n+1 integers as specified above modulo 109+710^9 + 7109+7. Input: Output:"
  },
  {
    "title": "Inverse Inversions",
    "url": "https://cses.fi/problemset/task/2214",
    "description": "Your task is to create a permutation of numbers 1,2,…,n1,2,\\dots,n1,2,…,n that has exactly kkk inversions. An inversion is a pair (a,b)(a,b)(a,b) where a<ba<ba<b and pa>pbp_a>p_bpa​>pb​ where pip_ipi​ denotes the number at position iii in the permutation. The only input line has two integers nnn and kkk. Print a line that contains the permutation. You can print any valid solution. Input: Output:"
  },
  {
    "title": "Monotone Subsequences",
    "url": "https://cses.fi/problemset/task/2215",
    "description": "Your task is to create a permutation of numbers 1,2,…,n1,2,\\dots,n1,2,…,n whose longest monotone subsequence has exactly kkk elements. A monotone subsequence is either increasing or decreasing. For example, some monotone subsequences in [2,1,4,5,3][2,1,4,5,3][2,1,4,5,3] are [2,4,5][2,4,5][2,4,5] and [4,3][4,3][4,3]. The first input line has an integer ttt: the number of tests. After this, there are ttt lines. Each line has two integers nnn and kkk. For each test, print a line that contains the permutation. You can print any valid solution. If there are no solutions, print IMPOSSIBLE. Input: Output:"
  },
  {
    "title": "Third Permutation",
    "url": "https://cses.fi/problemset/task/3422",
    "description": "You are given two permutations aaa and bbb such that ai≠bia_i \\neq b_iai​=bi​ in every position. Create a third permutation ccc such that ai≠cia_i \\neq c_iai​=ci​ and bi≠cib_i \\neq c_ibi​=ci​ in every position. The first line has an integer nnn: the permutation size. The second line has nnn integers a1,a2,…,ana_1,a_2,\\dots,a_na1​,a2​,…,an​. The third line has nnn integers b1,b2,…,bnb_1,b_2,\\dots,b_nb1​,b2​,…,bn​. Print nnn integers c1,c2,…,cnc_1,c_2,\\dots,c_nc1​,c2​,…,cn​. You can print any valid solution. If there are no solutions, print IMPOSSIBLE. Input: Output:"
  },
  {
    "title": "Permutation Prime Sums",
    "url": "https://cses.fi/problemset/task/3423",
    "description": "Given nnn, create two permutations aaa and bbb of size nnn such that ai+bia_i+b_iai​+bi​ is prime for i=1,2,…,ni=1,2,\\dots,ni=1,2,…,n. The only line has an integer nnn. Print two permutations. You can print any valid solution. If there are no solutions, print IMPOSSIBLE. Input: Output: Explanation: The sums are 2+5=72+5=72+5=7, 1+1=21+1=21+1=2, 3+4=73+4=73+4=7, 5+2=75+2=75+2=7 and 4+3=74+3=74+3=7 which all are primes."
  },
  {
    "title": "Chess Tournament",
    "url": "https://cses.fi/problemset/task/1697",
    "description": "There will be a chess tournament of nnn players. Each player has announced the number of games they want to play. Each pair of players can play at most one game. Your task is to determine which games will be played so that everybody will be happy. The first input line has an integer nnn: the number of players. The players are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: for each player, the number of games they want to play. First print an integer kkk: the number of games. Then, print kkk lines describing the games. You can print any valid solution. If there are no solutions, print \"IMPOSSIBLE\". Input: Output:"
  },
  {
    "title": "Distinct Sums Grid",
    "url": "https://cses.fi/problemset/task/3424",
    "description": "Create an n×nn \\times nn×n grid that fulfills the following requirements: The only line has an integer nnn. Print a grid that fulfills the requirements. You can print any valid solution. If there are no solutions, print IMPOSSIBLE. Input: Output: Explanation: Each integer 1…51 \\dots 51…5 appears 555 times, and the sums in rows and columns are {8,11,12,14,15,16,17,18,19,20}\\{8,11,12,14,15,16,17,18,19,20\\}{8,11,12,14,15,16,17,18,19,20}."
  },
  {
    "title": "Filling Trominos",
    "url": "https://cses.fi/problemset/task/2423",
    "description": "Your task is to fill an n×mn \\times mn×m grid using L-trominos (three squares that have an L-shape). For example, here is one way to fill a 4×64 \\times 64×6 grid: The first input line has an integer ttt: the number of tests. After that, there are ttt lines that describe the tests. Each line has two integers nnn and mmm. For each test, print YES if there is a solution, and NO otherwise. If there is a solution, also print nnn lines that each contain mmm letters between A–Z. Adjacent squares must have the same letter exactly when they belong to the same tromino. You can print any valid solution. Input: Output:"
  },
  {
    "title": "Grid Path Construction",
    "url": "https://cses.fi/problemset/task/2418",
    "description": "Given an n×mn \\times mn×m grid and two squares a=(y1,x1)a=(y_1,x_1)a=(y1​,x1​) and b=(y2,x2)b=(y_2,x_2)b=(y2​,x2​), create a path from aaa to bbb that visits each square exactly once. For example, here is a path from a=(1,3)a=(1,3)a=(1,3) to b=(3,6)b=(3,6)b=(3,6) in a 4×74 \\times 74×7 grid: The first input line has an integer ttt: the number of tests. After this, there are ttt lines that describe the tests. Each line has six integers nnn, mmm, y1y_1y1​, x1x_1x1​, y2y_2y2​ and x2x_2x2​. In all tests 1≤y1,y2≤n1 \\le y_1,y_2 \\le n1≤y1​,y2​≤n and 1≤x1,x2≤m1 \\le x_1,x_2 \\le m1≤x1​,x2​≤m. In addition, y1≠y2y_1 \\neq y_2y1​=y2​ or x1≠x2x_1 \\neq x_2x1​=x2​. Print YES, if it is possible to construct a path, and NO otherwise. If there is a path, also print its description which consists of characters U (up), D (down), L (left) and R (right). If there are several paths, you can print any of them. Input: Output:"
  },
  {
    "title": "Nearest Shops",
    "url": "https://cses.fi/problemset/task/3303",
    "description": "There are nnn cities and mmm roads. Each road is bidirectional and connects two cities. It is also known that kkk cities have an anime shop. If you live in a city, you of course know the local anime shop well if there is one. You would like to find the nearest anime shop that is not in your city. For each city, determine the minimum distance to another city that has an anime shop. The first line has three integers nnn, mmm and kkk: the number of cities, roads and anime shops. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The next line contains kkk integers: the cities that have an anime shop. Finally, there are mmm lines that describe the roads. Each line has two integers aaa and bbb: there is a road between cities aaa and bbb. Print nnn integers: for each city, the minimum distance to another city with an anime shop. If there is no such city, print −1-1−1 instead. Input: Output:"
  },
  {
    "title": "Prüfer Code",
    "url": "https://cses.fi/problemset/task/1134",
    "description": "A Prüfer code of a tree of nnn nodes is a sequence of n−2n-2n−2 integers that uniquely specifies the structure of the tree. The code is constructed as follows: As long as there are at least three nodes left, find a leaf with the smallest label, add the label of its only neighbor to the code, and remove the leaf from the tree. Given a Prüfer code of a tree, your task is to construct the original tree. The first input line contains an integer nnn: the number of nodes. The nodes are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. The second line contains n−2n-2n−2 integers: the Prüfer code. Print n−1n-1n−1 lines describing the edges of the tree. Each line has to contain two integers aaa and bbb: there is an edge between nodes aaa and bbb. You can print the edges in any order. Input: Output:"
  },
  {
    "title": "Tree Traversals",
    "url": "https://cses.fi/problemset/task/1702",
    "description": "There are three common ways to traverse the nodes of a binary tree: There is a binary tree of nnn nodes with distinct labels. You are given the preorder and inorder traversals of the tree, and your task is to determine its postorder traversal. The first input line has an integer nnn: the number of nodes. The nodes are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are two lines describing the preorder and inorder traversals of the tree. Both lines consist of nnn integers. You can assume that the input corresponds to a binary tree. Print the postorder traversal of the tree. Input: Output:"
  },
  {
    "title": "Course Schedule II",
    "url": "https://cses.fi/problemset/task/1757",
    "description": "You want to complete nnn courses that have requirements of the form \"course aaa has to be completed before course bbb\". You want to complete course 111 as soon as possible. If there are several ways to do this, you want then to complete course 222 as soon as possible, and so on. Your task is to determine the order in which you complete the courses. The first input line has two integers nnn and mmm: the number of courses and requirements. The courses are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Then, there are mmm lines describing the requirements. Each line has two integers aaa and bbb: course aaa has to be completed before course bbb. You can assume that there is at least one valid schedule. Print one line having nnn integers: the order in which you complete the courses. Input: Output:"
  },
  {
    "title": "Acyclic Graph Edges",
    "url": "https://cses.fi/problemset/task/1756",
    "description": "Given an undirected graph, your task is to choose a direction for each edge so that the resulting directed graph is acyclic. The first input line has two integers nnn and mmm: the number of nodes and edges. The nodes are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines describing the edges. Each line has two distinct integers aaa and bbb: there is an edge between nodes aaa and bbb. Print mmm lines describing the directions of the edges. Each line has two integers aaa and bbb: there is an edge from node aaa to node bbb. You can print any valid solution. Input: Output:"
  },
  {
    "title": "Strongly Connected Edges",
    "url": "https://cses.fi/problemset/task/2177",
    "description": "Given an undirected graph, your task is to choose a direction for each edge so that the resulting directed graph is strongly connected. The first input line has two integers nnn and mmm: the number of nodes and edges. The nodes are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines describing the edges. Each line has two integers aaa and bbb: there is an edge between nodes aaa and bbb. You may assume that the graph is simple, i.e., there are at most one edge between two nodes and every edge connects two distinct nodes. Print mmm lines describing the directions of the edges. Each line has two integers aaa and bbb: there is an edge from node aaa to node bbb. You can print any valid solution. If there are no solutions, only print IMPOSSIBLE. Input: Output:"
  },
  {
    "title": "Even Outdegree Edges",
    "url": "https://cses.fi/problemset/task/2179",
    "description": "Given an undirected graph, your task is to choose a direction for each edge so that in the resulting directed graph each node has an even outdegree. The outdegree of a node is the number of edges coming out of that node. The first input line has two integers nnn and mmm: the number of nodes and edges. The nodes are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines describing the edges. Each line has two integers aaa and bbb: there is an edge between nodes aaa and bbb. You may assume that the graph is simple, i.e., there is at most one edge between any two nodes and every edge connects two distinct nodes. Print mmm lines describing the directions of the edges. Each line has two integers aaa and bbb: there is an edge from node aaa to node bbb. You can print any valid solution. If there are no solutions, only print IMPOSSIBLE. Input: Output:"
  },
  {
    "title": "Graph Girth",
    "url": "https://cses.fi/problemset/task/1707",
    "description": "Given an undirected graph, your task is to determine its girth, i.e., the length of its shortest cycle. The first input line has two integers nnn and mmm: the number of nodes and edges. The nodes are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines describing the edges. Each line has two integers aaa and bbb: there is an edge between nodes aaa and bbb. You may assume that there is at most one edge between each two nodes. Print one integer: the girth of the graph. If there are no cycles, print −1-1−1. Input: Output:"
  },
  {
    "title": "Fixed Length Walk Queries",
    "url": "https://cses.fi/problemset/task/3357",
    "description": "You are given an undirected graph with nnn nodes and mmm edges. The graph is simple and connected. You start at a specific node, and on each turn\nyou must move through an edge to another node. Your task is to answer qqq queries of the form: \"is it possible to start at node aaa and end up on node bbb after exactly xxx turns?\" The first line contains three integers nnn, mmm and qqq:\nthe number of nodes, edges and queries. The nodes are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines which describe the edges. Each line contains two integers aaa and bbb: there is an edge between nodes aaa and bbb. Finally, there are qqq lines, each describing a query.\nEach line contains three integers aaa, bbb and xxx. For each query, print the answer (YES or NO) on its own line. Input: Output: Explanation:"
  },
  {
    "title": "Transfer Speeds Sum",
    "url": "https://cses.fi/problemset/task/3111",
    "description": "A computer network has nnn computers and n−1n-1n−1 connections between two computers. Information can be exchanged between every pair of computers using the connections. Each connection has a certain transfer speed. Let d(a,b)d(a,b)d(a,b) denote the transfer speed between computers aaa and bbb, which is the speed of the slowest connection on the route between aaa and bbb. Your task is to compute the sum of transfer speeds between all pairs of computers. The first line contains the integer nnn: the number of computers. The computers are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are n−1n-1n−1 lines, which describe the connections. Each line has three integers aaa, bbb and xxx: there is a connection between computers aaa and bbb with transfer speed xxx. Print one integer: the sum of transfer speeds. Input: Output: Explanation: The following figure corresponds to the sample input:"
  },
  {
    "title": "MST Edge Check",
    "url": "https://cses.fi/problemset/task/3407",
    "description": "Given an undirected weighted graph, determine for each edge if it can be included in a minimum spanning tree. The first line has two integers nnn and mmm: the number of nodes and edges. The nodes are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The following mmm lines describe the edges. Each line has three integers aaa, bbb, www: there is an edge between nodes aaa and bbb with weight www. You can assume that the graph is connected and simple and each edge appears at most once in the graph. For each edge in the input order, print YES if it can be included in the minimum spanning tree and NO otherwise. Input: Output:"
  },
  {
    "title": "MST Edge Set Check",
    "url": "https://cses.fi/problemset/task/3408",
    "description": "Given an undirected weighted graph and edge sets, determine for each set if the edges can be included in a minimum spanning tree. The first line has three integers nnn,  mmm and qqq: the number of nodes, edges and edge sets. The nodes are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The following mmm lines describe the edges. Each line has three integers aaa, bbb, www: there is an edge between nodes aaa and bbb with weight www. The edges are numbered 1,2,…,m1,2,\\dots,m1,2,…,m in the input order. The following 2q2q2q lines describe the edge sets. For each set, the first line contains its size and the second line contains its edges. The total number of edges in all sets is at most mmm. You can assume that the graph is connected and simple and each edge appears at most once in the graph. For each edge set, print YES if the edges can be included in the minimum spanning tree and NO otherwise. Input: Output:"
  },
  {
    "title": "MST Edge Cost",
    "url": "https://cses.fi/problemset/task/3409",
    "description": "Given an undirected weighted graph, determine for each edge the minimum spanning tree cost if the edge must be included in the spanning tree. The first line has two integers nnn and mmm: the number of nodes and edges. The nodes are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The following mmm lines describe the edges. Each line has three integers aaa, bbb, www: there is an edge between nodes aaa and bbb with weight www. You can assume that the graph is connected and simple and each edge appears at most once in the graph. For each edge in the input order, print the minimum spanning tree cost when the edge is included. Input: Output:"
  },
  {
    "title": "Network Breakdown",
    "url": "https://cses.fi/problemset/task/1677",
    "description": "Syrjälä's network has nnn computers and mmm connections between them. The network consists of components of computers that can send messages to each other. Nobody in Syrjälä understands how the network works. For this reason, if a connection breaks down, nobody will repair it. In this situation a component may be divided into two components. Your task is to calculate the number of components after each connection breakdown. The first input line has three integers nnn, mmm and kkk: the number of computers, connections and breakdowns. The computers are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Then, there are mmm lines describing the connections. Each line has two integers aaa and bbb: there is a connection between computers aaa and bbb. Each connection is between two different computers, and there is at most one connection between two computers. Finally, there are kkk lines describing the breakdowns. Each line has two integers aaa and bbb: the connection between computers aaa and bbb breaks down. After each breakdown, print the number of components. Input: Output:"
  },
  {
    "title": "Tree Coin Collecting I",
    "url": "https://cses.fi/problemset/task/3114",
    "description": "You are given a tree with nnn nodes. Some nodes contain a coin. Your task is to answer qqq queries of the form: what is the shortest length of a path from node aaa to node bbb that visits a node with a coin? The first line contains two integers nnn and qqq: the number of nodes and queries. The nodes are numbered 1,2,…,n1, 2, \\dots, n1,2,…,n. The second line contains nnn integers c1,c2,…,cnc_1, c_2,\\dots, c_nc1​,c2​,…,cn​. If ci=1c_i = 1ci​=1, node iii has a coin. If ci=0c_i = 0ci​=0, node iii doesn't have a coin. You can assume at least one node has a coin. Then there are n−1n-1n−1 lines describing the edges. Each line contains two integers aaa and bbb: there is an edge between nodes aaa and bbb. Finally, there are qqq lines describing the queries. Each line contains two integers aaa and bbb: the start and end nodes. Print qqq integers: the answers to the queries. Input: Output:"
  },
  {
    "title": "Tree Coin Collecting II",
    "url": "https://cses.fi/problemset/task/3149",
    "description": "You are given a tree with nnn nodes. Some nodes contain a coin. Your task is to answer qqq queries of the form: what is the shortest length of a path from node aaa to node bbb that visits all nodes with coins? The first line contains two integers nnn and qqq: the number of nodes and queries. The nodes are numbered 1,2,…,n1, 2, \\dots, n1,2,…,n. The second line contains nnn integers c1,c2,…,cnc_1, c_2,\\dots, c_nc1​,c2​,…,cn​. If ci=1c_i = 1ci​=1, node iii has a coin. If ci=0c_i = 0ci​=0, node iii doesn't have a coin. You can assume at least one node has a coin. Then there are n−1n-1n−1 lines describing the edges. Each line contains two integers aaa and bbb: there is an edge between nodes aaa and bbb. Finally, there are qqq lines describing the queries. Each line contains two integers aaa and bbb: the start and end nodes. Print qqq integers: the answers to the queries. Input: Output:"
  },
  {
    "title": "Tree Isomorphism I",
    "url": "https://cses.fi/problemset/task/1700",
    "description": "Given two rooted trees, your task is to find out if they are isomorphic, i.e., it is possible to draw them so that they look the same. The first input line has an integer ttt: the number of tests. Then, there are ttt tests described as follows: The first line has an integer nnn: the number of nodes in both trees. The nodes are numbered 1,2,…,n1,2,\\dots,n1,2,…,n, and node 111 is the root. Then, there are n−1n-1n−1 lines describing the edges of the first tree, and finally n−1n-1n−1 lines describing the edges of the second tree. For each test, print \"YES\", if the trees are isomorphic, and \"NO\" otherwise. Input: Output:"
  },
  {
    "title": "Tree Isomorphism II",
    "url": "https://cses.fi/problemset/task/1701",
    "description": "Given two (not rooted) trees, your task is to find out if they are isomorphic, i.e., it is possible to draw them so that they look the same. The first input line has an integer ttt: the number of tests. Then, there are ttt tests described as follows: The first line has an integer nnn: the number of nodes in both trees. The nodes are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Then, there are n−1n-1n−1 lines describing the edges of the first tree, and finally n−1n-1n−1 lines describing the edges of the second tree. For each test, print \"YES\", if the trees are isomorphic, and \"NO\" otherwise. Input: Output:"
  },
  {
    "title": "Flight Route Requests",
    "url": "https://cses.fi/problemset/task/1699",
    "description": "There are nnn cities with airports but no flight connections. You are given mmm requests which routes should be possible to travel. Your task is to determine the minimum number of one-way flight connections which makes it possible to fulfil all requests. The first input line has two integers nnn and mmm: the number of cities and requests. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines describing the requests. Each line has two integers aaa and bbb: there has to be a route from city aaa to city bbb. Each request is unique. Print one integer: the minimum number of flight connections. Input: Output: Explanation: You can create the connections 1→21 \\rightarrow 21→2, 2→32 \\rightarrow 32→3, 2→42 \\rightarrow 42→4 and 3→13 \\rightarrow 13→1. Then you can also fly from city 333 to city 444 using the route 3→1→2→43 \\rightarrow 1 \\rightarrow 2 \\rightarrow 43→1→2→4."
  },
  {
    "title": "Critical Cities",
    "url": "https://cses.fi/problemset/task/1703",
    "description": "There are nnn cities and mmm flight connections between them. A city is called a critical city if it appears on every route from a city to another city. Your task is to find all critical cities from Syrjälä to Lehmälä. The first input line has two integers nnn and mmm: the number of cities and flights. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. City 111 is Syrjälä, and city nnn is Lehmälä. Then, there are mmm lines describing the connections. Each line has two integers aaa and bbb: there is a flight from city aaa to city bbb. All flights are one-way. You may assume that there is a route from Syrjälä to Lehmälä. First print an integer kkk: the number of critical cities. After this, print kkk integers: the critical cities in increasing order. Input: Output:"
  },
  {
    "title": "Visiting Cities",
    "url": "https://cses.fi/problemset/task/1203",
    "description": "You want to travel from Syrjälä to Lehmälä by plane using a minimum-price route. Which cities will you certainly visit? The first input line contains two integers nnn and mmm: the number of cities and the number of flights. The cities are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. City 1 is Syrjälä, and city nnn is Lehmälä. After this, there are mmm lines describing the flights. Each line has three integers aaa, bbb, and ccc: there is a flight from city aaa to city bbb with price ccc. All flights are one-way flights. You may assume that there is a route from Syrjälä to Lehmälä. First print an integer kkk: the number of cities that are certainly in the route. After this, print the kkk cities sorted in increasing order. Input: Output:"
  },
  {
    "title": "Graph Coloring",
    "url": "https://cses.fi/problemset/task/3308",
    "description": "You are given a simple graph with nnn nodes and mmm edges. Your task is to use the minimum possible number of colors to color each node such that no edge connects two nodes of the same color. The first line has two integers nnn and mmm: the number of nodes and edges. The nodes are numbered 1,2,…,n1, 2,\\dots, n1,2,…,n. Then there are mmm lines describing the edges. Each line has two integers aaa and bbb: there is an edge connecting nodes aaa and bbb. First, print an integer kkk: the minimum number of colors. After this, print nnn integers c1,c2,…,cnc_1, c_2,\\dots, c_nc1​,c2​,…,cn​: the colors of the nodes. The colors should satisfy 1≤ci≤k1 \\le c_i \\le k1≤ci​≤k. You may print any valid solution. Input: Output:"
  },
  {
    "title": "Bus Companies",
    "url": "https://cses.fi/problemset/task/3158",
    "description": "There are nnn cities and mmm bus companies. Each bus company operates in specific cities and sells tickets for a specific price. Buying a ticket from a bus company allows you to travel between any two cities that the company operates in. Determine the cost of the cheapest route from Syrjälä to every city. The first line has two integers nnn and mmm: the number of cities and bus companies. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n, and city 111 is Syrjälä. The next line has mmm integers c1,c2,…,cmc_1, c_2,\\dots, c_mc1​,c2​,…,cm​: the ticket costs for each bus company. After that, there are mmm pairs of lines describing the cities for each bus company. The first line of each pair has a single integer kkk: the number of cities the bus company operates in. The second line of each pair has kkk distinct integers a1,a2,…,aka_1, a_2,\\dots, a_ka1​,a2​,…,ak​: the cities the bus company operates in. You can assume that it is possible to travel from Syrjälä to all other cities. Print nnn integers: the cheapest route costs from Syrjälä to cities 1,2,…,n1,2,\\dots, n1,2,…,n. Input: Output:"
  },
  {
    "title": "Split into Two Paths",
    "url": "https://cses.fi/problemset/task/3358",
    "description": "You are given an acyclic directed graph with nnn nodes and mmm edges. Determine whether two paths can be formed in the graph such that each node of the graph appears in exactly one of the paths. Note that all edges of the graph do not need to appear in the paths. The first line has two integers nnn and mmm: the number of nodes and the number of edges. The nodes are numbered 1,2,…,n1, 2, \\dots, n1,2,…,n. After this, there are mmm lines which describe the edges.\nEach line has two integers aaa and bbb: there is an edge in the graph from node aaa to node bbb. First print the line YES if the paths can be formed, or NO otherwise. If the paths can be formed, print them on the following two lines. At the beginning of both lines, print the amount of nodes in the path and then the nodes of the path in order. There must be an edge in the graph between subsequent nodes. One of the paths may contain zero nodes. If there exist multiple solutions, you can print any solution. Input: Output: Input: Output:"
  },
  {
    "title": "Network Renovation",
    "url": "https://cses.fi/problemset/task/1704",
    "description": "Syrjälä's network consists of nnn computers and n−1n-1n−1 connections between them. It is possible to send data between any two computers. However, if any connection breaks down, it will no longer be possible to send data between some computers. Your task is to add the minimum number of new connections in such a way that you can still send data between any two computers even if any single connection breaks down. The first input line has an integer nnn: the number of computers. The computers are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are n−1n-1n−1 lines describing the connections. Each line has two integers aaa and bbb: there is a connection between computers aaa and bbb. First print an integer kkk: the minimum number of new connections. After this, print kkk lines describing the connections. You can print any valid solution. Input: Output:"
  },
  {
    "title": "Forbidden Cities",
    "url": "https://cses.fi/problemset/task/1705",
    "description": "There are nnn cities and mmm roads between them. Kaaleppi is currently in city aaa and wants to travel to city bbb. However, there is a problem: Kaaleppi has recently robbed a bank in city ccc and can't enter the city, because the local police would catch him. Your task is to find out if there is a route from city aaa to city bbb that does not visit city ccc. As an additional challenge, you have to process qqq queries where aaa, bbb and ccc vary. The first input line has three integers nnn, mmm and qqq: the number of cities, roads and queries. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. Then, there are mmm lines describing the roads. Each line has two integers aaa and bbb: there is a road between cities aaa and bbb. Each road is bidirectional. Finally, there are qqq lines describing the queries. Each line has three integers aaa, bbb and ccc: is there a route from city aaa to city bbb that does not visit city ccc? You can assume that there is a route between any two cities. For each query, print \"YES\", if there is such a route, and \"NO\" otherwise. Input: Output:"
  },
  {
    "title": "Creating Offices",
    "url": "https://cses.fi/problemset/task/1752",
    "description": "There are nnn cities and n−1n-1n−1 roads between them. There is a unique route between any two cities, and their distance is the number of roads on that route. A company wants to have offices in some cities, but the distance between any two offices has to be at least ddd. What is the maximum number of offices they can have? The first input line has two integers nnn and ddd: the number of cities and the minimum distance. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are n−1n-1n−1 lines describing the roads. Each line has two integers aaa and bbb: there is a road between cities aaa and bbb. First print an integer kkk: the maximum number of offices. After that, print the cities which will have offices. You can print any valid solution. Input: Output:"
  },
  {
    "title": "New Flight Routes",
    "url": "https://cses.fi/problemset/task/1685",
    "description": "There are nnn cities and mmm flight connections between them. Your task is to add new flights so that it will be possible to travel from any city to any other city. What is the minimum number of new flights required? The first input line has two integers nnn and mmm: the number of cities and flights. The cities are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines describing the flights. Each line has two integers aaa and bbb: there is a flight from city aaa to city bbb. All flights are one-way flights. First print an integer kkk: the required number of new flights. After this, print kkk lines describing the new flights. You can print any valid solution. Input: Output:"
  },
  {
    "title": "Filled Subgrid Count I",
    "url": "https://cses.fi/problemset/task/3413",
    "description": "You are given a grid of letters. Your task is to calculate, for each letter, the number of square subgrids whose each letter is the same. The first line has two integers nnn and kkk: the size of the grid and the number of letters. The letters are the first kkk uppercase letters. After this, there are nnn lines that describe the grid. Each line has nnn letters. Print kkk lines: for each letter, the number of subgrids. Input: Output:"
  },
  {
    "title": "Filled Subgrid Count II",
    "url": "https://cses.fi/problemset/task/3414",
    "description": "You are given a grid of letters. Your task is to calculate, for each letter, the number of rectangular subgrids whose each letter is the same. The first line has two integers nnn and kkk: the size of the grid and the number of letters. The letters are the first kkk uppercase letters. After this, there are nnn lines that describe the grid. Each line has nnn letters. Print kkk lines: for each letter, the number of subgrids. Input: Output:"
  },
  {
    "title": "All Letter Subgrid Count I",
    "url": "https://cses.fi/problemset/task/3415",
    "description": "You are given a grid of letters. Your task is to calculate the number of square subgrids that contain all the letters. The first line has two integers nnn and kkk: the size of the grid and the number of letters. The letters are the first kkk uppercase letters. After this, there are nnn lines that describe the grid. Each line has nnn letters. Print the number of subgrids. Input: Output:"
  },
  {
    "title": "All Letter Subgrid Count II",
    "url": "https://cses.fi/problemset/task/3416",
    "description": "You are given a grid of letters. Your task is to calculate the number of rectangle subgrids that contain all the letters. The first line has two integers nnn and kkk: the size of the grid and the number of letters. The letters are the first kkk uppercase letters. After this, there are nnn lines that describe the grid. Each line has nnn letters. Print the number of subgrids. Input: Output:"
  },
  {
    "title": "Border Subgrid Count I",
    "url": "https://cses.fi/problemset/task/3417",
    "description": "You are given a grid of letters. Your task is to calculate, for each letter, the number of square subgrids whose border consists of that letter. The first line has two integers nnn and kkk: the size of the grid and the number of letters. The letters are the first kkk uppercase letters. After this, there are nnn lines that describe the grid. Each line has nnn letters. Print kkk lines: for each letter, the number of subgrids. Input: Output:"
  },
  {
    "title": "Border Subgrid Count II",
    "url": "https://cses.fi/problemset/task/3418",
    "description": "You are given a grid of letters. Your task is to calculate, for each letter, the number of rectangular subgrids whose border consists of that letter. The first line has two integers nnn and kkk: the size of the grid and the number of letters. The letters are the first kkk uppercase letters. After this, there are nnn lines that describe the grid. Each line has nnn letters. Print kkk lines: for each letter, the number of subgrids. Input: Output:"
  },
  {
    "title": "Raab Game II",
    "url": "https://cses.fi/problemset/task/3400",
    "description": "Consider a two player game where each player has nnn cards numbered 1,2,…,n1,2,\\dots,n1,2,…,n. On each turn both players place one of their cards on the table. The player who placed the higher card gets one point. If the cards are equal, neither player gets a point. The game continues until all cards have been played. You are given the number of cards nnn and the players' scores at the end of the game, aaa and bbb. Your task is to count the number of possible games with that outcome. The first line contains one integer ttt: the number of tests. Then there are ttt lines, each with three integers nnn, aaa and bbb. For each test case print the number of possible games modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Empty String",
    "url": "https://cses.fi/problemset/task/1080",
    "description": "You are given a string consisting of nnn characters between a and z. On each turn, you may remove any two adjacent characters that are equal. Your goal is to construct an empty string by removing all the characters. In how many ways can you do this? The only input line has a string of length nnn. Print one integer: the number of ways modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Permutation Inversions",
    "url": "https://cses.fi/problemset/task/2229",
    "description": "Your task is to count the number of permutations of 1,2,…,n1,2,\\dots,n1,2,…,n that have exactly kkk inversions (i.e., pairs of elements in the wrong order). For example, when n=4n=4n=4 and k=3k=3k=3, there are 666 such permutations: The only input line has two integers nnn and kkk. Print the answer modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Counting Bishops",
    "url": "https://cses.fi/problemset/task/2176",
    "description": "Your task is to count the number of ways kkk bishops can be placed on an n×nn \\times nn×n chessboard so that no two bishops attack each other. Two bishops attack each other if they are on the same diagonal. The only input line has two integers nnn and kkk: the board size and the number of bishops. Print one integer: the number of ways modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Counting Sequences",
    "url": "https://cses.fi/problemset/task/2228",
    "description": "Your task is to count the number of sequences of length nnn where each element is an integer between 1…k1 \\dots k1…k and each integer between 1…k1 \\dots k1…k appears at least once in the sequence. For example, when n=6n=6n=6 and k=4k=4k=4, some valid sequences are [1,3,1,4,3,2][1,3,1,4,3,2][1,3,1,4,3,2] and [2,2,1,3,4,2][2,2,1,3,4,2][2,2,1,3,4,2]. The only input line has two integers nnn and kkk. Print one integer: the number of sequences modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Grid Paths II",
    "url": "https://cses.fi/problemset/task/1078",
    "description": "Consider an n×nn \\times nn×n grid whose top-left square is (1,1)(1,1)(1,1) and bottom-right square is (n,n)(n,n)(n,n). Your task is to move from the top-left square to the bottom-right square. On each step you may move one square right or down. In addition, there are mmm traps in the grid. You cannot move to a square with a trap. What is the total number of possible paths? The first input line contains two integers nnn and mmm: the size of the grid and the number of traps. After this, there are mmm lines describing the traps. Each such line contains two integers yyy and xxx: the location of a trap. You can assume that there are no traps in the top-left and bottom-right square. Print the number of paths modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Counting Permutations",
    "url": "https://cses.fi/problemset/task/1075",
    "description": "A permutation of integers 1,2,…,n1,2,\\ldots,n1,2,…,n is called beautiful if there are no adjacent elements whose difference is 111. Given nnn, your task is to count the number of beautiful permutations. The only input line contains an integer nnn. Print the number of beautiful permutations of 1,2,…,n1,2,\\ldots,n1,2,…,n modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Grid Completion",
    "url": "https://cses.fi/problemset/task/2429",
    "description": "Your task is to create an n×nn \\times nn×n grid whose each row and column has exactly one A and B. Some of the characters have already been placed. In how many ways can you complete the grid? The first input line has an integer nnn: the size of the grid. After this, there are nnn lines that describe the grid. Each line has nnn characters: . means an empty square, and A and B show the characters already placed. You can assume that every row and column has at most one A and B. Print one integer: the number of ways modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Counting Reorders",
    "url": "https://cses.fi/problemset/task/2421",
    "description": "Calculate the number of ways you can reorder the characters of a string so that no two adjacent characters are the same. For example, the answer for aabc is 666, because the possible orders are abac, abca, acab, acba, baca, and caba. The only input line has a string that consists of nnn characters between a–z. Print an integer: the answer modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Tournament Graph Distribution",
    "url": "https://cses.fi/problemset/task/3232",
    "description": "A tournament graph is a directed graph where a single directed edge exists between every pair of nodes. Given nnn, your task is to calculate for each k=1…nk = 1 \\dots nk=1…n the number of tournament graphs that have nnn nodes and kkk strongly connected components. The only line has an integer nnn: the number of nodes. Print nnn lines: for each k=1…nk=1 \\dots nk=1…n the number of graphs modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Collecting Numbers Distribution",
    "url": "https://cses.fi/problemset/task/3157",
    "description": "You are given an array that contains each number between 1…n1 \\dots n1…n exactly once. You collect the numbers in increasing order from 111 to nnn. On each round, you traverse the array from left to right and collect as many consecutive numbers as possible, starting from the smallest number that has not been collected yet. Your task is to determine, for each k=1,2,…,nk=1,2,\\dots,nk=1,2,…,n, the number of arrays that require exactly kkk rounds to collect all the numbers. The only line has an integer nnn. Print nnn numbers: for each k=1,2,…,nk=1,2,\\dots,nk=1,2,…,n, the answer modulo 109+710^9+7109+7. Input: Output: Explanation: The arrays are [1,2,3][1,2,3][1,2,3] (111 round), [1,3,2][1,3,2][1,3,2] (222 rounds), [2,1,3][2,1,3][2,1,3] (222 rounds), [2,3,1][2,3,1][2,3,1] (222 rounds), [3,1,2][3,1,2][3,1,2] (222 rounds), and [3,2,1][3,2,1][3,2,1] (333 rounds)."
  },
  {
    "title": "Functional Graph Distribution",
    "url": "https://cses.fi/problemset/task/2415",
    "description": "A functional graph is a directed graph where each node has outdegree 111. For example, here is a functional graph that has 999 nodes and 222 components: The only input line has an integer nnn: the number of nodes. Print nnn lines: for each k=1…nk=1 \\dots nk=1…n the number of graphs modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Shortest Subsequence",
    "url": "https://cses.fi/problemset/task/1087",
    "description": "You are given a DNA sequence consisting of characters A, C, G, and T. Your task is to find the shortest DNA sequence that is not a subsequence of the original sequence. The only input line contains a DNA sequence with nnn characters. Print the shortest DNA sequence that is not a subsequence of the original sequence. If there are several solutions, you may print any of them. Input: Output:"
  },
  {
    "title": "Distinct Values Sum",
    "url": "https://cses.fi/problemset/task/3150",
    "description": "You are given an array x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​. Let d(a,b)d(a,b)d(a,b) denote the number of distinct values in the subarray xa,xa+1,…,xbx_a,x_{a+1},\\dots,x_bxa​,xa+1​,…,xb​. Your task is to calculate the sum ∑a=1n∑b=and(a,b)\\sum_{a=1}^n \\sum_{b=a}^n d(a,b)∑a=1n​∑b=an​d(a,b), i.e., the sum of d(a,b)d(a,b)d(a,b) for all subarrays. The first line has an integer nnn: the array size. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array contents. Print one integer: the required sum. Input: Output: Explanation: In this array, 666 subarrays have 111 distinct value, 444 subarrays have 222 distinct values and 555 subarrays have 333 distinct values. Thus, the sum is 6⋅1+4⋅2+5⋅3=296\\cdot1+4\\cdot2+5\\cdot3=296⋅1+4⋅2+5⋅3=29."
  },
  {
    "title": "Distinct Values Splits",
    "url": "https://cses.fi/problemset/task/3190",
    "description": "You are given an array of nnn integers. Your task is to count the number of ways to split the array into continuous segments such that all segments consists of distinct values. The first line has an integers nnn: the size of the array. The next line has nnn integers x1,x2,…,xnx_1, x_2,\\dots, x_nx1​,x2​,…,xn​: the contents of the array. Print one integer: the answer to the problem modulo 109+710^9 + 7109+7. Input: Output: Explanation: There are six valid splits:"
  },
  {
    "title": "Swap Game",
    "url": "https://cses.fi/problemset/task/1670",
    "description": "You are given a 3×33 \\times 33×3 grid containing the numbers 1,2,…,91,2,\\dots,91,2,…,9. Your task is to perform a sequence of moves so that the grid will look like this:\n123456789\n\\begin{matrix}\n1 & 2 & 3 \\\\\n4 & 5 & 6 \\\\\n7 & 8 & 9 \\\\\n\\end{matrix}\n147​258​369​\nOn each move, you can swap the numbers in any two adjacent squares (horizontally or vertically). What is the minimum number of moves required? The input has three lines, and each of them has three integers. Print one integer: the minimum number of moves. Input: Output:"
  },
  {
    "title": "Beautiful Permutation II",
    "url": "https://cses.fi/problemset/task/3175",
    "description": "A permutation of integers 1,2,…,n1,2,\\ldots,n1,2,…,n is called beautiful if there are no adjacent elements whose difference is 111. Given nnn, construct the lexicographically minimal beautiful permutation if such a permutation exists. The only line contains an integer nnn. Print the lexicographically minimal beautiful permutation of integers 1,2,…,n1,2,\\ldots,n1,2,…,n. If there is no such permutation, print \"NO SOLUTION\". Input: Output: Input: Output:"
  },
  {
    "title": "Multiplication Table",
    "url": "https://cses.fi/problemset/task/2422",
    "description": "Find the middle element when the numbers in an n×nn \\times nn×n multiplication table are sorted in increasing order. It is assumed that nnn is odd. For example, the 3×33 \\times 33×3 multiplication table is as follows:\n123246369\n\\begin{matrix}\n1 & 2 & 3 \\\\\n2 & 4 & 6 \\\\\n3 & 6 & 9 \\\\\n\\end{matrix}\n123​246​369​\nThe numbers in increasing order are [1,2,2,3,3,4,6,6,9][1,2,2,3,3,4,6,6,9][1,2,2,3,3,4,6,6,9], so the answer is 333. The only input line has an integer nnn. Print one integer: the answer to the task. Input: Output:"
  },
  {
    "title": "Bubble Sort Rounds I",
    "url": "https://cses.fi/problemset/task/3151",
    "description": "Bubble sort is a sorting algorithm that consists of a number of rounds. On each round the algorithm scans the array from left to right and swaps any adjacent elements that are in the wrong order. Given an array of nnn integers, calculate the number of bubble sort rounds needed to sort the array. The first line has an integer nnn: the array size. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array contents. Print one integer: the number of rounds. Input: Output: Explanation: Bubble sort needs three rounds to sort this array. The array contents after each round are [2,3,1,4,4][2,3,1,4,4][2,3,1,4,4], [2,1,3,4,4][2,1,3,4,4][2,1,3,4,4], and [1,2,3,4,4][1,2,3,4,4][1,2,3,4,4]."
  },
  {
    "title": "Bubble Sort Rounds II",
    "url": "https://cses.fi/problemset/task/3152",
    "description": "Bubble sort is a sorting algorithm that consists of a number of rounds. On each round the algorithm scans the array from left to right and swaps any adjacent elements that are in the wrong order. Given an array of nnn integers, find out the contents of the array after kkk bubble sort rounds. The first line has two integers nnn and kkk: the array size and the number of rounds. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array contents. Print nnn integers: the contents of the array after kkk rounds. Input: Output:"
  },
  {
    "title": "Nearest Campsites I",
    "url": "https://cses.fi/problemset/task/3306",
    "description": "A campground is represented as a grid where each square can contain a campsite that is either reserved or free. The distance between two squares (x1,y1)(x_1, y_1)(x1​,y1​) and (x2,y2)(x_2, y_2)(x2​,y2​) is the Manhattan distance ∣x1−x2∣+∣y1−y2∣|x_1 - x_2| + |y_1 - y_2|∣x1​−x2​∣+∣y1​−y2​∣. Your task is to find the maximum distance from a free campsite to the nearest reserved campsite. The first line has two integers nnn and mmm:\nthe number of reserved and free campsites. The next nnn lines describe the locations of the reserved campsites. Each line has two integers xxx and yyy. The next mmm lines describe the locations of the free campsites. Each line has two integers xxx and yyy. You can assume that each square contains at most one campsite. Print one integer: the longest distance to the nearest reserved campsite. Input: Output: Explanation: The following figure shows the map of the campground: In this case, the best choice is the free campsite on the right, whose distance to the nearest reserved campsite is 555."
  },
  {
    "title": "Nearest Campsites II",
    "url": "https://cses.fi/problemset/task/3307",
    "description": "A campground is represented as a grid where each square can contain a campsite that is either reserved or free. The distance between two squares (x1,y1)(x_1, y_1)(x1​,y1​) and (x2,y2)(x_2, y_2)(x2​,y2​) is the Manhattan distance ∣x1−x2∣+∣y1−y2∣|x_1 - x_2| + |y_1 - y_2|∣x1​−x2​∣+∣y1​−y2​∣. Your task is to find the distance from each free campsite to the nearest reserved campsite. The first line has two integers nnn and mmm:\nthe number of reserved and free campsites. The next nnn lines describe the locations of the reserved campsites. Each line has two integers xxx and yyy. The next mmm lines describe the locations of the free campsites. Each line has two integers xxx and yyy. You can assume that each square contains at most one campsite. Print mmm integers: the distances from each free campsite to the nearest reserved campsite, in the input order. Input: Output: Explanation: The following figure shows the map of the campground: The distance from the first free campsite (on the left) to the nearest reserved campsite is 222, and the distance from the second free campsite (on the right) to the nearest reserved campsite is 555."
  },
  {
    "title": "Advertisement",
    "url": "https://cses.fi/problemset/task/1142",
    "description": "A fence consists of nnn vertical boards. The width of each board is 1 and their heights may vary. You want to attach a rectangular advertisement to the fence. What is the maximum area of such an advertisement? The first input line contains an integer nnn: the width of the fence. After this, there are nnn integers k1,k2,…,knk_1,k_2,\\ldots,k_nk1​,k2​,…,kn​: the height of each board. Print one integer: the maximum area of an advertisement. Input: Output:"
  },
  {
    "title": "Special Substrings",
    "url": "https://cses.fi/problemset/task/2186",
    "description": "A substring is called special if every character that appears in the string appears the same number of times in the substring. Your task is to count the number of special substrings in a given string. The only input line has a string of length nnn. Every character is between a...z. Print one integer: the number of special substrings. Input: Output: Explanation: The special substrings are abc, cab, abccab, bccaba and ccabab."
  },
  {
    "title": "Counting LCM Arrays",
    "url": "https://cses.fi/problemset/task/3169",
    "description": "Given two integers nnn and kkk, your task is to count the number of arrays a1,a2,…,ana_1, a_2,\\dots, a_na1​,a2​,…,an​ of positive integers where lcm⁡(ai,ai+1)=k\\operatorname{lcm}(a_i, a_{i+1}) = klcm(ai​,ai+1​)=k for all 1≤i<n1 \\le i < n1≤i<n. The first line has an integer ttt: the number of test cases. The next ttt lines have two integers nnn and kkk: the length of the array and the value of lcm. Print ttt integers: the answer to each test case modulo 109+710^9 + 7109+7. Input: Output: Explanation: The arrays for the first test case are [1,4,1][1, 4, 1][1,4,1], [1,4,2][1, 4, 2][1,4,2], [1,4,4][1, 4, 4][1,4,4], [2,4,1][2, 4, 1][2,4,1], [2,4,2][2, 4, 2][2,4,2], [2,4,4][2, 4, 4][2,4,4], [4,1,4][4, 1, 4][4,1,4], [4,2,4][4, 2, 4][4,2,4], [4,4,1][4, 4, 1][4,4,1], [4,4,2][4, 4, 2][4,4,2] and [4,4,4][4, 4, 4][4,4,4]."
  },
  {
    "title": "Square Subsets",
    "url": "https://cses.fi/problemset/task/3193",
    "description": "Given an array of nnn integers, count the number of subsets whose elements' product is a square number. Also count the empty subset with product equal to one. The first line has an integer nnn: the size of the array. The next line has nnn integers x1,x2,…,xnx_1, x_2,\\dots, x_nx1​,x2​,…,xn​: the contents of the array. Print one integer: the answer to the problem modulo 109+710^9 + 7109+7. Input: Output:"
  },
  {
    "title": "Subarray Sum Constraints",
    "url": "https://cses.fi/problemset/task/3294",
    "description": "Your task is to construct an array x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​ consisting of nnn integers. The array must satisfy mmm constraints of the form (l,r,s)(l,r,s)(l,r,s): the sum xl+xl+1+⋯+xrx_l + x_{l+1} + \\dots  + x_rxl​+xl+1​+⋯+xr​ must equal sss. The first line has two integers nnn and mmm: the length of the array and the number of constraints. The next mmm lines each have three integers lll, rrr and sss: the description of the constraints. If a solution exists, print YES on the first line. On the second line, print nnn integers x1,x2,…,xnx_1, x_2,\\dots, x_nx1​,x2​,…,xn​: the contents of the array. All elements of the array must satisfy −1015≤xi≤1015-10^{15} \\le x_i \\le 10^{15}−1015≤xi​≤1015 and the array must satisfy all given constraints. You can print any valid solution. If no solution exists, just print NO. Input: Output:"
  },
  {
    "title": "Water Containers Moves",
    "url": "https://cses.fi/problemset/task/3213",
    "description": "There are two water containers: container AAA has volume aaa and container BBB has volume bbb. Your want to measure xxx units of water using the containers. Initially both containers are empty. On each move, you can fill a container, empty a container or move water from a container to another container. When you move water, you must always fill or empty at least one container. After the moves, container AAA must have xxx units of water. Find a sequence of moves where the total amount of moved water is minimum or state that it is impossible to measure the water. The only line has three integers aaa, bbb and xxx. First print two integers nnn and mmm: the number of moves and the total amount of water moved. After that print a sequence of nnn moves. Each move must move at least one unit of water and be one of the following: If it is not possible to measure the water, only print −1-1−1. Input: Output:"
  },
  {
    "title": "Water Containers Queries",
    "url": "https://cses.fi/problemset/task/3214",
    "description": "There are two water containers: container AAA has volume aaa and container BBB has volume bbb. You want to measure xxx units of water using the containers. Initially both containers are empty. On each move, you can fill a container, empty a container or move water from a container to another container. When you move water, you must always fill or empty at least one container. After the moves, container AAA must have xxx units of water. Your task is to efficiently check if it is possible to measure the water in several cases. The first line has integer nnn: the number of tests. After this, there are nnn lines. Each line has three integers aaa, bbb and xxx. For each test, print YES if it is possible to measure the water and NO otherwise. Input: Output:"
  },
  {
    "title": "Stack Weights",
    "url": "https://cses.fi/problemset/task/2425",
    "description": "You have nnn coins, each of which has a distinct weight. There are two stacks which are initially empty. On each step you move one coin to a stack. You never remove a coin from a stack. After each move, your task is to determine which stack is heavier (if we can be sure that either stack is heavier). The first input line has an integer nnn: the number of coins. The coins are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. You know that coin iii is always heavier than coin i−1i-1i−1, but you don't know their exact weights. After this, there are nnn lines that describe the moves. Each line has two integers ccc and sss: move coin ccc to stack sss (1 = left, 2 = right). After each move, print < if the right stack is heavier, > if the left stack is heavier, and ? if we can't know which stack is heavier. Input: Output: Explanation: After the last move, if the coins are [2,3,4][2,3,4][2,3,4], the left stack is heavier, but if the coins are [1,2,5][1,2,5][1,2,5], the right stack is heavier."
  },
  {
    "title": "Maximum Average Subarrays",
    "url": "https://cses.fi/problemset/task/3301",
    "description": "You are given an array of nnn integers. For each i=1,2,…,ni = 1, 2,\\dots, ni=1,2,…,n, your task is to find the subarray ending at index iii with the largest average. If there are multiple subarrays with the largest average, you should find the longest one. The first line has an integer nnn: the size of the array. The next line has nnn integers x1,x2,…,xnx_1, x_2,\\dots, x_nx1​,x2​,…,xn​: the contents of the array. Print nnn integers: the length of the subarray ending at index iii with the largest average for each i=1,2,…,ni = 1, 2,\\dots, ni=1,2,…,n. Input: Output: Explanation: Consider i=5i = 5i=5. The averages of all subarrays ending at index 555 are 1+6+4+6+25=3.8\\frac{1 + 6 + 4 + 6 + 2}{5} = 3.851+6+4+6+2​=3.8, 6+4+6+24=4.5\\frac{6 + 4 + 6 + 2}{4} = 4.546+4+6+2​=4.5, 4+6+23=4\\frac{4 + 6 + 2}{3} = 434+6+2​=4, 6+22=4\\frac{6 + 2}{2} = 426+2​=4 and 21=2\\frac{2}{1} = 212​=2. The largest average is 4.54.54.5 and the length of the corresponding subarray is 444."
  },
  {
    "title": "Subsets with Fixed Average",
    "url": "https://cses.fi/problemset/task/3302",
    "description": "You are given an array of nnn integers. Your task is to count the number of non-empty subsets of the given array with average equal to aaa. The first line has two integers nnn and aaa: the size of the array and the target average. The next line has nnn integers x1,x2,…,xnx_1, x_2,\\dots, x_nx1​,x2​,…,xn​: the contents of the array. Print one integer: the number of non-empty subsets with average equal to aaa, modulo 109+710^9 + 7109+7. Input: Output:"
  },
  {
    "title": "Two Array Average",
    "url": "https://cses.fi/problemset/task/3361",
    "description": "You are given two arrays of nnn integers. Your task is to select a nonempty prefix from both arrays such that the average of all selected numbers is as large as possible. The first line has an integer nnn. The second line has nnn integers a1,a2,…,ana_1,a_2,\\dots,a_na1​,a2​,…,an​: the numbers in the first array. The third line has nnn integers b1,b2,…,bnb_1,b_2,\\dots,b_nb1​,b2​,…,bn​: the numbers in the second array. Print two numbers: the prefix sizes. Your answer is considered correct if the absolute or relative difference to the maximum average is at most 10−610^{-6}10−6. Input: Output: Explanation: if you choose the prefixes [1,5,5][1,5,5][1,5,5] and [3][3][3], the average is (1+5+5+3)/4=3.5(1+5+5+3)/4=3.5(1+5+5+3)/4=3.5 which is the maximum possible average."
  },
  {
    "title": "Pyramid Array",
    "url": "https://cses.fi/problemset/task/1747",
    "description": "You are given an array consisting of nnn distinct integers. On each move, you can swap any two adjacent values. You want to transform the array into a pyramid array. This means that the final array has to be first increasing and then decreasing. It is also allowed that the final array is only increasing or decreasing. What is the minimum number of moves needed? The first input line has an integer nnn: the size of the array. The next line has nnn distinct integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the contents of the array. Print one integer: the minimum number of moves. Input: Output: Explanation: You may swap the first two values which creates a pyramid array [1,2,5,3][1,2,5,3][1,2,5,3]."
  },
  {
    "title": "Permutation Subsequence",
    "url": "https://cses.fi/problemset/task/3404",
    "description": "Given two arrays which are permutations, find their longest common subsequence. A subsequence is a sequence of array elements from left to right that can contain gaps. A common subsequence is a subsequence that appears in both arrays. The first line has two integers nnn and mmm: the sizes of the arrays. The second line has nnn integers a1,a2,…,ana_1,a_2,\\dots,a_na1​,a2​,…,an​: the contents of the first array. The third line has mmm integers b1,b2,…,bmb_1,b_2,\\dots,b_mb1​,b2​,…,bm​: the contents of the second array. First print the length of the longest common subsequence. After that, an example of such a sequence. If there are several solutions, you can print any of them. Input: Output:"
  },
  {
    "title": "Bit Inversions",
    "url": "https://cses.fi/problemset/task/1188",
    "description": "There is a bit string consisting of nnn bits. Then, there are some changes that invert one given bit. Your task is to report, after each change, the length of the longest substring whose each bit is the same. The first input line has a bit string consisting of nnn bits. The bits are numbered 1,2,…,n1,2,\\ldots,n1,2,…,n. The next line contains an integer mmm: the number of changes. The last line contains mmm integers x1,x2,…,xmx_1,x_2,\\ldots,x_mx1​,x2​,…,xm​ describing the changes. After each change, print the length of the longest substring whose each bit is the same. Input: Output: Explanation: The bit string first becomes 000011, then 010011, and finally 010001."
  },
  {
    "title": "Writing Numbers",
    "url": "https://cses.fi/problemset/task/1086",
    "description": "You would like to write a list of positive integers 1,2,3,…1,2,3,\\ldots1,2,3,… using your computer. However, you can press each key 000–999 at most nnn times during the process. What is the last number you can write? The only input line contains the value of nnn. Print the last number you can write. Input: Output: Explanation: You can write the numbers 1,2,…,121,2,\\ldots,121,2,…,12. This requires that you press key 111 five times, so you cannot write the number 131313."
  },
  {
    "title": "Letter Pair Move Game",
    "url": "https://cses.fi/problemset/task/2427",
    "description": "There are 2n2n2n boxes in a line. Two adjacent boxes are empty, and all other boxes have a letter \"A\" or \"B\". Both letters appear in exactly n−1n-1n−1 boxes. Your task is to move the letters so that all letters \"A\" appear before any letter \"B\". On each turn you can choose any two adjacent boxes that have a letter and move the letters to the two adjacent empty boxes, preserving their order. It can be proven that either there is a solution that consists of at most 10n10n10n turns or there are no solutions. The first line has an integer nnn: there are 2n2n2n boxes. The second line has a string of 2n2n2n characters which describes the starting position. Each character is \"A\", \"B\" or \".\" (empty box). First print an integer kkk: the number of turns. After this, print kkk lines that describe the moves. You can print any solution, as long as k≤1000k \\le 1000k≤1000. If there are no solutions, print only \"-1\". Input: Output: Input: Output:"
  },
  {
    "title": "Maximum Building I",
    "url": "https://cses.fi/problemset/task/1147",
    "description": "You are given a map of a forest where some squares are empty and some squares have trees. What is the maximum area of a rectangular building that can be placed in the forest so that no trees must be cut down? The first input line contains integers nnn and mmm: the size of the forest. After this, the forest is described. Each square is empty (.) or has trees (*). Print the maximum area of a rectangular building. Input: Output:"
  },
  {
    "title": "Sorting Methods",
    "url": "https://cses.fi/problemset/task/1162",
    "description": "Here are some possible methods using which we can sort the elements of an array in increasing order: Given a permutation of numbers 1,2,…,n1,2,\\ldots,n1,2,…,n, calculate the minimum number of steps to sort the array using the above methods. The first input line contains an integer nnn. The second line contains nnn integers describing the permutation. Print four numbers: the minimum number of steps using each method. Input: Output:"
  },
  {
    "title": "Cyclic Array",
    "url": "https://cses.fi/problemset/task/1191",
    "description": "You are given a cyclic array consisting of nnn values. Each element has two neighbors; the elements at positions nnn and 111 are also considered neighbors. Your task is to divide the array into subarrays so that the sum of each subarray is at most kkk. What is the minimum number of subarrays? The first input line contains integers nnn and kkk. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the contents of the array. There is always at least one division (i.e., no value in the array is larger than kkk). Print one integer: the minimum number of subarrays. Input: Output: Explanation: We can create three subarrays: [2,2,1][2,2,1][2,2,1], [3,1][3,1][3,1], and [2,1,2][2,1,2][2,1,2] (remember that the array is cyclic)."
  },
  {
    "title": "List of Sums",
    "url": "https://cses.fi/problemset/task/2414",
    "description": "List AAA consists of nnn positive integers, and list BBB contains the sum of each element pair of list AAA. For example, if A=[1,2,3]A=[1,2,3]A=[1,2,3], then B=[3,4,5]B=[3,4,5]B=[3,4,5], and if A=[1,3,3,3]A=[1,3,3,3]A=[1,3,3,3], then B=[4,4,4,6,6,6]B=[4,4,4,6,6,6]B=[4,4,4,6,6,6]. Given list BBB, your task is to reconstruct list AAA. The first input line has an integer nnn: the size of list AAA. The next line has n(n−1)2\\frac{n(n-1)}{2}2n(n−1)​ integers: the contents of list BBB. You can assume that there is a list AAA that corresponds to the input, and each value in AAA is between 1…k1 \\dots k1…k. Print nnn integers: the contents of list AAA. You can print the values in any order. If there are more than one solution, you can print any of them. Input: Output: Explanation: In this case list AAA can be either [1,3,3,3][1,3,3,3][1,3,3,3] or [2,2,2,4][2,2,2,4][2,2,2,4] and both solutions are accepted."
  },
  {
    "title": "Bouncing Ball Steps",
    "url": "https://cses.fi/problemset/task/3215",
    "description": "There is a ball at the top-left corner of an n×mn \\times mn×m grid. The rows of the grid are numbered 1,2,…,n1,2,\\dots,n1,2,…,n, and the columns are numbered 1,2,…,m1,2,\\dots,m1,2,…,m. The ball is initially moving diagonally away from the top-left corner. At every step, it moves one cell. Whenever the ball hits the border of the grid, it changes its direction. What is the location of the ball after kkk steps and how many times has it changed direction? The first line has an integer ttt: the number of tests. After this, there are ttt lines. Each line has three integers nnn, mmm and kkk: the size of the grid and the number of steps. For each test, print three integers: the location of the ball and the number of direction changes. Input: Output:"
  },
  {
    "title": "Bouncing Ball Cycle",
    "url": "https://cses.fi/problemset/task/3216",
    "description": "There is a ball at the top-left corner of an n×mn \\times mn×m grid. The rows of the grid are numbered 1,2,…,n1,2,\\dots,n1,2,…,n, and the columns are numbered 1,2,…,m1,2,\\dots,m1,2,…,m. The ball is initially moving diagonally away from the top-left corner. At every step, it moves one cell. Whenever the ball hits the border of the grid, it changes its direction. After how many steps has the ball reached its initial location again? What is the number of distinct cells it has visited? The first line has an integer ttt: the number of tests. After this, there are ttt lines. Each line has two integers nnn, mmm: the size of the grid. For each test, print two integers: the number of steps and the number of visited cells. Input: Output:"
  },
  {
    "title": "Knight Moves Queries",
    "url": "https://cses.fi/problemset/task/3218",
    "description": "There is a knight on an infinite chessboard. The rows and columns are 111-indexed. Your task is to efficiently process queries of the form: when the knight starts at position (x,y)(x,y)(x,y), what is the minimum number of moves the knight needs to do to reach the top-left corner. The first line has an integer nnn: the number of queries. After this, there are nnn lines. Each line has two integers xxx and yyy: the knight position. For each query, print the minimum number of moves. Input: Output:"
  },
  {
    "title": "K Subset Sums I",
    "url": "https://cses.fi/problemset/task/3108",
    "description": "You are given an array of nnn integers. Consider the sums of all 2n2^n2n subsets of the given array (including the empty subset with sum equal to zero). Your task is to find the kkk smallest subset sums. The first line has two integers nnn and kkk: the size of the array and the number of subset sums kkk. The next line has nnn integers x1,x2,…,xnx_1, x_2,\\dots, x_nx1​,x2​,…,xn​: the contents of the array. Print kkk integers: the kkk smallest subset sums in increasing order. Input: Output:"
  },
  {
    "title": "K Subset Sums II",
    "url": "https://cses.fi/problemset/task/3109",
    "description": "You are given an array of nnn integers. Consider the sums of all (nm)\\binom{n}{m}(mn​) subsets of the given array with exactly mmm elements. Your task is to find the kkk smallest subset sums. The first line has three integers nnn, mmm and kkk: the size of the array, the size of the subsets and the number of subset sums kkk. The next line has nnn integers x1,x2,…,xnx_1, x_2,\\dots, x_nx1​,x2​,…,xn​: the contents of the array. Print kkk integers: the kkk smallest subset sums in increasing order. Input: Output:"
  },
  {
    "title": "Increasing Array II",
    "url": "https://cses.fi/problemset/task/2132",
    "description": "You are given an array of nnn integers. You want to modify the array so that it is increasing, i.e., every element is at least as large as the previous element. On each move, you can increase or decrease the value of any element by one. What is the minimum number of moves required? The first input line contains an integer nnn: the size of the array. Then, the second line contains nnn integers x1,x2,…,xnx_1,x_2,\\ldots,x_nx1​,x2​,…,xn​: the contents of the array. Print the minimum number of moves. Input: Output:"
  },
  {
    "title": "Food Division",
    "url": "https://cses.fi/problemset/task/1189",
    "description": "There are nnn children around a round table. For each child, you know the amount of food they currently have and the amount of food they want. The total amount of food in the table is correct. At each step, a child can give one unit of food to his or her neighbour. What is the minimum number of steps needed? The first input line contains an integer nnn: the number of children. The next line has nnn integers a1,a2,…,ana_1,a_2,\\ldots,a_na1​,a2​,…,an​: the current amount of food for each child. The last line has nnn integers b1,b2,…,bnb_1,b_2,\\ldots,b_nb1​,b2​,…,bn​: the required amount of food for each child. Print one integer: the minimum number of steps. Input: Output: Explanation: Child 1 gives one unit of food to child 3, and child 2 gives one unit of food to child 3."
  },
  {
    "title": "Swap Round Sorting",
    "url": "https://cses.fi/problemset/task/1698",
    "description": "You are given an array containing a permutation of numbers 1,2,…,n1,2,\\dots,n1,2,…,n, and your task is to sort the array using swap rounds. On each swap round, you can choose any number of distinct pairs of elements and swap each pair. Your task is to find the minimum number of rounds and show how you can choose the pairs in each round. The first input line has an integer nnn: the size of the array. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the initial permutation. First print an integer kkk: the minimum number of rounds. Then, for each round, print the number of swaps and the indices of each swap. You can print any valid solution. Input: Output: Explanation: The initial array is [5,2,1,3,4][5,2,1,3,4][5,2,1,3,4]. After round 111, the array becomes [1,2,5,4,3][1,2,5,4,3][1,2,5,4,3]. After round 222, the array becomes [1,2,3,4,5][1,2,3,4,5][1,2,3,4,5]."
  },
  {
    "title": "Binary Subsequences",
    "url": "https://cses.fi/problemset/task/2430",
    "description": "Your task is to find a minimum length bit string that has exactly nnn distinct subsequences. For example, a correct solution for n=6n=6n=6 is 101 whose distinct subsequences are 0, 1, 01, 10, 11 and 101. The only input line has an integer nnn. Print one bit string: a solution to the task. You can print any valid solution. Input: Output:"
  },
  {
    "title": "School Excursion",
    "url": "https://cses.fi/problemset/task/1706",
    "description": "A group of nnn children are coming to Helsinki. There are two possible attractions: a child can visit either Korkeasaari (zoo) or Linnanmäki (amusement park). There are mmm pairs of children who want to visit the same attraction. Your task is to find all possible alternatives for the number of children that will visit Korkeasaari. The children's wishes have to be taken into account. The first input line has two integers nnn and mmm: the number of children and their wishes. The children are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are mmm lines describing the children's wishes. Each line has two integers aaa and bbb: children aaa and bbb want to visit the same attraction. Print a bit string of length nnn where a one-bit at index iii indicates that it is possible that exactly iii children visit Korkeasaari (the bit string is to be considered one-indexed). Input: Output: Explanation: The number of children visiting Korkeasaari can be 111, 444 or 555."
  },
  {
    "title": "Coin Grid",
    "url": "https://cses.fi/problemset/task/1709",
    "description": "There is an n×nn \\times nn×n grid whose each square is empty or has a coin. On each move, you can remove all coins in a row or column. What is the minimum number of moves after which the grid is empty? The first input line has an integer nnn: the size of the grid. The rows and columns are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. After this, there are nnn lines describing the grid. Each line has nnn characters: each character is either . (empty) or o (coin). First print an integer kkk: the minimum number of moves. After this, print kkk lines describing the moves. On each line, first print 111 (row) or 222 (column), and then the number of a row or column. You can print any valid solution. Input: Output:"
  },
  {
    "title": "Grid Coloring II",
    "url": "https://cses.fi/problemset/task/3312",
    "description": "You are given an n×mn\\times mn×m grid where each cell contains one character A, B or C. For each cell, you must change the character to A, B or C. The new character must be different from the old one. Your task is to change the characters in every cell such that no two adjacent cells have the same character. The first line has two integers nnn and mmm: the number of rows and columns. The next nnn lines each have mmm characters: the description of the grid. Print nnn lines each with mmm characters: the description of the final grid. You may print any valid solution. If no solution exists, just print IMPOSSIBLE. Input: Output:"
  },
  {
    "title": "Programmers and Artists",
    "url": "https://cses.fi/problemset/task/2426",
    "description": "A company wants to hire aaa programmers and bbb artists. There are a total of nnn applicants, and each applicant can become either a programmer or an artist. You know each applicant's programming and artistic skills. Your task is to select the new employees so that the sum of their skills is maximum. The first input line has three integers aaa, bbb and nnn: the required number of programmers and artists, and the total number of applicants. After this, there are nnn lines that describe the applicants. Each line has two integers xxx and yyy: the applicant's programming and artistic skills. Print one integer: the maximum sum of skills. Input: Output: Explanation: An optimal solution is to hire two programmers with skills 999 and 444 and one artist with skill 777. The sum of the skills is 9+4+7=209+4+7=209+4+7=20."
  },
  {
    "title": "Removing Digits II",
    "url": "https://cses.fi/problemset/task/2174",
    "description": "You are given an integer nnn. On each step, you may subtract from it any one-digit number that appears in it. How many steps are required to make the number equal to 000? The only input line has an integer nnn. Print one integer: the minimum number of steps. Input: Output: Explanation: An optimal solution is 27→20→18→10→9→027 \\rightarrow 20 \\rightarrow 18 \\rightarrow 10 \\rightarrow 9 \\rightarrow 027→20→18→10→9→0."
  },
  {
    "title": "Coin Arrangement",
    "url": "https://cses.fi/problemset/task/2180",
    "description": "There is a 2×n2 \\times n2×n grid whose each cell contains some number of coins. The total number of coins is 2n2n2n. Your task is to arrange the coins so that each cell contains exactly one coin. On each move you can choose any coin and move it one step left, right, up or down. What is the minimum number of moves if you act optimally? The first input line has an integer nnn: the width of the grid. After this, there are two lines that describe the grid. Each line has nnn integers: the number of coins in each cell. Print one integer: the minimum number of moves. Input: Output:"
  },
  {
    "title": "Replace with Difference",
    "url": "https://cses.fi/problemset/task/3159",
    "description": "You are given an array of nnn integers. You will perform n−1n-1n−1 operations on the array. In one operation, you will choose two numbers aaa and bbb from the array, delete both of them from the array and add ∣a−b∣|a - b|∣a−b∣ into the array. Your task is to find a sequence of operations such that the last number remaining in the array is 000. The first line has an integer nnn: the length of the array. The next line has nnn integers x1,x2,…,xnx_1, x_2,\\dots, x_nx1​,x2​,…,xn​: the contents of the array. Print n−1n-1n−1 lines each containing two integers aaa and bbb: the numbers chosen in the operations. You can print any valid solution. If no solution exists, print only −1-1−1. Input: Output: Explanation: The array changes as follows:"
  },
  {
    "title": "Grid Puzzle I",
    "url": "https://cses.fi/problemset/task/2432",
    "description": "There is an n×nn \\times nn×n grid, and your task is to choose from each row and column some number of squares. How can you do that? The first input line has an integer nnn: the size of the grid. The rows and columns are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The next line has nnn integers a1,a2,…,ana_1,a_2,\\ldots,a_na1​,a2​,…,an​: You must choose exactly aia_iai​ squares from the iiith row. The las line has nnn integers b1,b2,…,bnb_1,b_2,\\ldots,b_nb1​,b2​,…,bn​: You must choose exactly bjb_jbj​ squares from the jjjth column. Print nnn lines describing which squares you choose (X means that you choose a square, . means that you don't choose it). You can print any valid solution. If it is not possible to satisfy the conditions print only −1-1−1. Input: Output:"
  },
  {
    "title": "Grid Puzzle II",
    "url": "https://cses.fi/problemset/task/2131",
    "description": "There is an n×nn \\times nn×n grid whose each square has some number of coins in it. You know for each row and column how many squares you must choose from that row or column. You get all coins from every square you choose. What is the maximum number of coins you can collect and how could you choose the squares so that the given conditions are satisfied? The first input line has an integer nnn: the size of the grid. The rows and columns are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The next line has nnn integers a1,a2,…,ana_1,a_2,\\ldots,a_na1​,a2​,…,an​: You must choose exactly aia_iai​ squares from the iiith row. The next line has nnn integers b1,b2,…,bnb_1,b_2,\\ldots,b_nb1​,b2​,…,bn​: You must choose exactly bjb_jbj​ squares from the jjjth column. Finally, there are nnn lines describing the grid. You can assume that the sums of a1,a2,…,ana_1,a_2,\\ldots,a_na1​,a2​,…,an​ and b1,b2,…,bnb_1,b_2,\\ldots,b_nb1​,b2​,…,bn​ are equal. First print an integer kkk: the maximum number of coins you can collect. After this print nnn lines describing which squares you choose (X means that you choose a square, . means that you don't choose it). If it is not possible to satisfy the conditions print only −1-1−1. Input: Output:"
  },
  {
    "title": "Bit Substrings",
    "url": "https://cses.fi/problemset/task/2115",
    "description": "You are given a bit string of length nnn. Your task is to calculate for each kkk between 0…n0  \\ldots n0…n the number of non-empty substrings that contain exactly kkk ones. For example, if the string is 101, there are: The only input line contains a binary string of length nnn. Print n+1n+1n+1 values as specified above. Input: Output:"
  },
  {
    "title": "Reversal Sorting",
    "url": "https://cses.fi/problemset/task/2075",
    "description": "You have an array that contains a permutation of integers 1,2,…,n1,2,\\dots,n1,2,…,n. Your task is to sort the array in increasing order by reversing subarrays. You can construct any solution that has at most nnn reversals. The first input line has an integer nnn: the size of the array. The array elements are numbered 1,2,…,n1,2,\\dots,n1,2,…,n. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the contents of the array. First print an integer kkk: the number of reversals. After that, print kkk lines that describe the reversals. Each line has two integers aaa and bbb: you reverse a subarray from position aaa to position bbb. Input: Output:"
  },
  {
    "title": "Book Shop II",
    "url": "https://cses.fi/problemset/task/1159",
    "description": "You are in a book shop which sells nnn different books. You know the price, the number of pages and the number of copies of each book. You have decided that the total price of your purchases will be at most xxx. What is the maximum number of pages you can buy? You can buy several copies of the same book. The first input line contains two integers nnn and xxx: the number of book and the maximum total price. The next line contains nnn integers h1,h2,…,hnh_1,h_2,\\ldots,h_nh1​,h2​,…,hn​: the price of each book. The next line contains nnn integers s1,s2,…,sns_1,s_2,\\ldots,s_ns1​,s2​,…,sn​: the number of pages of each book. The last line contains nnn integers k1,k2,…,knk_1,k_2,\\ldots,k_nk1​,k2​,…,kn​: the number of copies of each book. Print one integer: the maximum number of pages. Input: Output: Explanation: You can buy three copies of book 1 and one copy of book 3. The price is 3⋅2+3=93 \\cdot 2 + 3 = 93⋅2+3=9 and the number of pages is 3⋅8+4=283 \\cdot 8 + 4 = 283⋅8+4=28."
  },
  {
    "title": "GCD Subsets",
    "url": "https://cses.fi/problemset/task/3161",
    "description": "You are given an array of nnn integers. Your task is to calculate the number of non-empty subsets whose elements' greatest common divisor is equal to kkk for each k=1,…,nk = 1,\\dots, nk=1,…,n. The first line has an integer nnn: the size of the array. The next line has nnn integers x1,x2,…,xnx_1, x_2,\\dots, x_nx1​,x2​,…,xn​: the contents of the array. Print nnn integers as specified above modulo 109+710^9 + 7109+7. Input: Output:"
  },
  {
    "title": "Minimum Cost Pairs",
    "url": "https://cses.fi/problemset/task/3402",
    "description": "Given an array of nnn integers, consider pairings of kkk pairs. Each number can appear in at most one pair, and the cost of a pair (a,b)(a,b)(a,b) is ∣a−b∣|a-b|∣a−b∣. The cost of a pairing is the sum of all costs of the pairs. Calculate the minimum costs of pairings for k=1,2,…,⌊n/2⌋k=1,2,\\dots,\\lfloor n/2 \\rfloork=1,2,…,⌊n/2⌋. The first line has an integer: the array size. The next line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the array contents. Print ⌊n/2⌋\\lfloor n/2 \\rfloor⌊n/2⌋ integers: the minimum costs of pairings. Input: Output: Explanation: Possible minimum-cost pairings are [(3,3)][(3,3)][(3,3)], [(3,3),(7,7)][(3,3),(7,7)][(3,3),(7,7)], [(1,2),(3,3),(7,7)][(1,2),(3,3),(7,7)][(1,2),(3,3),(7,7)] and [(1,2),(3,3),(4,7),(7,9)][(1,2),(3,3),(4,7),(7,9)][(1,2),(3,3),(4,7),(7,9)]."
  },
  {
    "title": "Same Sum Subsets",
    "url": "https://cses.fi/problemset/task/3425",
    "description": "Given a set of nnn positive integers, your task is to choose two disjoint subsets of the elements that have the same sum. The first line has an integer nnn: the set size. The second line has nnn integers x1,x2,…,xnx_1,x_2,\\dots,x_nx1​,x2​,…,xn​: the set elements. For both subsets, first print the size of the subset and then its contents. You can print any valid solution. If there is no solution, print IMPOSSIBLE. Input: Output: Explanation: The first subset is {2,3}\\{2,3\\}{2,3} and the second subset is {5}\\{5\\}{5}."
  },
  {
    "title": "Mex Grid Queries",
    "url": "https://cses.fi/problemset/task/1157",
    "description": "Consider a two-dimensional grid whose rows and columns are 111-indexed. Each square contains the smallest nonnegative integer that does not appear to the left on the same row or above on the same column. Your task is to calculate the value at square (y,x)(y,x)(y,x). The only input line contains two integers yyy and xxx. Print one integer: the value at square (y,x)(y,x)(y,x). Input: Output:"
  },
  {
    "title": "Maximum Building II",
    "url": "https://cses.fi/problemset/task/1148",
    "description": "You are given a map of a forest where some squares are empty and some squares have trees. You want to place a rectangular building in the forest so that no trees need to be cut down. For each building size, your task is to calculate the number of ways you can do this. The first input line contains integers nnn and mmm: the size of the forest. After this, the forest is described. Each square is empty (.) or has trees (*). Print nnn lines each containing mmm integers. Input: Output: Explanation: For example, there are 555 possible places for a building of size 2×42 \\times 42×4."
  },
  {
    "title": "Stick Divisions",
    "url": "https://cses.fi/problemset/task/1161",
    "description": "You have a stick of length xxx and you want to divide it into nnn sticks, with given lengths, whose total length is xxx. On each move you can take any stick and divide it into two sticks. The cost of such an operation is the length of the original stick. What is the minimum cost needed to create the sticks? The first input line has two integers xxx and nnn: the length of the stick and the number of sticks in the division. The second line has nnn integers d1,d2,…,dnd_1,d_2,\\ldots,d_nd1​,d2​,…,dn​: the length of each stick in the division. Print one integer: the minimum cost of the division. Input: Output: Explanation: You first divide the stick of length 888 into sticks of length 333 and 555 (cost 888). After this, you divide the stick of length 555 into sticks of length 222 and 333 (cost 555). The total cost is 8+5=138+5=138+5=13."
  },
  {
    "title": "Stick Difference",
    "url": "https://cses.fi/problemset/task/3401",
    "description": "You are given nnn sticks with lengths a1,a2,…,ana_1,a_2,\\dots,a_na1​,a2​,…,an​.\nYou must make exactly kkk cuts to the sticks, so that\nthe number of sticks becomes n+kn + kn+k. After making the cuts, the difference between the length of the longest and shortest sticks should be as small as possible. Your task is to compute the smallest possible difference for all amounts k=1,2,…,mk=1,2,\\dots,mk=1,2,…,m. The cuts must keep the lengths of the sticks positive integers. You may assume that the sticks can be cut mmm times. The first line contains two integers n,mn,mn,m: the number of sticks and the maximum number of cuts. The second line contains nnn integers a1,a2,…,ana_1,a_2,\\dots,a_na1​,a2​,…,an​:\nthe lengths of the sticks. Print one line with mmm integers: the smallest possible difference if exactly k=1,2,…,mk=1,2,\\dots,mk=1,2,…,m cuts are made. Input: Output: Explanation: When k=1k=1k=1, you can cut the first stick into two sticks of lengths 333 and 444. After this, the stick lengths are [3,4,3,2][3,4,3,2][3,4,3,2] and the maximum difference is 222."
  },
  {
    "title": "Coding Company",
    "url": "https://cses.fi/problemset/task/1665",
    "description": "Your company has nnn coders, and each of them has a skill level between 000 and 100100100. Your task is to divide the coders into teams that work together. Based on your experience, you know that teams work well when the skill levels of the coders are about the same. For this reason, the penalty for creating a team is the skill level difference between the best and the worst coder. In how many ways can you divide the coders into teams such that the sum of the penalties is at most xxx? The first input line has two integers nnn and xxx: the number of coders and the maximum allowed penalty sum. The next line has nnn integers t1,t2,…,tnt_1,t_2,\\dots,t_nt1​,t2​,…,tn​: the skill level of each coder. Print one integer: the number of valid divisions modulo 109+710^9+7109+7. Input: Output:"
  },
  {
    "title": "Two Stacks Sorting",
    "url": "https://cses.fi/problemset/task/2402",
    "description": "You are given an input list that consists of nnn numbers. Each integer between 111 and nnn appears exactly once in the list. Your task is to create a sorted output list using two stacks. On each move you can do one of the following: The first input line has an integer nnn. The second line has nnn integers: the contents of the input list. Print nnn integers: for each number the stack where it is moved (111 or 222). You can print any valid solution. If there are no solutions, print IMPOSSIBLE. Input: Output:"
  }
]